espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 USBAHB register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_USBAHB_H
#define EFR32FG25_USBAHB_H

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_USBAHB_AHBS USBAHB_AHBS
 * @{
 * @brief EFR32FG25 USBAHB_AHBS Register Declaration.
 *****************************************************************************/

/** USBAHB_AHBS DEVINEP Register Group Declaration. */
typedef struct {
  __IOM uint32_t CTL;                                /**< Device Control IN EP 1 CTRL reg                    */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t INT;                                /**< Device IN EP 1 IRQ Register                        */
  uint32_t       RESERVED1[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t TSIZ;                               /**< Device IN EP 1 xfer Size reg                       */
  __IOM uint32_t DMAADDR;                            /**< Device IN EP 1 DMA Address reg                     */
  __IM uint32_t  DTXFSTS;                            /**< Device IN EP TX FIFO stat reg                      */
  uint32_t       RESERVED2[1U];                      /**< Reserved for future use                            */
} USBAHB_DEVINEP_TypeDef;

/** USBAHB_AHBS DEVOUTEP Register Group Declaration. */
typedef struct {
  __IOM uint32_t CTL;                                /**< Device CTRL OUT EP 1 CTRL reg                      */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t INT;                                /**< Device OUT EP 1 IRQ Register                       */
  uint32_t       RESERVED1[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t TSIZ;                               /**< Device OUT EP 1 xfer Size reg                      */
  __IOM uint32_t DMAADDR;                            /**< Device OUT EP 1 DMA addr reg                       */
  uint32_t       RESERVED2[2U];                      /**< Reserved for future use                            */
} USBAHB_DEVOUTEP_TypeDef;

/** USBAHB_AHBS FIFO_0_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO0D;                             /**< Device EP0 FIFO                                    */
} USBAHB_FIFO_0_Data_TypeDef;

/** USBAHB_AHBS FIFO_1_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO1D;                             /**< FIFO1                                              */
} USBAHB_FIFO_1_Data_TypeDef;

/** USBAHB_AHBS FIFO_2_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO2D;                             /**< EP2 data                                           */
} USBAHB_FIFO_2_Data_TypeDef;

/** USBAHB_AHBS FIFO_3_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO3D;                             /**< New Register                                       */
} USBAHB_FIFO_3_Data_TypeDef;

/** USBAHB_AHBS FIFO_4_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO4D;                             /**< New Register                                       */
} USBAHB_FIFO_4_Data_TypeDef;

/** USBAHB_AHBS FIFO_5_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO5D;                             /**< New Register                                       */
} USBAHB_FIFO_5_Data_TypeDef;

/** USBAHB_AHBS FIFO_6_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO6D;                             /**< New Register                                       */
} USBAHB_FIFO_6_Data_TypeDef;

/** USBAHB_AHBS FIFO_7_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO7D;                             /**< New Register                                       */
} USBAHB_FIFO_7_Data_TypeDef;

/** USBAHB_AHBS FIFO_8_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO8D;                             /**< New Register                                       */
} USBAHB_FIFO_8_Data_TypeDef;

/** USBAHB_AHBS FIFO_9_Data Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFO9D;                             /**< New Register                                       */
} USBAHB_FIFO_9_Data_TypeDef;

/** USBAHB_AHBS FIFORAM Register Group Declaration. */
typedef struct {
  __IOM uint32_t FIFORAM;                            /**< New Register                                       */
} USBAHB_FIFORAM_TypeDef;

/** USBAHB_AHBS Register Declaration. */
typedef struct {
  __IOM uint32_t             GOTGCTL;            /**< OTG_Ctrl_and_status_reg                            */
  uint32_t                   RESERVED0[1U];      /**< Reserved for future use                            */
  __IOM uint32_t             GAHBCFG;            /**< AHB Config Register                                */
  __IOM uint32_t             GUSBCFG;            /**< USB Configuration Reg                              */
  __IOM uint32_t             GRSTCTL;            /**< Reset Register                                     */
  __IOM uint32_t             GINTSTS;            /**< Interrupt Register                                 */
  __IOM uint32_t             GINTMSK;            /**< Interrupt Mask Register                            */
  __IM uint32_t              GRXSTSR;            /**< Receive Status Debug Read Reg                      */
  __IM uint32_t              GRXSTSP;            /**< Receive Status Read /Pop Reg                       */
  __IOM uint32_t             GRXFSIZ;            /**< Receive FIFO Size Register                         */
  __IOM uint32_t             GNPTXFSIZ;          /**< Non-per Transmit FIFO Size Reg                     */
  uint32_t                   RESERVED1[5U];      /**< Reserved for future use                            */
  __IM uint32_t              GSNPSID;            /**< Synopsys ID Register                               */
  __IM uint32_t              GHWCFG1;            /**< User HW Config1 Register                           */
  __IM uint32_t              GHWCFG2;            /**< User HW Config2 Register                           */
  __IM uint32_t              GHWCFG3;            /**< User HW Config3 Register                           */
  __IM uint32_t              GHWCFG4;            /**< User HW Config4 Register                           */
  uint32_t                   RESERVED2[2U];      /**< Reserved for future use                            */
  __IOM uint32_t             GDFIFOCFG;          /**< Global DFIFO Configuration Reg                     */
  uint32_t                   RESERVED3[41U];     /**< Reserved for future use                            */
  __IOM uint32_t             DIEPTXF1;           /**< Device IN EP xmit FIFO Siz Reg 1                   */
  __IOM uint32_t             DIEPTXF2;           /**< Device IN EP xmit FIFO Size Register 2             */
  __IOM uint32_t             DIEPTXF3;           /**< Device IN EP xmit FIFO Size Register 2             */
  __IOM uint32_t             DIEPTXF4;           /**< Device IN EP xmit FIFO Size Register 2             */
  __IOM uint32_t             DIEPTXF5;           /**< Device IN EP xmit FIFO Size Register 2             */
  __IOM uint32_t             DIEPTXF6;           /**< Device IN EP xmit FIFO Size Register 2             */
  __IOM uint32_t             DIEPTXF7;           /**< Device IN EP xmit FIFO Size Register 2             */
  __IOM uint32_t             DIEPTXF8;           /**< Device IN EP xmit FIFO Size Register 2             */
  __IOM uint32_t             DIEPTXF9;           /**< Device IN EP xmit FIFO Size Register 2             */
  uint32_t                   RESERVED4[438U];    /**< Reserved for future use                            */
  __IOM uint32_t             DCFG;               /**< Device Configuration Register                      */
  __IOM uint32_t             DCTL;               /**< Device Control Register                            */
  __IM uint32_t              DSTS;               /**< Device Status Register                             */
  uint32_t                   RESERVED5[1U];      /**< Reserved for future use                            */
  __IOM uint32_t             DIEPMSK;            /**< Device IN EP Common IRQ Mask Register              */
  __IOM uint32_t             DOEPMSK;            /**< New Register                                       */
  __IM uint32_t              DAINT;              /**< Device All EP Interrupt Register                   */
  __IOM uint32_t             DAINTMSK;           /**< Device All EP Interrupt Mask Register              */
  uint32_t                   RESERVED6[4U];      /**< Reserved for future use                            */
  __IOM uint32_t             DTHRCTL;            /**< Device Threshold Control Register                  */
  __IOM uint32_t             DIEPEMPMSK;         /**< Device IN EP FIFO Empty IRQ Mask reg               */
  uint32_t                   RESERVED7[50U];     /**< Reserved for future use                            */
  __IOM uint32_t             DIEP0CTL;           /**< Device Control IN EP 0 ctrl reg                    */
  uint32_t                   RESERVED8[1U];      /**< Reserved for future use                            */
  __IOM uint32_t             DIEP0INT;           /**< Device IN EP 0 IRQ reg                             */
  uint32_t                   RESERVED9[1U];      /**< Reserved for future use                            */
  __IOM uint32_t             DIEP0TSIZ;          /**< Device In EP 0 xfer size reg                       */
  __IOM uint32_t             DIEP0DMAADDR;       /**< Device IN EP 0 DMA addr reg                        */
  __IM uint32_t              DIEP0TXFSTS;        /**< DEvice In EP TX FIFO Status reg 0                  */
  uint32_t                   RESERVED10[1U];     /**< Reserved for future use                            */
  USBAHB_DEVINEP_TypeDef     DEVINEP[9U];        /**<                                                    */
  uint32_t                   RESERVED11[48U];    /**< Reserved for future use                            */
  __IOM uint32_t             DOEP0CTL;           /**< Device ctrl OUT EP 0 CTRL reg                      */
  uint32_t                   RESERVED12[1U];     /**< Reserved for future use                            */
  __IOM uint32_t             DOEP0INT;           /**< Device OUT EP 0 IRQ Register                       */
  uint32_t                   RESERVED13[1U];     /**< Reserved for future use                            */
  __IOM uint32_t             DOEP0TSIZ;          /**< Device OUT EP 0 xfer Size reg                      */
  __IOM uint32_t             DOEP0DMAADDR;       /**< Device OUT EP 0 DMA addr reg                       */
  uint32_t                   RESERVED14[2U];     /**< Reserved for future use                            */
  USBAHB_DEVOUTEP_TypeDef    DEVOUTEP[9U];       /**<                                                    */
  uint32_t                   RESERVED15[112U];   /**< Reserved for future use                            */
  __IOM uint32_t             PCGCCTL;            /**< PWR_CG_CTRL_reg                                    */
  uint32_t                   RESERVED16[127U];   /**< Reserved for future use                            */
  USBAHB_FIFO_0_Data_TypeDef FIFO_0_Data[1024U]; /**<                                                    */
  USBAHB_FIFO_1_Data_TypeDef FIFO_1_Data[1024U]; /**<                                                    */
  USBAHB_FIFO_2_Data_TypeDef FIFO_2_Data[1024U]; /**<                                                    */
  USBAHB_FIFO_3_Data_TypeDef FIFO_3_Data[1024U]; /**<                                                    */
  USBAHB_FIFO_4_Data_TypeDef FIFO_4_Data[1024U]; /**<                                                    */
  USBAHB_FIFO_5_Data_TypeDef FIFO_5_Data[1024U]; /**<                                                    */
  USBAHB_FIFO_6_Data_TypeDef FIFO_6_Data[1024U]; /**<                                                    */
  USBAHB_FIFO_7_Data_TypeDef FIFO_7_Data[1024U]; /**<                                                    */
  USBAHB_FIFO_8_Data_TypeDef FIFO_8_Data[1024U]; /**<                                                    */
  USBAHB_FIFO_9_Data_TypeDef FIFO_9_Data[1024U]; /**<                                                    */
  uint32_t                   RESERVED17[21504U]; /**< Reserved for future use                            */
  USBAHB_FIFORAM_TypeDef     FIFORAM[768U];      /**<                                                    */
} USBAHB_AHBS_TypeDef;
