espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/** @} End of group EFR32FG25_USBAHB_AHBS */

/**************************************************************************//**
 * @addtogroup EFR32FG25_USBAHB_AHBS
 * @{
 * @defgroup EFR32FG25_USBAHB_AHBS_BitFields USBAHB_AHBS Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for USBAHB GOTGCTL */
#define _USBAHB_GOTGCTL_RESETVALUE                         0x00010000UL                           /**< Default value for USBAHB_GOTGCTL            */
#define _USBAHB_GOTGCTL_MASK                               0x003900C0UL                           /**< Mask for USBAHB_GOTGCTL                     */
#define USBAHB_GOTGCTL_CURMOD                              (0x1UL << 21)                          /**< Current Mode of Operation                   */
#define _USBAHB_GOTGCTL_CURMOD_SHIFT                       21                                     /**< Shift value for USBAHB_CURMOD               */
#define _USBAHB_GOTGCTL_CURMOD_MASK                        0x200000UL                             /**< Bit mask for USBAHB_CURMOD                  */
#define _USBAHB_GOTGCTL_CURMOD_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for USBAHB_GOTGCTL             */
#define USBAHB_GOTGCTL_CURMOD_DEFAULT                      (_USBAHB_GOTGCTL_CURMOD_DEFAULT << 21) /**< Shifted mode DEFAULT for USBAHB_GOTGCTL     */

/* Bit fields for USBAHB GAHBCFG */
#define _USBAHB_GAHBCFG_RESETVALUE                         0x00000000UL                                   /**< Default value for USBAHB_GAHBCFG            */
#define _USBAHB_GAHBCFG_MASK                               0x01E000BFUL                                   /**< Mask for USBAHB_GAHBCFG                     */
#define USBAHB_GAHBCFG_GLBLINTRMSK                         (0x1UL << 0)                                   /**< Global Interrupt Mask                       */
#define _USBAHB_GAHBCFG_GLBLINTRMSK_SHIFT                  0                                              /**< Shift value for USBAHB_GLBLINTRMSK          */
#define _USBAHB_GAHBCFG_GLBLINTRMSK_MASK                   0x1UL                                          /**< Bit mask for USBAHB_GLBLINTRMSK             */
#define _USBAHB_GAHBCFG_GLBLINTRMSK_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GAHBCFG             */
#define USBAHB_GAHBCFG_GLBLINTRMSK_DEFAULT                 (_USBAHB_GAHBCFG_GLBLINTRMSK_DEFAULT << 0)     /**< Shifted mode DEFAULT for USBAHB_GAHBCFG     */
#define _USBAHB_GAHBCFG_HBSTLEN_SHIFT                      1                                              /**< Shift value for USBAHB_HBSTLEN              */
#define _USBAHB_GAHBCFG_HBSTLEN_MASK                       0x1EUL                                         /**< Bit mask for USBAHB_HBSTLEN                 */
#define _USBAHB_GAHBCFG_HBSTLEN_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GAHBCFG             */
#define USBAHB_GAHBCFG_HBSTLEN_DEFAULT                     (_USBAHB_GAHBCFG_HBSTLEN_DEFAULT << 1)         /**< Shifted mode DEFAULT for USBAHB_GAHBCFG     */
#define USBAHB_GAHBCFG_DMAEN                               (0x1UL << 5)                                   /**< DMA Enable                                  */
#define _USBAHB_GAHBCFG_DMAEN_SHIFT                        5                                              /**< Shift value for USBAHB_DMAEN                */
#define _USBAHB_GAHBCFG_DMAEN_MASK                         0x20UL                                         /**< Bit mask for USBAHB_DMAEN                   */
#define _USBAHB_GAHBCFG_DMAEN_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GAHBCFG             */
#define USBAHB_GAHBCFG_DMAEN_DEFAULT                       (_USBAHB_GAHBCFG_DMAEN_DEFAULT << 5)           /**< Shifted mode DEFAULT for USBAHB_GAHBCFG     */
#define USBAHB_GAHBCFG_NPTXFEMPLVL                         (0x1UL << 7)                                   /**< Non-Periodic TxFIFO Empty Level             */
#define _USBAHB_GAHBCFG_NPTXFEMPLVL_SHIFT                  7                                              /**< Shift value for USBAHB_NPTXFEMPLVL          */
#define _USBAHB_GAHBCFG_NPTXFEMPLVL_MASK                   0x80UL                                         /**< Bit mask for USBAHB_NPTXFEMPLVL             */
#define _USBAHB_GAHBCFG_NPTXFEMPLVL_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GAHBCFG             */
#define USBAHB_GAHBCFG_NPTXFEMPLVL_DEFAULT                 (_USBAHB_GAHBCFG_NPTXFEMPLVL_DEFAULT << 7)     /**< Shifted mode DEFAULT for USBAHB_GAHBCFG     */
#define USBAHB_GAHBCFG_REMMEMSUPP                          (0x1UL << 21)                                  /**< Remote Memory Support                       */
#define _USBAHB_GAHBCFG_REMMEMSUPP_SHIFT                   21                                             /**< Shift value for USBAHB_REMMEMSUPP           */
#define _USBAHB_GAHBCFG_REMMEMSUPP_MASK                    0x200000UL                                     /**< Bit mask for USBAHB_REMMEMSUPP              */
#define _USBAHB_GAHBCFG_REMMEMSUPP_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GAHBCFG             */
#define USBAHB_GAHBCFG_REMMEMSUPP_DEFAULT                  (_USBAHB_GAHBCFG_REMMEMSUPP_DEFAULT << 21)     /**< Shifted mode DEFAULT for USBAHB_GAHBCFG     */
#define USBAHB_GAHBCFG_NOTIALLDMAWRIT                      (0x1UL << 22)                                  /**< Notify All Dma Write Trans                  */
#define _USBAHB_GAHBCFG_NOTIALLDMAWRIT_SHIFT               22                                             /**< Shift value for USBAHB_NOTIALLDMAWRIT       */
#define _USBAHB_GAHBCFG_NOTIALLDMAWRIT_MASK                0x400000UL                                     /**< Bit mask for USBAHB_NOTIALLDMAWRIT          */
#define _USBAHB_GAHBCFG_NOTIALLDMAWRIT_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GAHBCFG             */
#define USBAHB_GAHBCFG_NOTIALLDMAWRIT_DEFAULT              (_USBAHB_GAHBCFG_NOTIALLDMAWRIT_DEFAULT << 22) /**< Shifted mode DEFAULT for USBAHB_GAHBCFG     */
#define USBAHB_GAHBCFG_AHBSINGLE                           (0x1UL << 23)                                  /**< AHB Single Support                          */
#define _USBAHB_GAHBCFG_AHBSINGLE_SHIFT                    23                                             /**< Shift value for USBAHB_AHBSINGLE            */
#define _USBAHB_GAHBCFG_AHBSINGLE_MASK                     0x800000UL                                     /**< Bit mask for USBAHB_AHBSINGLE               */
#define _USBAHB_GAHBCFG_AHBSINGLE_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GAHBCFG             */
#define USBAHB_GAHBCFG_AHBSINGLE_DEFAULT                   (_USBAHB_GAHBCFG_AHBSINGLE_DEFAULT << 23)      /**< Shifted mode DEFAULT for USBAHB_GAHBCFG     */
#define USBAHB_GAHBCFG_INVDESCEND                          (0x1UL << 24)                                  /**< Inverse Descriptor Endianness               */
#define _USBAHB_GAHBCFG_INVDESCEND_SHIFT                   24                                             /**< Shift value for USBAHB_INVDESCEND           */
#define _USBAHB_GAHBCFG_INVDESCEND_MASK                    0x1000000UL                                    /**< Bit mask for USBAHB_INVDESCEND              */
#define _USBAHB_GAHBCFG_INVDESCEND_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GAHBCFG             */
#define USBAHB_GAHBCFG_INVDESCEND_DEFAULT                  (_USBAHB_GAHBCFG_INVDESCEND_DEFAULT << 24)     /**< Shifted mode DEFAULT for USBAHB_GAHBCFG     */

/* Bit fields for USBAHB GUSBCFG */
#define _USBAHB_GUSBCFG_RESETVALUE                         0x00001440UL                                   /**< Default value for USBAHB_GUSBCFG            */
#define _USBAHB_GUSBCFG_MASK                               0x94403C6FUL                                   /**< Mask for USBAHB_GUSBCFG                     */
#define _USBAHB_GUSBCFG_TOUTCAL_SHIFT                      0                                              /**< Shift value for USBAHB_TOUTCAL              */
#define _USBAHB_GUSBCFG_TOUTCAL_MASK                       0x7UL                                          /**< Bit mask for USBAHB_TOUTCAL                 */
#define _USBAHB_GUSBCFG_TOUTCAL_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GUSBCFG             */
#define USBAHB_GUSBCFG_TOUTCAL_DEFAULT                     (_USBAHB_GUSBCFG_TOUTCAL_DEFAULT << 0)         /**< Shifted mode DEFAULT for USBAHB_GUSBCFG     */
#define USBAHB_GUSBCFG_PHYIF                               (0x1UL << 3)                                   /**< PHY Interface                               */
#define _USBAHB_GUSBCFG_PHYIF_SHIFT                        3                                              /**< Shift value for USBAHB_PHYIF                */
#define _USBAHB_GUSBCFG_PHYIF_MASK                         0x8UL                                          /**< Bit mask for USBAHB_PHYIF                   */
#define _USBAHB_GUSBCFG_PHYIF_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GUSBCFG             */
#define USBAHB_GUSBCFG_PHYIF_DEFAULT                       (_USBAHB_GUSBCFG_PHYIF_DEFAULT << 3)           /**< Shifted mode DEFAULT for USBAHB_GUSBCFG     */
#define USBAHB_GUSBCFG_FSINTF                              (0x1UL << 5)                                   /**< Full-Speed Serial Interface Sel             */
#define _USBAHB_GUSBCFG_FSINTF_SHIFT                       5                                              /**< Shift value for USBAHB_FSINTF               */
#define _USBAHB_GUSBCFG_FSINTF_MASK                        0x20UL                                         /**< Bit mask for USBAHB_FSINTF                  */
#define _USBAHB_GUSBCFG_FSINTF_DEFAULT                     0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GUSBCFG             */
#define USBAHB_GUSBCFG_FSINTF_DEFAULT                      (_USBAHB_GUSBCFG_FSINTF_DEFAULT << 5)          /**< Shifted mode DEFAULT for USBAHB_GUSBCFG     */
#define USBAHB_GUSBCFG_PHYSEL                              (0x1UL << 6)                                   /**< "2.0 HS sel or 1.1 FS sel                   */
#define _USBAHB_GUSBCFG_PHYSEL_SHIFT                       6                                              /**< Shift value for USBAHB_PHYSEL               */
#define _USBAHB_GUSBCFG_PHYSEL_MASK                        0x40UL                                         /**< Bit mask for USBAHB_PHYSEL                  */
#define _USBAHB_GUSBCFG_PHYSEL_DEFAULT                     0x00000001UL                                   /**< Mode DEFAULT for USBAHB_GUSBCFG             */
#define USBAHB_GUSBCFG_PHYSEL_DEFAULT                      (_USBAHB_GUSBCFG_PHYSEL_DEFAULT << 6)          /**< Shifted mode DEFAULT for USBAHB_GUSBCFG     */
#define _USBAHB_GUSBCFG_USBTRDTIM_SHIFT                    10                                             /**< Shift value for USBAHB_USBTRDTIM            */
#define _USBAHB_GUSBCFG_USBTRDTIM_MASK                     0x3C00UL                                       /**< Bit mask for USBAHB_USBTRDTIM               */
#define _USBAHB_GUSBCFG_USBTRDTIM_DEFAULT                  0x00000005UL                                   /**< Mode DEFAULT for USBAHB_GUSBCFG             */
#define USBAHB_GUSBCFG_USBTRDTIM_DEFAULT                   (_USBAHB_GUSBCFG_USBTRDTIM_DEFAULT << 10)      /**< Shifted mode DEFAULT for USBAHB_GUSBCFG     */
#define USBAHB_GUSBCFG_TERMSELDLPULSE                      (0x1UL << 22)                                  /**< TermSel DLine Pulsing Selection             */
#define _USBAHB_GUSBCFG_TERMSELDLPULSE_SHIFT               22                                             /**< Shift value for USBAHB_TERMSELDLPULSE       */
#define _USBAHB_GUSBCFG_TERMSELDLPULSE_MASK                0x400000UL                                     /**< Bit mask for USBAHB_TERMSELDLPULSE          */
#define _USBAHB_GUSBCFG_TERMSELDLPULSE_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GUSBCFG             */
#define USBAHB_GUSBCFG_TERMSELDLPULSE_DEFAULT              (_USBAHB_GUSBCFG_TERMSELDLPULSE_DEFAULT << 22) /**< Shifted mode DEFAULT for USBAHB_GUSBCFG     */
#define USBAHB_GUSBCFG_ICUSBCAP                            (0x1UL << 26)                                  /**< IC_USB-Capable                              */
#define _USBAHB_GUSBCFG_ICUSBCAP_SHIFT                     26                                             /**< Shift value for USBAHB_ICUSBCAP             */
#define _USBAHB_GUSBCFG_ICUSBCAP_MASK                      0x4000000UL                                    /**< Bit mask for USBAHB_ICUSBCAP                */
#define _USBAHB_GUSBCFG_ICUSBCAP_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GUSBCFG             */
#define USBAHB_GUSBCFG_ICUSBCAP_DEFAULT                    (_USBAHB_GUSBCFG_ICUSBCAP_DEFAULT << 26)       /**< Shifted mode DEFAULT for USBAHB_GUSBCFG     */
#define USBAHB_GUSBCFG_TXENDDELAY                          (0x1UL << 28)                                  /**< Tx End Delay                                */
#define _USBAHB_GUSBCFG_TXENDDELAY_SHIFT                   28                                             /**< Shift value for USBAHB_TXENDDELAY           */
#define _USBAHB_GUSBCFG_TXENDDELAY_MASK                    0x10000000UL                                   /**< Bit mask for USBAHB_TXENDDELAY              */
#define _USBAHB_GUSBCFG_TXENDDELAY_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GUSBCFG             */
#define USBAHB_GUSBCFG_TXENDDELAY_DEFAULT                  (_USBAHB_GUSBCFG_TXENDDELAY_DEFAULT << 28)     /**< Shifted mode DEFAULT for USBAHB_GUSBCFG     */
#define USBAHB_GUSBCFG_CORRUPTTXPKT                        (0x1UL << 31)                                  /**< corrupt tx packet                           */
#define _USBAHB_GUSBCFG_CORRUPTTXPKT_SHIFT                 31                                             /**< Shift value for USBAHB_CORRUPTTXPKT         */
#define _USBAHB_GUSBCFG_CORRUPTTXPKT_MASK                  0x80000000UL                                   /**< Bit mask for USBAHB_CORRUPTTXPKT            */
#define _USBAHB_GUSBCFG_CORRUPTTXPKT_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for USBAHB_GUSBCFG             */
#define USBAHB_GUSBCFG_CORRUPTTXPKT_DEFAULT                (_USBAHB_GUSBCFG_CORRUPTTXPKT_DEFAULT << 31)   /**< Shifted mode DEFAULT for USBAHB_GUSBCFG     */

/* Bit fields for USBAHB GRSTCTL */
#define _USBAHB_GRSTCTL_RESETVALUE                         0x00000000UL                               /**< Default value for USBAHB_GRSTCTL            */
#define _USBAHB_GRSTCTL_MASK                               0xC00007F3UL                               /**< Mask for USBAHB_GRSTCTL                     */
#define USBAHB_GRSTCTL_CSFTRST                             (0x1UL << 0)                               /**< Core Soft Reset                             */
#define _USBAHB_GRSTCTL_CSFTRST_SHIFT                      0                                          /**< Shift value for USBAHB_CSFTRST              */
#define _USBAHB_GRSTCTL_CSFTRST_MASK                       0x1UL                                      /**< Bit mask for USBAHB_CSFTRST                 */
#define _USBAHB_GRSTCTL_CSFTRST_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for USBAHB_GRSTCTL             */
#define USBAHB_GRSTCTL_CSFTRST_DEFAULT                     (_USBAHB_GRSTCTL_CSFTRST_DEFAULT << 0)     /**< Shifted mode DEFAULT for USBAHB_GRSTCTL     */
#define USBAHB_GRSTCTL_PIUFSSFTRST                         (0x1UL << 1)                               /**< PIU FS Dedicated Controller Sft rst         */
#define _USBAHB_GRSTCTL_PIUFSSFTRST_SHIFT                  1                                          /**< Shift value for USBAHB_PIUFSSFTRST          */
#define _USBAHB_GRSTCTL_PIUFSSFTRST_MASK                   0x2UL                                      /**< Bit mask for USBAHB_PIUFSSFTRST             */
#define _USBAHB_GRSTCTL_PIUFSSFTRST_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for USBAHB_GRSTCTL             */
#define USBAHB_GRSTCTL_PIUFSSFTRST_DEFAULT                 (_USBAHB_GRSTCTL_PIUFSSFTRST_DEFAULT << 1) /**< Shifted mode DEFAULT for USBAHB_GRSTCTL     */
#define USBAHB_GRSTCTL_RXFFLSH                             (0x1UL << 4)                               /**< RxFIFO Flush                                */
#define _USBAHB_GRSTCTL_RXFFLSH_SHIFT                      4                                          /**< Shift value for USBAHB_RXFFLSH              */
#define _USBAHB_GRSTCTL_RXFFLSH_MASK                       0x10UL                                     /**< Bit mask for USBAHB_RXFFLSH                 */
#define _USBAHB_GRSTCTL_RXFFLSH_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for USBAHB_GRSTCTL             */
#define USBAHB_GRSTCTL_RXFFLSH_DEFAULT                     (_USBAHB_GRSTCTL_RXFFLSH_DEFAULT << 4)     /**< Shifted mode DEFAULT for USBAHB_GRSTCTL     */
#define USBAHB_GRSTCTL_TXFFLSH                             (0x1UL << 5)                               /**< TxFIFO Flush                                */
#define _USBAHB_GRSTCTL_TXFFLSH_SHIFT                      5                                          /**< Shift value for USBAHB_TXFFLSH              */
#define _USBAHB_GRSTCTL_TXFFLSH_MASK                       0x20UL                                     /**< Bit mask for USBAHB_TXFFLSH                 */
#define _USBAHB_GRSTCTL_TXFFLSH_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for USBAHB_GRSTCTL             */
#define USBAHB_GRSTCTL_TXFFLSH_DEFAULT                     (_USBAHB_GRSTCTL_TXFFLSH_DEFAULT << 5)     /**< Shifted mode DEFAULT for USBAHB_GRSTCTL     */
#define _USBAHB_GRSTCTL_TXFNUM_SHIFT                       6                                          /**< Shift value for USBAHB_TXFNUM               */
#define _USBAHB_GRSTCTL_TXFNUM_MASK                        0x7C0UL                                    /**< Bit mask for USBAHB_TXFNUM                  */
#define _USBAHB_GRSTCTL_TXFNUM_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for USBAHB_GRSTCTL             */
#define USBAHB_GRSTCTL_TXFNUM_DEFAULT                      (_USBAHB_GRSTCTL_TXFNUM_DEFAULT << 6)      /**< Shifted mode DEFAULT for USBAHB_GRSTCTL     */
#define USBAHB_GRSTCTL_DMAREQ                              (0x1UL << 30)                              /**< DMA Request Signal                          */
#define _USBAHB_GRSTCTL_DMAREQ_SHIFT                       30                                         /**< Shift value for USBAHB_DMAREQ               */
#define _USBAHB_GRSTCTL_DMAREQ_MASK                        0x40000000UL                               /**< Bit mask for USBAHB_DMAREQ                  */
#define _USBAHB_GRSTCTL_DMAREQ_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for USBAHB_GRSTCTL             */
#define USBAHB_GRSTCTL_DMAREQ_DEFAULT                      (_USBAHB_GRSTCTL_DMAREQ_DEFAULT << 30)     /**< Shifted mode DEFAULT for USBAHB_GRSTCTL     */
#define USBAHB_GRSTCTL_AHBIDLE                             (0x1UL << 31)                              /**< AHB Master Idle                             */
#define _USBAHB_GRSTCTL_AHBIDLE_SHIFT                      31                                         /**< Shift value for USBAHB_AHBIDLE              */
#define _USBAHB_GRSTCTL_AHBIDLE_MASK                       0x80000000UL                               /**< Bit mask for USBAHB_AHBIDLE                 */
#define _USBAHB_GRSTCTL_AHBIDLE_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for USBAHB_GRSTCTL             */
#define USBAHB_GRSTCTL_AHBIDLE_DEFAULT                     (_USBAHB_GRSTCTL_AHBIDLE_DEFAULT << 31)    /**< Shifted mode DEFAULT for USBAHB_GRSTCTL     */

