espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB GINTSTS */
#define _USBAHB_GINTSTS_RESETVALUE                         0x10000020UL                                 /**< Default value for USBAHB_GINTSTS            */
#define _USBAHB_GINTSTS_MASK                               0x90FEFCFBUL                                 /**< Mask for USBAHB_GINTSTS                     */
#define USBAHB_GINTSTS_CURMOD                              (0x1UL << 0)                                 /**< Current Mode of Operation                   */
#define _USBAHB_GINTSTS_CURMOD_SHIFT                       0                                            /**< Shift value for USBAHB_CURMOD               */
#define _USBAHB_GINTSTS_CURMOD_MASK                        0x1UL                                        /**< Bit mask for USBAHB_CURMOD                  */
#define _USBAHB_GINTSTS_CURMOD_DEFAULT                     0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_CURMOD_DEFAULT                      (_USBAHB_GINTSTS_CURMOD_DEFAULT << 0)        /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_MODEMIS                             (0x1UL << 1)                                 /**< Mode Mismatch Interrupt                     */
#define _USBAHB_GINTSTS_MODEMIS_SHIFT                      1                                            /**< Shift value for USBAHB_MODEMIS              */
#define _USBAHB_GINTSTS_MODEMIS_MASK                       0x2UL                                        /**< Bit mask for USBAHB_MODEMIS                 */
#define _USBAHB_GINTSTS_MODEMIS_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_MODEMIS_DEFAULT                     (_USBAHB_GINTSTS_MODEMIS_DEFAULT << 1)       /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_SOF                                 (0x1UL << 3)                                 /**< tart of (micro)Frame                        */
#define _USBAHB_GINTSTS_SOF_SHIFT                          3                                            /**< Shift value for USBAHB_SOF                  */
#define _USBAHB_GINTSTS_SOF_MASK                           0x8UL                                        /**< Bit mask for USBAHB_SOF                     */
#define _USBAHB_GINTSTS_SOF_DEFAULT                        0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_SOF_DEFAULT                         (_USBAHB_GINTSTS_SOF_DEFAULT << 3)           /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_RXFLVL                              (0x1UL << 4)                                 /**< RxFIFO Non-Empty                            */
#define _USBAHB_GINTSTS_RXFLVL_SHIFT                       4                                            /**< Shift value for USBAHB_RXFLVL               */
#define _USBAHB_GINTSTS_RXFLVL_MASK                        0x10UL                                       /**< Bit mask for USBAHB_RXFLVL                  */
#define _USBAHB_GINTSTS_RXFLVL_DEFAULT                     0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_RXFLVL_DEFAULT                      (_USBAHB_GINTSTS_RXFLVL_DEFAULT << 4)        /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_NPTxFEmp                            (0x1UL << 5)                                 /**< Non periodic TXFIFO Empty                   */
#define _USBAHB_GINTSTS_NPTxFEmp_SHIFT                     5                                            /**< Shift value for USBAHB_NPTxFEmp             */
#define _USBAHB_GINTSTS_NPTxFEmp_MASK                      0x20UL                                       /**< Bit mask for USBAHB_NPTxFEmp                */
#define _USBAHB_GINTSTS_NPTxFEmp_DEFAULT                   0x00000001UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_NPTxFEmp_DEFAULT                    (_USBAHB_GINTSTS_NPTxFEmp_DEFAULT << 5)      /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_GINNAKEFF                           (0x1UL << 6)                                 /**< Global IN Non-periodic NAK Effective        */
#define _USBAHB_GINTSTS_GINNAKEFF_SHIFT                    6                                            /**< Shift value for USBAHB_GINNAKEFF            */
#define _USBAHB_GINTSTS_GINNAKEFF_MASK                     0x40UL                                       /**< Bit mask for USBAHB_GINNAKEFF               */
#define _USBAHB_GINTSTS_GINNAKEFF_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_GINNAKEFF_DEFAULT                   (_USBAHB_GINTSTS_GINNAKEFF_DEFAULT << 6)     /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_GOUTNAKEFF                          (0x1UL << 7)                                 /**< Global OUT NAK Effective                    */
#define _USBAHB_GINTSTS_GOUTNAKEFF_SHIFT                   7                                            /**< Shift value for USBAHB_GOUTNAKEFF           */
#define _USBAHB_GINTSTS_GOUTNAKEFF_MASK                    0x80UL                                       /**< Bit mask for USBAHB_GOUTNAKEFF              */
#define _USBAHB_GINTSTS_GOUTNAKEFF_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_GOUTNAKEFF_DEFAULT                  (_USBAHB_GINTSTS_GOUTNAKEFF_DEFAULT << 7)    /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_ERLYSUSP                            (0x1UL << 10)                                /**< Early Suspend                               */
#define _USBAHB_GINTSTS_ERLYSUSP_SHIFT                     10                                           /**< Shift value for USBAHB_ERLYSUSP             */
#define _USBAHB_GINTSTS_ERLYSUSP_MASK                      0x400UL                                      /**< Bit mask for USBAHB_ERLYSUSP                */
#define _USBAHB_GINTSTS_ERLYSUSP_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_ERLYSUSP_DEFAULT                    (_USBAHB_GINTSTS_ERLYSUSP_DEFAULT << 10)     /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_USBSUSP                             (0x1UL << 11)                                /**< USB Suspend                                 */
#define _USBAHB_GINTSTS_USBSUSP_SHIFT                      11                                           /**< Shift value for USBAHB_USBSUSP              */
#define _USBAHB_GINTSTS_USBSUSP_MASK                       0x800UL                                      /**< Bit mask for USBAHB_USBSUSP                 */
#define _USBAHB_GINTSTS_USBSUSP_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_USBSUSP_DEFAULT                     (_USBAHB_GINTSTS_USBSUSP_DEFAULT << 11)      /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_USBRST                              (0x1UL << 12)                                /**< USB Reset                                   */
#define _USBAHB_GINTSTS_USBRST_SHIFT                       12                                           /**< Shift value for USBAHB_USBRST               */
#define _USBAHB_GINTSTS_USBRST_MASK                        0x1000UL                                     /**< Bit mask for USBAHB_USBRST                  */
#define _USBAHB_GINTSTS_USBRST_DEFAULT                     0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_USBRST_DEFAULT                      (_USBAHB_GINTSTS_USBRST_DEFAULT << 12)       /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_ENUMDONE                            (0x1UL << 13)                                /**< Enumeration Done                            */
#define _USBAHB_GINTSTS_ENUMDONE_SHIFT                     13                                           /**< Shift value for USBAHB_ENUMDONE             */
#define _USBAHB_GINTSTS_ENUMDONE_MASK                      0x2000UL                                     /**< Bit mask for USBAHB_ENUMDONE                */
#define _USBAHB_GINTSTS_ENUMDONE_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_ENUMDONE_DEFAULT                    (_USBAHB_GINTSTS_ENUMDONE_DEFAULT << 13)     /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_ISOOUTDROP                          (0x1UL << 14)                                /**< Iso OUT Packet Dropped IRQ                  */
#define _USBAHB_GINTSTS_ISOOUTDROP_SHIFT                   14                                           /**< Shift value for USBAHB_ISOOUTDROP           */
#define _USBAHB_GINTSTS_ISOOUTDROP_MASK                    0x4000UL                                     /**< Bit mask for USBAHB_ISOOUTDROP              */
#define _USBAHB_GINTSTS_ISOOUTDROP_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_ISOOUTDROP_DEFAULT                  (_USBAHB_GINTSTS_ISOOUTDROP_DEFAULT << 14)   /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_EOPF                                (0x1UL << 15)                                /**< End of Periodic Frame Interrupt             */
#define _USBAHB_GINTSTS_EOPF_SHIFT                         15                                           /**< Shift value for USBAHB_EOPF                 */
#define _USBAHB_GINTSTS_EOPF_MASK                          0x8000UL                                     /**< Bit mask for USBAHB_EOPF                    */
#define _USBAHB_GINTSTS_EOPF_DEFAULT                       0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_EOPF_DEFAULT                        (_USBAHB_GINTSTS_EOPF_DEFAULT << 15)         /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_EPMIS                               (0x1UL << 17)                                /**< Endpoint Mismatch Interrupt                 */
#define _USBAHB_GINTSTS_EPMIS_SHIFT                        17                                           /**< Shift value for USBAHB_EPMIS                */
#define _USBAHB_GINTSTS_EPMIS_MASK                         0x20000UL                                    /**< Bit mask for USBAHB_EPMIS                   */
#define _USBAHB_GINTSTS_EPMIS_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_EPMIS_DEFAULT                       (_USBAHB_GINTSTS_EPMIS_DEFAULT << 17)        /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_IEPINT                              (0x1UL << 18)                                /**< IN Endpoints Interrupt                      */
#define _USBAHB_GINTSTS_IEPINT_SHIFT                       18                                           /**< Shift value for USBAHB_IEPINT               */
#define _USBAHB_GINTSTS_IEPINT_MASK                        0x40000UL                                    /**< Bit mask for USBAHB_IEPINT                  */
#define _USBAHB_GINTSTS_IEPINT_DEFAULT                     0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_IEPINT_DEFAULT                      (_USBAHB_GINTSTS_IEPINT_DEFAULT << 18)       /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_OEPINT                              (0x1UL << 19)                                /**< OUT Endpoints Interrupt                     */
#define _USBAHB_GINTSTS_OEPINT_SHIFT                       19                                           /**< Shift value for USBAHB_OEPINT               */
#define _USBAHB_GINTSTS_OEPINT_MASK                        0x80000UL                                    /**< Bit mask for USBAHB_OEPINT                  */
#define _USBAHB_GINTSTS_OEPINT_DEFAULT                     0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_OEPINT_DEFAULT                      (_USBAHB_GINTSTS_OEPINT_DEFAULT << 19)       /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_INCOMPISOIN                         (0x1UL << 20)                                /**< Incomplete Isochronous IN Transfer          */
#define _USBAHB_GINTSTS_INCOMPISOIN_SHIFT                  20                                           /**< Shift value for USBAHB_INCOMPISOIN          */
#define _USBAHB_GINTSTS_INCOMPISOIN_MASK                   0x100000UL                                   /**< Bit mask for USBAHB_INCOMPISOIN             */
#define _USBAHB_GINTSTS_INCOMPISOIN_DEFAULT                0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_INCOMPISOIN_DEFAULT                 (_USBAHB_GINTSTS_INCOMPISOIN_DEFAULT << 20)  /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_INCOMPLP                            (0x1UL << 21)                                /**< Incomplete Periodic Transfer                */
#define _USBAHB_GINTSTS_INCOMPLP_SHIFT                     21                                           /**< Shift value for USBAHB_INCOMPLP             */
#define _USBAHB_GINTSTS_INCOMPLP_MASK                      0x200000UL                                   /**< Bit mask for USBAHB_INCOMPLP                */
#define _USBAHB_GINTSTS_INCOMPLP_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_INCOMPLP_DEFAULT                    (_USBAHB_GINTSTS_INCOMPLP_DEFAULT << 21)     /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_FETSUSP                             (0x1UL << 22)                                /**< Data Fetch Suspended                        */
#define _USBAHB_GINTSTS_FETSUSP_SHIFT                      22                                           /**< Shift value for USBAHB_FETSUSP              */
#define _USBAHB_GINTSTS_FETSUSP_MASK                       0x400000UL                                   /**< Bit mask for USBAHB_FETSUSP                 */
#define _USBAHB_GINTSTS_FETSUSP_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_FETSUSP_DEFAULT                     (_USBAHB_GINTSTS_FETSUSP_DEFAULT << 22)      /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_RESETDET                            (0x1UL << 23)                                /**< Reset detected Interrupt                    */
#define _USBAHB_GINTSTS_RESETDET_SHIFT                     23                                           /**< Shift value for USBAHB_RESETDET             */
#define _USBAHB_GINTSTS_RESETDET_MASK                      0x800000UL                                   /**< Bit mask for USBAHB_RESETDET                */
#define _USBAHB_GINTSTS_RESETDET_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_RESETDET_DEFAULT                    (_USBAHB_GINTSTS_RESETDET_DEFAULT << 23)     /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_CONIDSTSCHNG                        (0x1UL << 28)                                /**< Connector ID Status Change                  */
#define _USBAHB_GINTSTS_CONIDSTSCHNG_SHIFT                 28                                           /**< Shift value for USBAHB_CONIDSTSCHNG         */
#define _USBAHB_GINTSTS_CONIDSTSCHNG_MASK                  0x10000000UL                                 /**< Bit mask for USBAHB_CONIDSTSCHNG            */
#define _USBAHB_GINTSTS_CONIDSTSCHNG_DEFAULT               0x00000001UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_CONIDSTSCHNG_DEFAULT                (_USBAHB_GINTSTS_CONIDSTSCHNG_DEFAULT << 28) /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */
#define USBAHB_GINTSTS_WKUPINT                             (0x1UL << 31)                                /**< Resume/Remote Wakeup Detected Irq           */
#define _USBAHB_GINTSTS_WKUPINT_SHIFT                      31                                           /**< Shift value for USBAHB_WKUPINT              */
#define _USBAHB_GINTSTS_WKUPINT_MASK                       0x80000000UL                                 /**< Bit mask for USBAHB_WKUPINT                 */
#define _USBAHB_GINTSTS_WKUPINT_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GINTSTS             */
#define USBAHB_GINTSTS_WKUPINT_DEFAULT                     (_USBAHB_GINTSTS_WKUPINT_DEFAULT << 31)      /**< Shifted mode DEFAULT for USBAHB_GINTSTS     */

