espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB GINTMSK */
#define _USBAHB_GINTMSK_RESETVALUE                         0x00000000UL                                     /**< Default value for USBAHB_GINTMSK            */
#define _USBAHB_GINTMSK_MASK                               0x90FEFCFAUL                                     /**< Mask for USBAHB_GINTMSK                     */
#define USBAHB_GINTMSK_MODEMISMSK                          (0x1UL << 1)                                     /**< Mode Mismatch Interrupt Mask                */
#define _USBAHB_GINTMSK_MODEMISMSK_SHIFT                   1                                                /**< Shift value for USBAHB_MODEMISMSK           */
#define _USBAHB_GINTMSK_MODEMISMSK_MASK                    0x2UL                                            /**< Bit mask for USBAHB_MODEMISMSK              */
#define _USBAHB_GINTMSK_MODEMISMSK_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_MODEMISMSK_DEFAULT                  (_USBAHB_GINTMSK_MODEMISMSK_DEFAULT << 1)        /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_SOFMSK                              (0x1UL << 3)                                     /**< Start of (micro)Frame Mask                  */
#define _USBAHB_GINTMSK_SOFMSK_SHIFT                       3                                                /**< Shift value for USBAHB_SOFMSK               */
#define _USBAHB_GINTMSK_SOFMSK_MASK                        0x8UL                                            /**< Bit mask for USBAHB_SOFMSK                  */
#define _USBAHB_GINTMSK_SOFMSK_DEFAULT                     0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_SOFMSK_DEFAULT                      (_USBAHB_GINTMSK_SOFMSK_DEFAULT << 3)            /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_RXFLVLMSK                           (0x1UL << 4)                                     /**< Receive FIFO Non-Empty Mask                 */
#define _USBAHB_GINTMSK_RXFLVLMSK_SHIFT                    4                                                /**< Shift value for USBAHB_RXFLVLMSK            */
#define _USBAHB_GINTMSK_RXFLVLMSK_MASK                     0x10UL                                           /**< Bit mask for USBAHB_RXFLVLMSK               */
#define _USBAHB_GINTMSK_RXFLVLMSK_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_RXFLVLMSK_DEFAULT                   (_USBAHB_GINTMSK_RXFLVLMSK_DEFAULT << 4)         /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_NPTXFEMPMSK                         (0x1UL << 5)                                     /**< NP TXFIFO Empty Msk                         */
#define _USBAHB_GINTMSK_NPTXFEMPMSK_SHIFT                  5                                                /**< Shift value for USBAHB_NPTXFEMPMSK          */
#define _USBAHB_GINTMSK_NPTXFEMPMSK_MASK                   0x20UL                                           /**< Bit mask for USBAHB_NPTXFEMPMSK             */
#define _USBAHB_GINTMSK_NPTXFEMPMSK_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_NPTXFEMPMSK_DEFAULT                 (_USBAHB_GINTMSK_NPTXFEMPMSK_DEFAULT << 5)       /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_GINNAKEFFMSK                        (0x1UL << 6)                                     /**< Global Non-per IN NAK Eff Mask              */
#define _USBAHB_GINTMSK_GINNAKEFFMSK_SHIFT                 6                                                /**< Shift value for USBAHB_GINNAKEFFMSK         */
#define _USBAHB_GINTMSK_GINNAKEFFMSK_MASK                  0x40UL                                           /**< Bit mask for USBAHB_GINNAKEFFMSK            */
#define _USBAHB_GINTMSK_GINNAKEFFMSK_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_GINNAKEFFMSK_DEFAULT                (_USBAHB_GINTMSK_GINNAKEFFMSK_DEFAULT << 6)      /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_GOUTNAKEFFMSK                       (0x1UL << 7)                                     /**< Global OUT NAK Effective Mask               */
#define _USBAHB_GINTMSK_GOUTNAKEFFMSK_SHIFT                7                                                /**< Shift value for USBAHB_GOUTNAKEFFMSK        */
#define _USBAHB_GINTMSK_GOUTNAKEFFMSK_MASK                 0x80UL                                           /**< Bit mask for USBAHB_GOUTNAKEFFMSK           */
#define _USBAHB_GINTMSK_GOUTNAKEFFMSK_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_GOUTNAKEFFMSK_DEFAULT               (_USBAHB_GINTMSK_GOUTNAKEFFMSK_DEFAULT << 7)     /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_ERLYSUSPMSK                         (0x1UL << 10)                                    /**< Early Suspend Mask                          */
#define _USBAHB_GINTMSK_ERLYSUSPMSK_SHIFT                  10                                               /**< Shift value for USBAHB_ERLYSUSPMSK          */
#define _USBAHB_GINTMSK_ERLYSUSPMSK_MASK                   0x400UL                                          /**< Bit mask for USBAHB_ERLYSUSPMSK             */
#define _USBAHB_GINTMSK_ERLYSUSPMSK_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_ERLYSUSPMSK_DEFAULT                 (_USBAHB_GINTMSK_ERLYSUSPMSK_DEFAULT << 10)      /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_USBSUSPMSK                          (0x1UL << 11)                                    /**< USB Suspend Mask                            */
#define _USBAHB_GINTMSK_USBSUSPMSK_SHIFT                   11                                               /**< Shift value for USBAHB_USBSUSPMSK           */
#define _USBAHB_GINTMSK_USBSUSPMSK_MASK                    0x800UL                                          /**< Bit mask for USBAHB_USBSUSPMSK              */
#define _USBAHB_GINTMSK_USBSUSPMSK_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_USBSUSPMSK_DEFAULT                  (_USBAHB_GINTMSK_USBSUSPMSK_DEFAULT << 11)       /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_USBRSTMSK                           (0x1UL << 12)                                    /**< USB Reset Mask                              */
#define _USBAHB_GINTMSK_USBRSTMSK_SHIFT                    12                                               /**< Shift value for USBAHB_USBRSTMSK            */
#define _USBAHB_GINTMSK_USBRSTMSK_MASK                     0x1000UL                                         /**< Bit mask for USBAHB_USBRSTMSK               */
#define _USBAHB_GINTMSK_USBRSTMSK_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_USBRSTMSK_DEFAULT                   (_USBAHB_GINTMSK_USBRSTMSK_DEFAULT << 12)        /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_ENUMDONEMSK                         (0x1UL << 13)                                    /**< Enumeration Done Mask                       */
#define _USBAHB_GINTMSK_ENUMDONEMSK_SHIFT                  13                                               /**< Shift value for USBAHB_ENUMDONEMSK          */
#define _USBAHB_GINTMSK_ENUMDONEMSK_MASK                   0x2000UL                                         /**< Bit mask for USBAHB_ENUMDONEMSK             */
#define _USBAHB_GINTMSK_ENUMDONEMSK_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_ENUMDONEMSK_DEFAULT                 (_USBAHB_GINTMSK_ENUMDONEMSK_DEFAULT << 13)      /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_ISOOUTDROPMSK                       (0x1UL << 14)                                    /**< Iso OUT Pkt Dropped IRQ Mask                */
#define _USBAHB_GINTMSK_ISOOUTDROPMSK_SHIFT                14                                               /**< Shift value for USBAHB_ISOOUTDROPMSK        */
#define _USBAHB_GINTMSK_ISOOUTDROPMSK_MASK                 0x4000UL                                         /**< Bit mask for USBAHB_ISOOUTDROPMSK           */
#define _USBAHB_GINTMSK_ISOOUTDROPMSK_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_ISOOUTDROPMSK_DEFAULT               (_USBAHB_GINTMSK_ISOOUTDROPMSK_DEFAULT << 14)    /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_EOPFMSK                             (0x1UL << 15)                                    /**< End of Periodic Frame Irq Mask              */
#define _USBAHB_GINTMSK_EOPFMSK_SHIFT                      15                                               /**< Shift value for USBAHB_EOPFMSK              */
#define _USBAHB_GINTMSK_EOPFMSK_MASK                       0x8000UL                                         /**< Bit mask for USBAHB_EOPFMSK                 */
#define _USBAHB_GINTMSK_EOPFMSK_DEFAULT                    0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_EOPFMSK_DEFAULT                     (_USBAHB_GINTMSK_EOPFMSK_DEFAULT << 15)          /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_EPMISMSK                            (0x1UL << 17)                                    /**< Endpoint Mismatch Interrupt Mask            */
#define _USBAHB_GINTMSK_EPMISMSK_SHIFT                     17                                               /**< Shift value for USBAHB_EPMISMSK             */
#define _USBAHB_GINTMSK_EPMISMSK_MASK                      0x20000UL                                        /**< Bit mask for USBAHB_EPMISMSK                */
#define _USBAHB_GINTMSK_EPMISMSK_DEFAULT                   0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_EPMISMSK_DEFAULT                    (_USBAHB_GINTMSK_EPMISMSK_DEFAULT << 17)         /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_IEPINTMSK                           (0x1UL << 18)                                    /**< IN Endpoints Interrupt Mask                 */
#define _USBAHB_GINTMSK_IEPINTMSK_SHIFT                    18                                               /**< Shift value for USBAHB_IEPINTMSK            */
#define _USBAHB_GINTMSK_IEPINTMSK_MASK                     0x40000UL                                        /**< Bit mask for USBAHB_IEPINTMSK               */
#define _USBAHB_GINTMSK_IEPINTMSK_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_IEPINTMSK_DEFAULT                   (_USBAHB_GINTMSK_IEPINTMSK_DEFAULT << 18)        /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_OEPINTMSK                           (0x1UL << 19)                                    /**< OUT Endpoints Interrupt Mask                */
#define _USBAHB_GINTMSK_OEPINTMSK_SHIFT                    19                                               /**< Shift value for USBAHB_OEPINTMSK            */
#define _USBAHB_GINTMSK_OEPINTMSK_MASK                     0x80000UL                                        /**< Bit mask for USBAHB_OEPINTMSK               */
#define _USBAHB_GINTMSK_OEPINTMSK_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_OEPINTMSK_DEFAULT                   (_USBAHB_GINTMSK_OEPINTMSK_DEFAULT << 19)        /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_INCOMPISOINMSK                      (0x1UL << 20)                                    /**< Incomp Iso IN Transfer Mask                 */
#define _USBAHB_GINTMSK_INCOMPISOINMSK_SHIFT               20                                               /**< Shift value for USBAHB_INCOMPISOINMSK       */
#define _USBAHB_GINTMSK_INCOMPISOINMSK_MASK                0x100000UL                                       /**< Bit mask for USBAHB_INCOMPISOINMSK          */
#define _USBAHB_GINTMSK_INCOMPISOINMSK_DEFAULT             0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_INCOMPISOINMSK_DEFAULT              (_USBAHB_GINTMSK_INCOMPISOINMSK_DEFAULT << 20)   /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_INCOMPLISOOUTMSK                    (0x1UL << 21)                                    /**< Incomp Iso OUT Transfer Mask                */
#define _USBAHB_GINTMSK_INCOMPLISOOUTMSK_SHIFT             21                                               /**< Shift value for USBAHB_INCOMPLISOOUTMSK     */
#define _USBAHB_GINTMSK_INCOMPLISOOUTMSK_MASK              0x200000UL                                       /**< Bit mask for USBAHB_INCOMPLISOOUTMSK        */
#define _USBAHB_GINTMSK_INCOMPLISOOUTMSK_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_INCOMPLISOOUTMSK_DEFAULT            (_USBAHB_GINTMSK_INCOMPLISOOUTMSK_DEFAULT << 21) /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_FETSUSPMSK                          (0x1UL << 22)                                    /**< Data Fetch Suspended Mask                   */
#define _USBAHB_GINTMSK_FETSUSPMSK_SHIFT                   22                                               /**< Shift value for USBAHB_FETSUSPMSK           */
#define _USBAHB_GINTMSK_FETSUSPMSK_MASK                    0x400000UL                                       /**< Bit mask for USBAHB_FETSUSPMSK              */
#define _USBAHB_GINTMSK_FETSUSPMSK_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_FETSUSPMSK_DEFAULT                  (_USBAHB_GINTMSK_FETSUSPMSK_DEFAULT << 22)       /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_RESETDETMSK                         (0x1UL << 23)                                    /**< Reset detected Interrupt Mask               */
#define _USBAHB_GINTMSK_RESETDETMSK_SHIFT                  23                                               /**< Shift value for USBAHB_RESETDETMSK          */
#define _USBAHB_GINTMSK_RESETDETMSK_MASK                   0x800000UL                                       /**< Bit mask for USBAHB_RESETDETMSK             */
#define _USBAHB_GINTMSK_RESETDETMSK_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_RESETDETMSK_DEFAULT                 (_USBAHB_GINTMSK_RESETDETMSK_DEFAULT << 23)      /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_CONIDSTSCHNGMSK                     (0x1UL << 28)                                    /**< Connector ID Status Change Mask             */
#define _USBAHB_GINTMSK_CONIDSTSCHNGMSK_SHIFT              28                                               /**< Shift value for USBAHB_CONIDSTSCHNGMSK      */
#define _USBAHB_GINTMSK_CONIDSTSCHNGMSK_MASK               0x10000000UL                                     /**< Bit mask for USBAHB_CONIDSTSCHNGMSK         */
#define _USBAHB_GINTMSK_CONIDSTSCHNGMSK_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_CONIDSTSCHNGMSK_DEFAULT             (_USBAHB_GINTMSK_CONIDSTSCHNGMSK_DEFAULT << 28)  /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */
#define USBAHB_GINTMSK_WKUPINTMSK                          (0x1UL << 31)                                    /**< Resume/Remote WkUp Det Irq Mask             */
#define _USBAHB_GINTMSK_WKUPINTMSK_SHIFT                   31                                               /**< Shift value for USBAHB_WKUPINTMSK           */
#define _USBAHB_GINTMSK_WKUPINTMSK_MASK                    0x80000000UL                                     /**< Bit mask for USBAHB_WKUPINTMSK              */
#define _USBAHB_GINTMSK_WKUPINTMSK_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for USBAHB_GINTMSK             */
#define USBAHB_GINTMSK_WKUPINTMSK_DEFAULT                  (_USBAHB_GINTMSK_WKUPINTMSK_DEFAULT << 31)       /**< Shifted mode DEFAULT for USBAHB_GINTMSK     */

