espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB GRXSTSR */
#define _USBAHB_GRXSTSR_RESETVALUE                         0x00000000UL                           /**< Default value for USBAHB_GRXSTSR            */
#define _USBAHB_GRXSTSR_MASK                               0x01FFFFFFUL                           /**< Mask for USBAHB_GRXSTSR                     */
#define _USBAHB_GRXSTSR_EPNUM_SHIFT                        0                                      /**< Shift value for USBAHB_EPNUM                */
#define _USBAHB_GRXSTSR_EPNUM_MASK                         0xFUL                                  /**< Bit mask for USBAHB_EPNUM                   */
#define _USBAHB_GRXSTSR_EPNUM_DEFAULT                      0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSR             */
#define USBAHB_GRXSTSR_EPNUM_DEFAULT                       (_USBAHB_GRXSTSR_EPNUM_DEFAULT << 0)   /**< Shifted mode DEFAULT for USBAHB_GRXSTSR     */
#define _USBAHB_GRXSTSR_BCNT_SHIFT                         4                                      /**< Shift value for USBAHB_BCNT                 */
#define _USBAHB_GRXSTSR_BCNT_MASK                          0x7FF0UL                               /**< Bit mask for USBAHB_BCNT                    */
#define _USBAHB_GRXSTSR_BCNT_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSR             */
#define USBAHB_GRXSTSR_BCNT_DEFAULT                        (_USBAHB_GRXSTSR_BCNT_DEFAULT << 4)    /**< Shifted mode DEFAULT for USBAHB_GRXSTSR     */
#define _USBAHB_GRXSTSR_DPID_SHIFT                         15                                     /**< Shift value for USBAHB_DPID                 */
#define _USBAHB_GRXSTSR_DPID_MASK                          0x18000UL                              /**< Bit mask for USBAHB_DPID                    */
#define _USBAHB_GRXSTSR_DPID_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSR             */
#define USBAHB_GRXSTSR_DPID_DEFAULT                        (_USBAHB_GRXSTSR_DPID_DEFAULT << 15)   /**< Shifted mode DEFAULT for USBAHB_GRXSTSR     */
#define _USBAHB_GRXSTSR_PKTSTS_SHIFT                       17                                     /**< Shift value for USBAHB_PKTSTS               */
#define _USBAHB_GRXSTSR_PKTSTS_MASK                        0x1E0000UL                             /**< Bit mask for USBAHB_PKTSTS                  */
#define _USBAHB_GRXSTSR_PKTSTS_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSR             */
#define USBAHB_GRXSTSR_PKTSTS_DEFAULT                      (_USBAHB_GRXSTSR_PKTSTS_DEFAULT << 17) /**< Shifted mode DEFAULT for USBAHB_GRXSTSR     */
#define _USBAHB_GRXSTSR_FN_SHIFT                           21                                     /**< Shift value for USBAHB_FN                   */
#define _USBAHB_GRXSTSR_FN_MASK                            0x1E00000UL                            /**< Bit mask for USBAHB_FN                      */
#define _USBAHB_GRXSTSR_FN_DEFAULT                         0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSR             */
#define USBAHB_GRXSTSR_FN_DEFAULT                          (_USBAHB_GRXSTSR_FN_DEFAULT << 21)     /**< Shifted mode DEFAULT for USBAHB_GRXSTSR     */

/* Bit fields for USBAHB GRXSTSP */
#define _USBAHB_GRXSTSP_RESETVALUE                         0x00000000UL                           /**< Default value for USBAHB_GRXSTSP            */
#define _USBAHB_GRXSTSP_MASK                               0x01FFFFFFUL                           /**< Mask for USBAHB_GRXSTSP                     */
#define _USBAHB_GRXSTSP_EPNUM_SHIFT                        0                                      /**< Shift value for USBAHB_EPNUM                */
#define _USBAHB_GRXSTSP_EPNUM_MASK                         0xFUL                                  /**< Bit mask for USBAHB_EPNUM                   */
#define _USBAHB_GRXSTSP_EPNUM_DEFAULT                      0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSP             */
#define USBAHB_GRXSTSP_EPNUM_DEFAULT                       (_USBAHB_GRXSTSP_EPNUM_DEFAULT << 0)   /**< Shifted mode DEFAULT for USBAHB_GRXSTSP     */
#define _USBAHB_GRXSTSP_BCNT_SHIFT                         4                                      /**< Shift value for USBAHB_BCNT                 */
#define _USBAHB_GRXSTSP_BCNT_MASK                          0x7FF0UL                               /**< Bit mask for USBAHB_BCNT                    */
#define _USBAHB_GRXSTSP_BCNT_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSP             */
#define USBAHB_GRXSTSP_BCNT_DEFAULT                        (_USBAHB_GRXSTSP_BCNT_DEFAULT << 4)    /**< Shifted mode DEFAULT for USBAHB_GRXSTSP     */
#define _USBAHB_GRXSTSP_DPID_SHIFT                         15                                     /**< Shift value for USBAHB_DPID                 */
#define _USBAHB_GRXSTSP_DPID_MASK                          0x18000UL                              /**< Bit mask for USBAHB_DPID                    */
#define _USBAHB_GRXSTSP_DPID_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSP             */
#define USBAHB_GRXSTSP_DPID_DEFAULT                        (_USBAHB_GRXSTSP_DPID_DEFAULT << 15)   /**< Shifted mode DEFAULT for USBAHB_GRXSTSP     */
#define _USBAHB_GRXSTSP_PKTSTS_SHIFT                       17                                     /**< Shift value for USBAHB_PKTSTS               */
#define _USBAHB_GRXSTSP_PKTSTS_MASK                        0x1E0000UL                             /**< Bit mask for USBAHB_PKTSTS                  */
#define _USBAHB_GRXSTSP_PKTSTS_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSP             */
#define USBAHB_GRXSTSP_PKTSTS_DEFAULT                      (_USBAHB_GRXSTSP_PKTSTS_DEFAULT << 17) /**< Shifted mode DEFAULT for USBAHB_GRXSTSP     */
#define _USBAHB_GRXSTSP_FN_SHIFT                           21                                     /**< Shift value for USBAHB_FN                   */
#define _USBAHB_GRXSTSP_FN_MASK                            0x1E00000UL                            /**< Bit mask for USBAHB_FN                      */
#define _USBAHB_GRXSTSP_FN_DEFAULT                         0x00000000UL                           /**< Mode DEFAULT for USBAHB_GRXSTSP             */
#define USBAHB_GRXSTSP_FN_DEFAULT                          (_USBAHB_GRXSTSP_FN_DEFAULT << 21)     /**< Shifted mode DEFAULT for USBAHB_GRXSTSP     */

/* Bit fields for USBAHB GRXFSIZ */
#define _USBAHB_GRXFSIZ_RESETVALUE                         0x00000300UL                          /**< Default value for USBAHB_GRXFSIZ            */
#define _USBAHB_GRXFSIZ_MASK                               0x000003FFUL                          /**< Mask for USBAHB_GRXFSIZ                     */
#define _USBAHB_GRXFSIZ_RXFDEP_SHIFT                       0                                     /**< Shift value for USBAHB_RXFDEP               */
#define _USBAHB_GRXFSIZ_RXFDEP_MASK                        0x3FFUL                               /**< Bit mask for USBAHB_RXFDEP                  */
#define _USBAHB_GRXFSIZ_RXFDEP_DEFAULT                     0x00000300UL                          /**< Mode DEFAULT for USBAHB_GRXFSIZ             */
#define USBAHB_GRXFSIZ_RXFDEP_DEFAULT                      (_USBAHB_GRXFSIZ_RXFDEP_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_GRXFSIZ     */

/* Bit fields for USBAHB GNPTXFSIZ */
#define _USBAHB_GNPTXFSIZ_RESETVALUE                       0x03000300UL                                       /**< Default value for USBAHB_GNPTXFSIZ          */
#define _USBAHB_GNPTXFSIZ_MASK                             0x07FF07FFUL                                       /**< Mask for USBAHB_GNPTXFSIZ                   */
#define _USBAHB_GNPTXFSIZ_NPTXFSTADDR_SHIFT                0                                                  /**< Shift value for USBAHB_NPTXFSTADDR          */
#define _USBAHB_GNPTXFSIZ_NPTXFSTADDR_MASK                 0x7FFUL                                            /**< Bit mask for USBAHB_NPTXFSTADDR             */
#define _USBAHB_GNPTXFSIZ_NPTXFSTADDR_DEFAULT              0x00000300UL                                       /**< Mode DEFAULT for USBAHB_GNPTXFSIZ           */
#define USBAHB_GNPTXFSIZ_NPTXFSTADDR_DEFAULT               (_USBAHB_GNPTXFSIZ_NPTXFSTADDR_DEFAULT << 0)       /**< Shifted mode DEFAULT for USBAHB_GNPTXFSIZ   */
#define _USBAHB_GNPTXFSIZ_NPTXFINEPTXF0DEP_SHIFT           16                                                 /**< Shift value for USBAHB_NPTXFINEPTXF0DEP     */
#define _USBAHB_GNPTXFSIZ_NPTXFINEPTXF0DEP_MASK            0x7FF0000UL                                        /**< Bit mask for USBAHB_NPTXFINEPTXF0DEP        */
#define _USBAHB_GNPTXFSIZ_NPTXFINEPTXF0DEP_DEFAULT         0x00000300UL                                       /**< Mode DEFAULT for USBAHB_GNPTXFSIZ           */
#define USBAHB_GNPTXFSIZ_NPTXFINEPTXF0DEP_DEFAULT          (_USBAHB_GNPTXFSIZ_NPTXFINEPTXF0DEP_DEFAULT << 16) /**< Shifted mode DEFAULT for USBAHB_GNPTXFSIZ   */

/* Bit fields for USBAHB GSNPSID */
#define _USBAHB_GSNPSID_RESETVALUE                         0x4F54330AUL                              /**< Default value for USBAHB_GSNPSID            */
#define _USBAHB_GSNPSID_MASK                               0xFFFFFFFFUL                              /**< Mask for USBAHB_GSNPSID                     */
#define _USBAHB_GSNPSID_SYNOPSYSID_SHIFT                   0                                         /**< Shift value for USBAHB_SYNOPSYSID           */
#define _USBAHB_GSNPSID_SYNOPSYSID_MASK                    0xFFFFFFFFUL                              /**< Bit mask for USBAHB_SYNOPSYSID              */
#define _USBAHB_GSNPSID_SYNOPSYSID_DEFAULT                 0x4F54330AUL                              /**< Mode DEFAULT for USBAHB_GSNPSID             */
#define USBAHB_GSNPSID_SYNOPSYSID_DEFAULT                  (_USBAHB_GSNPSID_SYNOPSYSID_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_GSNPSID     */

/* Bit fields for USBAHB GHWCFG1 */
#define _USBAHB_GHWCFG1_RESETVALUE                         0x00000000UL                         /**< Default value for USBAHB_GHWCFG1            */
#define _USBAHB_GHWCFG1_MASK                               0xFFFFFFFFUL                         /**< Mask for USBAHB_GHWCFG1                     */
#define _USBAHB_GHWCFG1_EPDIR_SHIFT                        0                                    /**< Shift value for USBAHB_EPDIR                */
#define _USBAHB_GHWCFG1_EPDIR_MASK                         0xFFFFFFFFUL                         /**< Bit mask for USBAHB_EPDIR                   */
#define _USBAHB_GHWCFG1_EPDIR_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_GHWCFG1             */
#define USBAHB_GHWCFG1_EPDIR_DEFAULT                       (_USBAHB_GHWCFG1_EPDIR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_GHWCFG1     */

