espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB GHWCFG2 */
#define _USBAHB_GHWCFG2_RESETVALUE                         0x0000C014UL                                    /**< Default value for USBAHB_GHWCFG2            */
#define _USBAHB_GHWCFG2_MASK                               0x7FDFFFFFUL                                    /**< Mask for USBAHB_GHWCFG2                     */
#define _USBAHB_GHWCFG2_OTGMODE_SHIFT                      0                                               /**< Shift value for USBAHB_OTGMODE              */
#define _USBAHB_GHWCFG2_OTGMODE_MASK                       0x7UL                                           /**< Bit mask for USBAHB_OTGMODE                 */
#define _USBAHB_GHWCFG2_OTGMODE_DEFAULT                    0x00000004UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_OTGMODE_DEFAULT                     (_USBAHB_GHWCFG2_OTGMODE_DEFAULT << 0)          /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define _USBAHB_GHWCFG2_OTGARCH_SHIFT                      3                                               /**< Shift value for USBAHB_OTGARCH              */
#define _USBAHB_GHWCFG2_OTGARCH_MASK                       0x18UL                                          /**< Bit mask for USBAHB_OTGARCH                 */
#define _USBAHB_GHWCFG2_OTGARCH_DEFAULT                    0x00000002UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_OTGARCH_DEFAULT                     (_USBAHB_GHWCFG2_OTGARCH_DEFAULT << 3)          /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define USBAHB_GHWCFG2_SINGPNT                             (0x1UL << 5)                                    /**< Point-to-Point                              */
#define _USBAHB_GHWCFG2_SINGPNT_SHIFT                      5                                               /**< Shift value for USBAHB_SINGPNT              */
#define _USBAHB_GHWCFG2_SINGPNT_MASK                       0x20UL                                          /**< Bit mask for USBAHB_SINGPNT                 */
#define _USBAHB_GHWCFG2_SINGPNT_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_SINGPNT_DEFAULT                     (_USBAHB_GHWCFG2_SINGPNT_DEFAULT << 5)          /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define _USBAHB_GHWCFG2_HSPHYTYPE_SHIFT                    6                                               /**< Shift value for USBAHB_HSPHYTYPE            */
#define _USBAHB_GHWCFG2_HSPHYTYPE_MASK                     0xC0UL                                          /**< Bit mask for USBAHB_HSPHYTYPE               */
#define _USBAHB_GHWCFG2_HSPHYTYPE_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_HSPHYTYPE_DEFAULT                   (_USBAHB_GHWCFG2_HSPHYTYPE_DEFAULT << 6)        /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define _USBAHB_GHWCFG2_FSPHYTYPE_SHIFT                    8                                               /**< Shift value for USBAHB_FSPHYTYPE            */
#define _USBAHB_GHWCFG2_FSPHYTYPE_MASK                     0x300UL                                         /**< Bit mask for USBAHB_FSPHYTYPE               */
#define _USBAHB_GHWCFG2_FSPHYTYPE_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_FSPHYTYPE_DEFAULT                   (_USBAHB_GHWCFG2_FSPHYTYPE_DEFAULT << 8)        /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define _USBAHB_GHWCFG2_NUMDEVEPS_SHIFT                    10                                              /**< Shift value for USBAHB_NUMDEVEPS            */
#define _USBAHB_GHWCFG2_NUMDEVEPS_MASK                     0x3C00UL                                        /**< Bit mask for USBAHB_NUMDEVEPS               */
#define _USBAHB_GHWCFG2_NUMDEVEPS_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_NUMDEVEPS_DEFAULT                   (_USBAHB_GHWCFG2_NUMDEVEPS_DEFAULT << 10)       /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define _USBAHB_GHWCFG2_NUMHSTCHNL_SHIFT                   14                                              /**< Shift value for USBAHB_NUMHSTCHNL           */
#define _USBAHB_GHWCFG2_NUMHSTCHNL_MASK                    0x3C000UL                                       /**< Bit mask for USBAHB_NUMHSTCHNL              */
#define _USBAHB_GHWCFG2_NUMHSTCHNL_DEFAULT                 0x00000003UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_NUMHSTCHNL_DEFAULT                  (_USBAHB_GHWCFG2_NUMHSTCHNL_DEFAULT << 14)      /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define USBAHB_GHWCFG2_PERIOSUPPORT                        (0x1UL << 18)                                   /**< Per OUT Chan Supported in Host Mode         */
#define _USBAHB_GHWCFG2_PERIOSUPPORT_SHIFT                 18                                              /**< Shift value for USBAHB_PERIOSUPPORT         */
#define _USBAHB_GHWCFG2_PERIOSUPPORT_MASK                  0x40000UL                                       /**< Bit mask for USBAHB_PERIOSUPPORT            */
#define _USBAHB_GHWCFG2_PERIOSUPPORT_DEFAULT               0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_PERIOSUPPORT_DEFAULT                (_USBAHB_GHWCFG2_PERIOSUPPORT_DEFAULT << 18)    /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define USBAHB_GHWCFG2_DYNFIFOSIZING                       (0x1UL << 19)                                   /**< Dynamic FIFO Sizing Enabled                 */
#define _USBAHB_GHWCFG2_DYNFIFOSIZING_SHIFT                19                                              /**< Shift value for USBAHB_DYNFIFOSIZING        */
#define _USBAHB_GHWCFG2_DYNFIFOSIZING_MASK                 0x80000UL                                       /**< Bit mask for USBAHB_DYNFIFOSIZING           */
#define _USBAHB_GHWCFG2_DYNFIFOSIZING_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_DYNFIFOSIZING_DEFAULT               (_USBAHB_GHWCFG2_DYNFIFOSIZING_DEFAULT << 19)   /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define USBAHB_GHWCFG2_MULTIPROCINTRPT                     (0x1UL << 20)                                   /**< Multi Processor Interrupt Enabled           */
#define _USBAHB_GHWCFG2_MULTIPROCINTRPT_SHIFT              20                                              /**< Shift value for USBAHB_MULTIPROCINTRPT      */
#define _USBAHB_GHWCFG2_MULTIPROCINTRPT_MASK               0x100000UL                                      /**< Bit mask for USBAHB_MULTIPROCINTRPT         */
#define _USBAHB_GHWCFG2_MULTIPROCINTRPT_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_MULTIPROCINTRPT_DEFAULT             (_USBAHB_GHWCFG2_MULTIPROCINTRPT_DEFAULT << 20) /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define _USBAHB_GHWCFG2_NPTXQDEPTH_SHIFT                   22                                              /**< Shift value for USBAHB_NPTXQDEPTH           */
#define _USBAHB_GHWCFG2_NPTXQDEPTH_MASK                    0xC00000UL                                      /**< Bit mask for USBAHB_NPTXQDEPTH              */
#define _USBAHB_GHWCFG2_NPTXQDEPTH_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_NPTXQDEPTH_DEFAULT                  (_USBAHB_GHWCFG2_NPTXQDEPTH_DEFAULT << 22)      /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define _USBAHB_GHWCFG2_PTXQDEPTH_SHIFT                    24                                              /**< Shift value for USBAHB_PTXQDEPTH            */
#define _USBAHB_GHWCFG2_PTXQDEPTH_MASK                     0x3000000UL                                     /**< Bit mask for USBAHB_PTXQDEPTH               */
#define _USBAHB_GHWCFG2_PTXQDEPTH_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_PTXQDEPTH_DEFAULT                   (_USBAHB_GHWCFG2_PTXQDEPTH_DEFAULT << 24)       /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */
#define _USBAHB_GHWCFG2_TKNQDEPTH_SHIFT                    26                                              /**< Shift value for USBAHB_TKNQDEPTH            */
#define _USBAHB_GHWCFG2_TKNQDEPTH_MASK                     0x7C000000UL                                    /**< Bit mask for USBAHB_TKNQDEPTH               */
#define _USBAHB_GHWCFG2_TKNQDEPTH_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for USBAHB_GHWCFG2             */
#define USBAHB_GHWCFG2_TKNQDEPTH_DEFAULT                   (_USBAHB_GHWCFG2_TKNQDEPTH_DEFAULT << 26)       /**< Shifted mode DEFAULT for USBAHB_GHWCFG2     */

/* Bit fields for USBAHB GHWCFG3 */
#define _USBAHB_GHWCFG3_RESETVALUE                         0x02EC0468UL                                 /**< Default value for USBAHB_GHWCFG3            */
#define _USBAHB_GHWCFG3_MASK                               0xFFFFFFFFUL                                 /**< Mask for USBAHB_GHWCFG3                     */
#define _USBAHB_GHWCFG3_XFERSIZEWIDTH_SHIFT                0                                            /**< Shift value for USBAHB_XFERSIZEWIDTH        */
#define _USBAHB_GHWCFG3_XFERSIZEWIDTH_MASK                 0xFUL                                        /**< Bit mask for USBAHB_XFERSIZEWIDTH           */
#define _USBAHB_GHWCFG3_XFERSIZEWIDTH_DEFAULT              0x00000008UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_XFERSIZEWIDTH_DEFAULT               (_USBAHB_GHWCFG3_XFERSIZEWIDTH_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define _USBAHB_GHWCFG3_PKTSIZEWIDTH_SHIFT                 4                                            /**< Shift value for USBAHB_PKTSIZEWIDTH         */
#define _USBAHB_GHWCFG3_PKTSIZEWIDTH_MASK                  0x70UL                                       /**< Bit mask for USBAHB_PKTSIZEWIDTH            */
#define _USBAHB_GHWCFG3_PKTSIZEWIDTH_DEFAULT               0x00000006UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_PKTSIZEWIDTH_DEFAULT                (_USBAHB_GHWCFG3_PKTSIZEWIDTH_DEFAULT << 4)  /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define USBAHB_GHWCFG3_OTGEN                               (0x1UL << 7)                                 /**< OTG Function Enabled                        */
#define _USBAHB_GHWCFG3_OTGEN_SHIFT                        7                                            /**< Shift value for USBAHB_OTGEN                */
#define _USBAHB_GHWCFG3_OTGEN_MASK                         0x80UL                                       /**< Bit mask for USBAHB_OTGEN                   */
#define _USBAHB_GHWCFG3_OTGEN_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_OTGEN_DEFAULT                       (_USBAHB_GHWCFG3_OTGEN_DEFAULT << 7)         /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define USBAHB_GHWCFG3_I2CINTSEL                           (0x1UL << 8)                                 /**< I2C Selection                               */
#define _USBAHB_GHWCFG3_I2CINTSEL_SHIFT                    8                                            /**< Shift value for USBAHB_I2CINTSEL            */
#define _USBAHB_GHWCFG3_I2CINTSEL_MASK                     0x100UL                                      /**< Bit mask for USBAHB_I2CINTSEL               */
#define _USBAHB_GHWCFG3_I2CINTSEL_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_I2CINTSEL_DEFAULT                   (_USBAHB_GHWCFG3_I2CINTSEL_DEFAULT << 8)     /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define USBAHB_GHWCFG3_VNDCTLSUPT                          (0x1UL << 9)                                 /**< Vendor Control Interface Support            */
#define _USBAHB_GHWCFG3_VNDCTLSUPT_SHIFT                   9                                            /**< Shift value for USBAHB_VNDCTLSUPT           */
#define _USBAHB_GHWCFG3_VNDCTLSUPT_MASK                    0x200UL                                      /**< Bit mask for USBAHB_VNDCTLSUPT              */
#define _USBAHB_GHWCFG3_VNDCTLSUPT_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_VNDCTLSUPT_DEFAULT                  (_USBAHB_GHWCFG3_VNDCTLSUPT_DEFAULT << 9)    /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define USBAHB_GHWCFG3_OPTFEATURE                          (0x1UL << 10)                                /**< Optional Features Removed                   */
#define _USBAHB_GHWCFG3_OPTFEATURE_SHIFT                   10                                           /**< Shift value for USBAHB_OPTFEATURE           */
#define _USBAHB_GHWCFG3_OPTFEATURE_MASK                    0x400UL                                      /**< Bit mask for USBAHB_OPTFEATURE              */
#define _USBAHB_GHWCFG3_OPTFEATURE_DEFAULT                 0x00000001UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_OPTFEATURE_DEFAULT                  (_USBAHB_GHWCFG3_OPTFEATURE_DEFAULT << 10)   /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define USBAHB_GHWCFG3_RSTTYPE                             (0x1UL << 11)                                /**< Reset Style For Clocked always              */
#define _USBAHB_GHWCFG3_RSTTYPE_SHIFT                      11                                           /**< Shift value for USBAHB_RSTTYPE              */
#define _USBAHB_GHWCFG3_RSTTYPE_MASK                       0x800UL                                      /**< Bit mask for USBAHB_RSTTYPE                 */
#define _USBAHB_GHWCFG3_RSTTYPE_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_RSTTYPE_DEFAULT                     (_USBAHB_GHWCFG3_RSTTYPE_DEFAULT << 11)      /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define USBAHB_GHWCFG3_ADPSUPPORT                          (0x1UL << 12)                                /**< New BitField                                */
#define _USBAHB_GHWCFG3_ADPSUPPORT_SHIFT                   12                                           /**< Shift value for USBAHB_ADPSUPPORT           */
#define _USBAHB_GHWCFG3_ADPSUPPORT_MASK                    0x1000UL                                     /**< Bit mask for USBAHB_ADPSUPPORT              */
#define _USBAHB_GHWCFG3_ADPSUPPORT_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_ADPSUPPORT_DEFAULT                  (_USBAHB_GHWCFG3_ADPSUPPORT_DEFAULT << 12)   /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define USBAHB_GHWCFG3_HSICMODE                            (0x1UL << 13)                                /**< New BitField                                */
#define _USBAHB_GHWCFG3_HSICMODE_SHIFT                     13                                           /**< Shift value for USBAHB_HSICMODE             */
#define _USBAHB_GHWCFG3_HSICMODE_MASK                      0x2000UL                                     /**< Bit mask for USBAHB_HSICMODE                */
#define _USBAHB_GHWCFG3_HSICMODE_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_HSICMODE_DEFAULT                    (_USBAHB_GHWCFG3_HSICMODE_DEFAULT << 13)     /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define USBAHB_GHWCFG3_BCSUPPORT                           (0x1UL << 14)                                /**< New BitField                                */
#define _USBAHB_GHWCFG3_BCSUPPORT_SHIFT                    14                                           /**< Shift value for USBAHB_BCSUPPORT            */
#define _USBAHB_GHWCFG3_BCSUPPORT_MASK                     0x4000UL                                     /**< Bit mask for USBAHB_BCSUPPORT               */
#define _USBAHB_GHWCFG3_BCSUPPORT_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_BCSUPPORT_DEFAULT                   (_USBAHB_GHWCFG3_BCSUPPORT_DEFAULT << 14)    /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define USBAHB_GHWCFG3_LPMMODE                             (0x1UL << 15)                                /**< New BitField                                */
#define _USBAHB_GHWCFG3_LPMMODE_SHIFT                      15                                           /**< Shift value for USBAHB_LPMMODE              */
#define _USBAHB_GHWCFG3_LPMMODE_MASK                       0x8000UL                                     /**< Bit mask for USBAHB_LPMMODE                 */
#define _USBAHB_GHWCFG3_LPMMODE_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_LPMMODE_DEFAULT                     (_USBAHB_GHWCFG3_LPMMODE_DEFAULT << 15)      /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */
#define _USBAHB_GHWCFG3_DFIFODEPTH_SHIFT                   16                                           /**< Shift value for USBAHB_DFIFODEPTH           */
#define _USBAHB_GHWCFG3_DFIFODEPTH_MASK                    0xFFFF0000UL                                 /**< Bit mask for USBAHB_DFIFODEPTH              */
#define _USBAHB_GHWCFG3_DFIFODEPTH_DEFAULT                 0x000002ECUL                                 /**< Mode DEFAULT for USBAHB_GHWCFG3             */
#define USBAHB_GHWCFG3_DFIFODEPTH_DEFAULT                  (_USBAHB_GHWCFG3_DFIFODEPTH_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_GHWCFG3     */

