espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB GHWCFG4 */
#define _USBAHB_GHWCFG4_RESETVALUE                         0x26008030UL                                       /**< Default value for USBAHB_GHWCFG4            */
#define _USBAHB_GHWCFG4_MASK                               0xFFFFC0FFUL                                       /**< Mask for USBAHB_GHWCFG4                     */
#define _USBAHB_GHWCFG4_NUMDEVPERIOEPS_SHIFT               0                                                  /**< Shift value for USBAHB_NUMDEVPERIOEPS       */
#define _USBAHB_GHWCFG4_NUMDEVPERIOEPS_MASK                0xFUL                                              /**< Bit mask for USBAHB_NUMDEVPERIOEPS          */
#define _USBAHB_GHWCFG4_NUMDEVPERIOEPS_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_NUMDEVPERIOEPS_DEFAULT              (_USBAHB_GHWCFG4_NUMDEVPERIOEPS_DEFAULT << 0)      /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_PARTIALPWRDN                        (0x1UL << 4)                                       /**< New BitField                                */
#define _USBAHB_GHWCFG4_PARTIALPWRDN_SHIFT                 4                                                  /**< Shift value for USBAHB_PARTIALPWRDN         */
#define _USBAHB_GHWCFG4_PARTIALPWRDN_MASK                  0x10UL                                             /**< Bit mask for USBAHB_PARTIALPWRDN            */
#define _USBAHB_GHWCFG4_PARTIALPWRDN_DEFAULT               0x00000001UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_PARTIALPWRDN_DEFAULT                (_USBAHB_GHWCFG4_PARTIALPWRDN_DEFAULT << 4)        /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_AHBFREQ                             (0x1UL << 5)                                       /**< AHB Frequency                               */
#define _USBAHB_GHWCFG4_AHBFREQ_SHIFT                      5                                                  /**< Shift value for USBAHB_AHBFREQ              */
#define _USBAHB_GHWCFG4_AHBFREQ_MASK                       0x20UL                                             /**< Bit mask for USBAHB_AHBFREQ                 */
#define _USBAHB_GHWCFG4_AHBFREQ_DEFAULT                    0x00000001UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_AHBFREQ_DEFAULT                     (_USBAHB_GHWCFG4_AHBFREQ_DEFAULT << 5)             /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_HIBERNATION                         (0x1UL << 6)                                       /**< New BitField                                */
#define _USBAHB_GHWCFG4_HIBERNATION_SHIFT                  6                                                  /**< Shift value for USBAHB_HIBERNATION          */
#define _USBAHB_GHWCFG4_HIBERNATION_MASK                   0x40UL                                             /**< Bit mask for USBAHB_HIBERNATION             */
#define _USBAHB_GHWCFG4_HIBERNATION_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_HIBERNATION_DEFAULT                 (_USBAHB_GHWCFG4_HIBERNATION_DEFAULT << 6)         /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_EXTENDEDHIBERNATION                 (0x1UL << 7)                                       /**< New BitField                                */
#define _USBAHB_GHWCFG4_EXTENDEDHIBERNATION_SHIFT          7                                                  /**< Shift value for USBAHB_EXTENDEDHIBERNATION  */
#define _USBAHB_GHWCFG4_EXTENDEDHIBERNATION_MASK           0x80UL                                             /**< Bit mask for USBAHB_EXTENDEDHIBERNATION     */
#define _USBAHB_GHWCFG4_EXTENDEDHIBERNATION_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_EXTENDEDHIBERNATION_DEFAULT         (_USBAHB_GHWCFG4_EXTENDEDHIBERNATION_DEFAULT << 7) /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define _USBAHB_GHWCFG4_PHYDATAWIDTH_SHIFT                 14                                                 /**< Shift value for USBAHB_PHYDATAWIDTH         */
#define _USBAHB_GHWCFG4_PHYDATAWIDTH_MASK                  0xC000UL                                           /**< Bit mask for USBAHB_PHYDATAWIDTH            */
#define _USBAHB_GHWCFG4_PHYDATAWIDTH_DEFAULT               0x00000002UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_PHYDATAWIDTH_DEFAULT                (_USBAHB_GHWCFG4_PHYDATAWIDTH_DEFAULT << 14)       /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define _USBAHB_GHWCFG4_NUMCTLEPS_SHIFT                    16                                                 /**< Shift value for USBAHB_NUMCTLEPS            */
#define _USBAHB_GHWCFG4_NUMCTLEPS_MASK                     0xF0000UL                                          /**< Bit mask for USBAHB_NUMCTLEPS               */
#define _USBAHB_GHWCFG4_NUMCTLEPS_DEFAULT                  0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_NUMCTLEPS_DEFAULT                   (_USBAHB_GHWCFG4_NUMCTLEPS_DEFAULT << 16)          /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_IDDGFLTR                            (0x1UL << 20)                                      /**< New BitField                                */
#define _USBAHB_GHWCFG4_IDDGFLTR_SHIFT                     20                                                 /**< Shift value for USBAHB_IDDGFLTR             */
#define _USBAHB_GHWCFG4_IDDGFLTR_MASK                      0x100000UL                                         /**< Bit mask for USBAHB_IDDGFLTR                */
#define _USBAHB_GHWCFG4_IDDGFLTR_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_IDDGFLTR_DEFAULT                    (_USBAHB_GHWCFG4_IDDGFLTR_DEFAULT << 20)           /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_VBUSVALIDFLTR                       (0x1UL << 21)                                      /**< New BitField                                */
#define _USBAHB_GHWCFG4_VBUSVALIDFLTR_SHIFT                21                                                 /**< Shift value for USBAHB_VBUSVALIDFLTR        */
#define _USBAHB_GHWCFG4_VBUSVALIDFLTR_MASK                 0x200000UL                                         /**< Bit mask for USBAHB_VBUSVALIDFLTR           */
#define _USBAHB_GHWCFG4_VBUSVALIDFLTR_DEFAULT              0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_VBUSVALIDFLTR_DEFAULT               (_USBAHB_GHWCFG4_VBUSVALIDFLTR_DEFAULT << 21)      /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_AVALIDFLTR                          (0x1UL << 22)                                      /**< New BitField                                */
#define _USBAHB_GHWCFG4_AVALIDFLTR_SHIFT                   22                                                 /**< Shift value for USBAHB_AVALIDFLTR           */
#define _USBAHB_GHWCFG4_AVALIDFLTR_MASK                    0x400000UL                                         /**< Bit mask for USBAHB_AVALIDFLTR              */
#define _USBAHB_GHWCFG4_AVALIDFLTR_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_AVALIDFLTR_DEFAULT                  (_USBAHB_GHWCFG4_AVALIDFLTR_DEFAULT << 22)         /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_BVALIDFLTR                          (0x1UL << 23)                                      /**< New BitField                                */
#define _USBAHB_GHWCFG4_BVALIDFLTR_SHIFT                   23                                                 /**< Shift value for USBAHB_BVALIDFLTR           */
#define _USBAHB_GHWCFG4_BVALIDFLTR_MASK                    0x800000UL                                         /**< Bit mask for USBAHB_BVALIDFLTR              */
#define _USBAHB_GHWCFG4_BVALIDFLTR_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_BVALIDFLTR_DEFAULT                  (_USBAHB_GHWCFG4_BVALIDFLTR_DEFAULT << 23)         /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_SESSENDFLTR                         (0x1UL << 24)                                      /**< New BitField                                */
#define _USBAHB_GHWCFG4_SESSENDFLTR_SHIFT                  24                                                 /**< Shift value for USBAHB_SESSENDFLTR          */
#define _USBAHB_GHWCFG4_SESSENDFLTR_MASK                   0x1000000UL                                        /**< Bit mask for USBAHB_SESSENDFLTR             */
#define _USBAHB_GHWCFG4_SESSENDFLTR_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_SESSENDFLTR_DEFAULT                 (_USBAHB_GHWCFG4_SESSENDFLTR_DEFAULT << 24)        /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_DEDFIFOMODE                         (0x1UL << 25)                                      /**< Dedicated xmit FIFO For device IN EPs       */
#define _USBAHB_GHWCFG4_DEDFIFOMODE_SHIFT                  25                                                 /**< Shift value for USBAHB_DEDFIFOMODE          */
#define _USBAHB_GHWCFG4_DEDFIFOMODE_MASK                   0x2000000UL                                        /**< Bit mask for USBAHB_DEDFIFOMODE             */
#define _USBAHB_GHWCFG4_DEDFIFOMODE_DEFAULT                0x00000001UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_DEDFIFOMODE_DEFAULT                 (_USBAHB_GHWCFG4_DEDFIFOMODE_DEFAULT << 25)        /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define _USBAHB_GHWCFG4_INEPS_SHIFT                        26                                                 /**< Shift value for USBAHB_INEPS                */
#define _USBAHB_GHWCFG4_INEPS_MASK                         0x3C000000UL                                       /**< Bit mask for USBAHB_INEPS                   */
#define _USBAHB_GHWCFG4_INEPS_DEFAULT                      0x00000009UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_INEPS_DEFAULT                       (_USBAHB_GHWCFG4_INEPS_DEFAULT << 26)              /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_DESCDMAENABLED                      (0x1UL << 30)                                      /**< New BitField                                */
#define _USBAHB_GHWCFG4_DESCDMAENABLED_SHIFT               30                                                 /**< Shift value for USBAHB_DESCDMAENABLED       */
#define _USBAHB_GHWCFG4_DESCDMAENABLED_MASK                0x40000000UL                                       /**< Bit mask for USBAHB_DESCDMAENABLED          */
#define _USBAHB_GHWCFG4_DESCDMAENABLED_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_DESCDMAENABLED_DEFAULT              (_USBAHB_GHWCFG4_DESCDMAENABLED_DEFAULT << 30)     /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */
#define USBAHB_GHWCFG4_DESCDMA                             (0x1UL << 31)                                      /**< New BitField                                */
#define _USBAHB_GHWCFG4_DESCDMA_SHIFT                      31                                                 /**< Shift value for USBAHB_DESCDMA              */
#define _USBAHB_GHWCFG4_DESCDMA_MASK                       0x80000000UL                                       /**< Bit mask for USBAHB_DESCDMA                 */
#define _USBAHB_GHWCFG4_DESCDMA_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for USBAHB_GHWCFG4             */
#define USBAHB_GHWCFG4_DESCDMA_DEFAULT                     (_USBAHB_GHWCFG4_DESCDMA_DEFAULT << 31)            /**< Shifted mode DEFAULT for USBAHB_GHWCFG4     */

/* Bit fields for USBAHB GDFIFOCFG */
#define _USBAHB_GDFIFOCFG_RESETVALUE                       0x02EC0300UL                                     /**< Default value for USBAHB_GDFIFOCFG          */
#define _USBAHB_GDFIFOCFG_MASK                             0xFFFFFFFFUL                                     /**< Mask for USBAHB_GDFIFOCFG                   */
#define _USBAHB_GDFIFOCFG_GDFIFOCFG_SHIFT                  0                                                /**< Shift value for USBAHB_GDFIFOCFG            */
#define _USBAHB_GDFIFOCFG_GDFIFOCFG_MASK                   0xFFFFUL                                         /**< Bit mask for USBAHB_GDFIFOCFG               */
#define _USBAHB_GDFIFOCFG_GDFIFOCFG_DEFAULT                0x00000300UL                                     /**< Mode DEFAULT for USBAHB_GDFIFOCFG           */
#define USBAHB_GDFIFOCFG_GDFIFOCFG_DEFAULT                 (_USBAHB_GDFIFOCFG_GDFIFOCFG_DEFAULT << 0)       /**< Shifted mode DEFAULT for USBAHB_GDFIFOCFG   */
#define _USBAHB_GDFIFOCFG_EPINFOBASEADDR_SHIFT             16                                               /**< Shift value for USBAHB_EPINFOBASEADDR       */
#define _USBAHB_GDFIFOCFG_EPINFOBASEADDR_MASK              0xFFFF0000UL                                     /**< Bit mask for USBAHB_EPINFOBASEADDR          */
#define _USBAHB_GDFIFOCFG_EPINFOBASEADDR_DEFAULT           0x000002ECUL                                     /**< Mode DEFAULT for USBAHB_GDFIFOCFG           */
#define USBAHB_GDFIFOCFG_EPINFOBASEADDR_DEFAULT            (_USBAHB_GDFIFOCFG_EPINFOBASEADDR_DEFAULT << 16) /**< Shifted mode DEFAULT for USBAHB_GDFIFOCFG   */

/* Bit fields for USBAHB DIEPTXF1 */
#define _USBAHB_DIEPTXF1_RESETVALUE                        0x03000600UL                                   /**< Default value for USBAHB_DIEPTXF1           */
#define _USBAHB_DIEPTXF1_MASK                              0x03FF0FFFUL                                   /**< Mask for USBAHB_DIEPTXF1                    */
#define _USBAHB_DIEPTXF1_INEPNTXFSTADDR_SHIFT              0                                              /**< Shift value for USBAHB_INEPNTXFSTADDR       */
#define _USBAHB_DIEPTXF1_INEPNTXFSTADDR_MASK               0xFFFUL                                        /**< Bit mask for USBAHB_INEPNTXFSTADDR          */
#define _USBAHB_DIEPTXF1_INEPNTXFSTADDR_DEFAULT            0x00000600UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF1            */
#define USBAHB_DIEPTXF1_INEPNTXFSTADDR_DEFAULT             (_USBAHB_DIEPTXF1_INEPNTXFSTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPTXF1    */
#define _USBAHB_DIEPTXF1_INEPNTXFDEP_SHIFT                 16                                             /**< Shift value for USBAHB_INEPNTXFDEP          */
#define _USBAHB_DIEPTXF1_INEPNTXFDEP_MASK                  0x3FF0000UL                                    /**< Bit mask for USBAHB_INEPNTXFDEP             */
#define _USBAHB_DIEPTXF1_INEPNTXFDEP_DEFAULT               0x00000300UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF1            */
#define USBAHB_DIEPTXF1_INEPNTXFDEP_DEFAULT                (_USBAHB_DIEPTXF1_INEPNTXFDEP_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_DIEPTXF1    */

