espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DIEPTXF2 */
#define _USBAHB_DIEPTXF2_RESETVALUE                        0x03000900UL                                   /**< Default value for USBAHB_DIEPTXF2           */
#define _USBAHB_DIEPTXF2_MASK                              0x03FF0FFFUL                                   /**< Mask for USBAHB_DIEPTXF2                    */
#define _USBAHB_DIEPTXF2_INEPNTXFSTADDR_SHIFT              0                                              /**< Shift value for USBAHB_INEPNTXFSTADDR       */
#define _USBAHB_DIEPTXF2_INEPNTXFSTADDR_MASK               0xFFFUL                                        /**< Bit mask for USBAHB_INEPNTXFSTADDR          */
#define _USBAHB_DIEPTXF2_INEPNTXFSTADDR_DEFAULT            0x00000900UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF2            */
#define USBAHB_DIEPTXF2_INEPNTXFSTADDR_DEFAULT             (_USBAHB_DIEPTXF2_INEPNTXFSTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPTXF2    */
#define _USBAHB_DIEPTXF2_INEPNTXFDEP_SHIFT                 16                                             /**< Shift value for USBAHB_INEPNTXFDEP          */
#define _USBAHB_DIEPTXF2_INEPNTXFDEP_MASK                  0x3FF0000UL                                    /**< Bit mask for USBAHB_INEPNTXFDEP             */
#define _USBAHB_DIEPTXF2_INEPNTXFDEP_DEFAULT               0x00000300UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF2            */
#define USBAHB_DIEPTXF2_INEPNTXFDEP_DEFAULT                (_USBAHB_DIEPTXF2_INEPNTXFDEP_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_DIEPTXF2    */

/* Bit fields for USBAHB DIEPTXF3 */
#define _USBAHB_DIEPTXF3_RESETVALUE                        0x03000C00UL                                   /**< Default value for USBAHB_DIEPTXF3           */
#define _USBAHB_DIEPTXF3_MASK                              0x03FF0FFFUL                                   /**< Mask for USBAHB_DIEPTXF3                    */
#define _USBAHB_DIEPTXF3_INEPNTXFSTADDR_SHIFT              0                                              /**< Shift value for USBAHB_INEPNTXFSTADDR       */
#define _USBAHB_DIEPTXF3_INEPNTXFSTADDR_MASK               0xFFFUL                                        /**< Bit mask for USBAHB_INEPNTXFSTADDR          */
#define _USBAHB_DIEPTXF3_INEPNTXFSTADDR_DEFAULT            0x00000C00UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF3            */
#define USBAHB_DIEPTXF3_INEPNTXFSTADDR_DEFAULT             (_USBAHB_DIEPTXF3_INEPNTXFSTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPTXF3    */
#define _USBAHB_DIEPTXF3_INEPNTXFDEP_SHIFT                 16                                             /**< Shift value for USBAHB_INEPNTXFDEP          */
#define _USBAHB_DIEPTXF3_INEPNTXFDEP_MASK                  0x3FF0000UL                                    /**< Bit mask for USBAHB_INEPNTXFDEP             */
#define _USBAHB_DIEPTXF3_INEPNTXFDEP_DEFAULT               0x00000300UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF3            */
#define USBAHB_DIEPTXF3_INEPNTXFDEP_DEFAULT                (_USBAHB_DIEPTXF3_INEPNTXFDEP_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_DIEPTXF3    */

/* Bit fields for USBAHB DIEPTXF4 */
#define _USBAHB_DIEPTXF4_RESETVALUE                        0x03000F00UL                                   /**< Default value for USBAHB_DIEPTXF4           */
#define _USBAHB_DIEPTXF4_MASK                              0x03FF0FFFUL                                   /**< Mask for USBAHB_DIEPTXF4                    */
#define _USBAHB_DIEPTXF4_INEPNTXFSTADDR_SHIFT              0                                              /**< Shift value for USBAHB_INEPNTXFSTADDR       */
#define _USBAHB_DIEPTXF4_INEPNTXFSTADDR_MASK               0xFFFUL                                        /**< Bit mask for USBAHB_INEPNTXFSTADDR          */
#define _USBAHB_DIEPTXF4_INEPNTXFSTADDR_DEFAULT            0x00000F00UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF4            */
#define USBAHB_DIEPTXF4_INEPNTXFSTADDR_DEFAULT             (_USBAHB_DIEPTXF4_INEPNTXFSTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPTXF4    */
#define _USBAHB_DIEPTXF4_INEPNTXFDEP_SHIFT                 16                                             /**< Shift value for USBAHB_INEPNTXFDEP          */
#define _USBAHB_DIEPTXF4_INEPNTXFDEP_MASK                  0x3FF0000UL                                    /**< Bit mask for USBAHB_INEPNTXFDEP             */
#define _USBAHB_DIEPTXF4_INEPNTXFDEP_DEFAULT               0x00000300UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF4            */
#define USBAHB_DIEPTXF4_INEPNTXFDEP_DEFAULT                (_USBAHB_DIEPTXF4_INEPNTXFDEP_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_DIEPTXF4    */

/* Bit fields for USBAHB DIEPTXF5 */
#define _USBAHB_DIEPTXF5_RESETVALUE                        0x03001200UL                                   /**< Default value for USBAHB_DIEPTXF5           */
#define _USBAHB_DIEPTXF5_MASK                              0x03FF1FFFUL                                   /**< Mask for USBAHB_DIEPTXF5                    */
#define _USBAHB_DIEPTXF5_INEPNTXFSTADDR_SHIFT              0                                              /**< Shift value for USBAHB_INEPNTXFSTADDR       */
#define _USBAHB_DIEPTXF5_INEPNTXFSTADDR_MASK               0x1FFFUL                                       /**< Bit mask for USBAHB_INEPNTXFSTADDR          */
#define _USBAHB_DIEPTXF5_INEPNTXFSTADDR_DEFAULT            0x00001200UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF5            */
#define USBAHB_DIEPTXF5_INEPNTXFSTADDR_DEFAULT             (_USBAHB_DIEPTXF5_INEPNTXFSTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPTXF5    */
#define _USBAHB_DIEPTXF5_INEPNTXFDEP_SHIFT                 16                                             /**< Shift value for USBAHB_INEPNTXFDEP          */
#define _USBAHB_DIEPTXF5_INEPNTXFDEP_MASK                  0x3FF0000UL                                    /**< Bit mask for USBAHB_INEPNTXFDEP             */
#define _USBAHB_DIEPTXF5_INEPNTXFDEP_DEFAULT               0x00000300UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF5            */
#define USBAHB_DIEPTXF5_INEPNTXFDEP_DEFAULT                (_USBAHB_DIEPTXF5_INEPNTXFDEP_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_DIEPTXF5    */

/* Bit fields for USBAHB DIEPTXF6 */
#define _USBAHB_DIEPTXF6_RESETVALUE                        0x03001500UL                                   /**< Default value for USBAHB_DIEPTXF6           */
#define _USBAHB_DIEPTXF6_MASK                              0x03FF1FFFUL                                   /**< Mask for USBAHB_DIEPTXF6                    */
#define _USBAHB_DIEPTXF6_INEPNTXFSTADDR_SHIFT              0                                              /**< Shift value for USBAHB_INEPNTXFSTADDR       */
#define _USBAHB_DIEPTXF6_INEPNTXFSTADDR_MASK               0x1FFFUL                                       /**< Bit mask for USBAHB_INEPNTXFSTADDR          */
#define _USBAHB_DIEPTXF6_INEPNTXFSTADDR_DEFAULT            0x00001500UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF6            */
#define USBAHB_DIEPTXF6_INEPNTXFSTADDR_DEFAULT             (_USBAHB_DIEPTXF6_INEPNTXFSTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPTXF6    */
#define _USBAHB_DIEPTXF6_INEPNTXFDEP_SHIFT                 16                                             /**< Shift value for USBAHB_INEPNTXFDEP          */
#define _USBAHB_DIEPTXF6_INEPNTXFDEP_MASK                  0x3FF0000UL                                    /**< Bit mask for USBAHB_INEPNTXFDEP             */
#define _USBAHB_DIEPTXF6_INEPNTXFDEP_DEFAULT               0x00000300UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF6            */
#define USBAHB_DIEPTXF6_INEPNTXFDEP_DEFAULT                (_USBAHB_DIEPTXF6_INEPNTXFDEP_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_DIEPTXF6    */

/* Bit fields for USBAHB DIEPTXF7 */
#define _USBAHB_DIEPTXF7_RESETVALUE                        0x03001800UL                                   /**< Default value for USBAHB_DIEPTXF7           */
#define _USBAHB_DIEPTXF7_MASK                              0x03FF1FFFUL                                   /**< Mask for USBAHB_DIEPTXF7                    */
#define _USBAHB_DIEPTXF7_INEPNTXFSTADDR_SHIFT              0                                              /**< Shift value for USBAHB_INEPNTXFSTADDR       */
#define _USBAHB_DIEPTXF7_INEPNTXFSTADDR_MASK               0x1FFFUL                                       /**< Bit mask for USBAHB_INEPNTXFSTADDR          */
#define _USBAHB_DIEPTXF7_INEPNTXFSTADDR_DEFAULT            0x00001800UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF7            */
#define USBAHB_DIEPTXF7_INEPNTXFSTADDR_DEFAULT             (_USBAHB_DIEPTXF7_INEPNTXFSTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPTXF7    */
#define _USBAHB_DIEPTXF7_INEPNTXFDEP_SHIFT                 16                                             /**< Shift value for USBAHB_INEPNTXFDEP          */
#define _USBAHB_DIEPTXF7_INEPNTXFDEP_MASK                  0x3FF0000UL                                    /**< Bit mask for USBAHB_INEPNTXFDEP             */
#define _USBAHB_DIEPTXF7_INEPNTXFDEP_DEFAULT               0x00000300UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF7            */
#define USBAHB_DIEPTXF7_INEPNTXFDEP_DEFAULT                (_USBAHB_DIEPTXF7_INEPNTXFDEP_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_DIEPTXF7    */

