espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DIEPTXF8 */
#define _USBAHB_DIEPTXF8_RESETVALUE                        0x03001B00UL                                   /**< Default value for USBAHB_DIEPTXF8           */
#define _USBAHB_DIEPTXF8_MASK                              0x03FF1FFFUL                                   /**< Mask for USBAHB_DIEPTXF8                    */
#define _USBAHB_DIEPTXF8_INEPNTXFSTADDR_SHIFT              0                                              /**< Shift value for USBAHB_INEPNTXFSTADDR       */
#define _USBAHB_DIEPTXF8_INEPNTXFSTADDR_MASK               0x1FFFUL                                       /**< Bit mask for USBAHB_INEPNTXFSTADDR          */
#define _USBAHB_DIEPTXF8_INEPNTXFSTADDR_DEFAULT            0x00001B00UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF8            */
#define USBAHB_DIEPTXF8_INEPNTXFSTADDR_DEFAULT             (_USBAHB_DIEPTXF8_INEPNTXFSTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPTXF8    */
#define _USBAHB_DIEPTXF8_INEPNTXFDEP_SHIFT                 16                                             /**< Shift value for USBAHB_INEPNTXFDEP          */
#define _USBAHB_DIEPTXF8_INEPNTXFDEP_MASK                  0x3FF0000UL                                    /**< Bit mask for USBAHB_INEPNTXFDEP             */
#define _USBAHB_DIEPTXF8_INEPNTXFDEP_DEFAULT               0x00000300UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF8            */
#define USBAHB_DIEPTXF8_INEPNTXFDEP_DEFAULT                (_USBAHB_DIEPTXF8_INEPNTXFDEP_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_DIEPTXF8    */

/* Bit fields for USBAHB DIEPTXF9 */
#define _USBAHB_DIEPTXF9_RESETVALUE                        0x03001E00UL                                   /**< Default value for USBAHB_DIEPTXF9           */
#define _USBAHB_DIEPTXF9_MASK                              0x03FF1FFFUL                                   /**< Mask for USBAHB_DIEPTXF9                    */
#define _USBAHB_DIEPTXF9_INEPNTXFSTADDR_SHIFT              0                                              /**< Shift value for USBAHB_INEPNTXFSTADDR       */
#define _USBAHB_DIEPTXF9_INEPNTXFSTADDR_MASK               0x1FFFUL                                       /**< Bit mask for USBAHB_INEPNTXFSTADDR          */
#define _USBAHB_DIEPTXF9_INEPNTXFSTADDR_DEFAULT            0x00001E00UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF9            */
#define USBAHB_DIEPTXF9_INEPNTXFSTADDR_DEFAULT             (_USBAHB_DIEPTXF9_INEPNTXFSTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPTXF9    */
#define _USBAHB_DIEPTXF9_INEPNTXFDEP_SHIFT                 16                                             /**< Shift value for USBAHB_INEPNTXFDEP          */
#define _USBAHB_DIEPTXF9_INEPNTXFDEP_MASK                  0x3FF0000UL                                    /**< Bit mask for USBAHB_INEPNTXFDEP             */
#define _USBAHB_DIEPTXF9_INEPNTXFDEP_DEFAULT               0x00000300UL                                   /**< Mode DEFAULT for USBAHB_DIEPTXF9            */
#define USBAHB_DIEPTXF9_INEPNTXFDEP_DEFAULT                (_USBAHB_DIEPTXF9_INEPNTXFDEP_DEFAULT << 16)   /**< Shifted mode DEFAULT for USBAHB_DIEPTXF9    */

/* Bit fields for USBAHB DCFG */
#define _USBAHB_DCFG_RESETVALUE                            0x08000000UL                               /**< Default value for USBAHB_DCFG               */
#define _USBAHB_DCFG_MASK                                  0xFF00FFFFUL                               /**< Mask for USBAHB_DCFG                        */
#define _USBAHB_DCFG_DEVSPD_SHIFT                          0                                          /**< Shift value for USBAHB_DEVSPD               */
#define _USBAHB_DCFG_DEVSPD_MASK                           0x3UL                                      /**< Bit mask for USBAHB_DEVSPD                  */
#define _USBAHB_DCFG_DEVSPD_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_DEVSPD_DEFAULT                         (_USBAHB_DCFG_DEVSPD_DEFAULT << 0)         /**< Shifted mode DEFAULT for USBAHB_DCFG        */
#define USBAHB_DCFG_NZSTSOUTHSHK                           (0x1UL << 2)                               /**< NZ-Length Status OUT Handshake              */
#define _USBAHB_DCFG_NZSTSOUTHSHK_SHIFT                    2                                          /**< Shift value for USBAHB_NZSTSOUTHSHK         */
#define _USBAHB_DCFG_NZSTSOUTHSHK_MASK                     0x4UL                                      /**< Bit mask for USBAHB_NZSTSOUTHSHK            */
#define _USBAHB_DCFG_NZSTSOUTHSHK_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_NZSTSOUTHSHK_DEFAULT                   (_USBAHB_DCFG_NZSTSOUTHSHK_DEFAULT << 2)   /**< Shifted mode DEFAULT for USBAHB_DCFG        */
#define USBAHB_DCFG_ENA32KHZSUSP                           (0x1UL << 3)                               /**< Enable 32 KHz Suspend mode                  */
#define _USBAHB_DCFG_ENA32KHZSUSP_SHIFT                    3                                          /**< Shift value for USBAHB_ENA32KHZSUSP         */
#define _USBAHB_DCFG_ENA32KHZSUSP_MASK                     0x8UL                                      /**< Bit mask for USBAHB_ENA32KHZSUSP            */
#define _USBAHB_DCFG_ENA32KHZSUSP_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_ENA32KHZSUSP_DEFAULT                   (_USBAHB_DCFG_ENA32KHZSUSP_DEFAULT << 3)   /**< Shifted mode DEFAULT for USBAHB_DCFG        */
#define _USBAHB_DCFG_DEVADDR_SHIFT                         4                                          /**< Shift value for USBAHB_DEVADDR              */
#define _USBAHB_DCFG_DEVADDR_MASK                          0x7F0UL                                    /**< Bit mask for USBAHB_DEVADDR                 */
#define _USBAHB_DCFG_DEVADDR_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_DEVADDR_DEFAULT                        (_USBAHB_DCFG_DEVADDR_DEFAULT << 4)        /**< Shifted mode DEFAULT for USBAHB_DCFG        */
#define _USBAHB_DCFG_PERFRINT_SHIFT                        11                                         /**< Shift value for USBAHB_PERFRINT             */
#define _USBAHB_DCFG_PERFRINT_MASK                         0x1800UL                                   /**< Bit mask for USBAHB_PERFRINT                */
#define _USBAHB_DCFG_PERFRINT_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_PERFRINT_DEFAULT                       (_USBAHB_DCFG_PERFRINT_DEFAULT << 11)      /**< Shifted mode DEFAULT for USBAHB_DCFG        */
#define USBAHB_DCFG_ENDEVOUTNAK                            (0x1UL << 13)                              /**< Enable Device out of NAK                    */
#define _USBAHB_DCFG_ENDEVOUTNAK_SHIFT                     13                                         /**< Shift value for USBAHB_ENDEVOUTNAK          */
#define _USBAHB_DCFG_ENDEVOUTNAK_MASK                      0x2000UL                                   /**< Bit mask for USBAHB_ENDEVOUTNAK             */
#define _USBAHB_DCFG_ENDEVOUTNAK_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_ENDEVOUTNAK_DEFAULT                    (_USBAHB_DCFG_ENDEVOUTNAK_DEFAULT << 13)   /**< Shifted mode DEFAULT for USBAHB_DCFG        */
#define USBAHB_DCFG_XCVRDLY                                (0x1UL << 14)                              /**<                                             */
#define _USBAHB_DCFG_XCVRDLY_SHIFT                         14                                         /**< Shift value for USBAHB_XCVRDLY              */
#define _USBAHB_DCFG_XCVRDLY_MASK                          0x4000UL                                   /**< Bit mask for USBAHB_XCVRDLY                 */
#define _USBAHB_DCFG_XCVRDLY_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_XCVRDLY_DEFAULT                        (_USBAHB_DCFG_XCVRDLY_DEFAULT << 14)       /**< Shifted mode DEFAULT for USBAHB_DCFG        */
#define USBAHB_DCFG_ERRATICINTMSK                          (0x1UL << 15)                              /**<                                             */
#define _USBAHB_DCFG_ERRATICINTMSK_SHIFT                   15                                         /**< Shift value for USBAHB_ERRATICINTMSK        */
#define _USBAHB_DCFG_ERRATICINTMSK_MASK                    0x8000UL                                   /**< Bit mask for USBAHB_ERRATICINTMSK           */
#define _USBAHB_DCFG_ERRATICINTMSK_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_ERRATICINTMSK_DEFAULT                  (_USBAHB_DCFG_ERRATICINTMSK_DEFAULT << 15) /**< Shifted mode DEFAULT for USBAHB_DCFG        */
#define _USBAHB_DCFG_PERSCHINTVL_SHIFT                     24                                         /**< Shift value for USBAHB_PERSCHINTVL          */
#define _USBAHB_DCFG_PERSCHINTVL_MASK                      0x3000000UL                                /**< Bit mask for USBAHB_PERSCHINTVL             */
#define _USBAHB_DCFG_PERSCHINTVL_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_PERSCHINTVL_DEFAULT                    (_USBAHB_DCFG_PERSCHINTVL_DEFAULT << 24)   /**< Shifted mode DEFAULT for USBAHB_DCFG        */
#define _USBAHB_DCFG_RESVALID_SHIFT                        26                                         /**< Shift value for USBAHB_RESVALID             */
#define _USBAHB_DCFG_RESVALID_MASK                         0xFC000000UL                               /**< Bit mask for USBAHB_RESVALID                */
#define _USBAHB_DCFG_RESVALID_DEFAULT                      0x00000002UL                               /**< Mode DEFAULT for USBAHB_DCFG                */
#define USBAHB_DCFG_RESVALID_DEFAULT                       (_USBAHB_DCFG_RESVALID_DEFAULT << 26)      /**< Shifted mode DEFAULT for USBAHB_DCFG        */

/* Bit fields for USBAHB DCTL */
#define _USBAHB_DCTL_RESETVALUE                            0x00000002UL                              /**< Default value for USBAHB_DCTL               */
#define _USBAHB_DCTL_MASK                                  0x00018FFFUL                              /**< Mask for USBAHB_DCTL                        */
#define USBAHB_DCTL_RMTWKUPSIG                             (0x1UL << 0)                              /**< Remote Wakeup Signalling                    */
#define _USBAHB_DCTL_RMTWKUPSIG_SHIFT                      0                                         /**< Shift value for USBAHB_RMTWKUPSIG           */
#define _USBAHB_DCTL_RMTWKUPSIG_MASK                       0x1UL                                     /**< Bit mask for USBAHB_RMTWKUPSIG              */
#define _USBAHB_DCTL_RMTWKUPSIG_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_RMTWKUPSIG_DEFAULT                     (_USBAHB_DCTL_RMTWKUPSIG_DEFAULT << 0)    /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_SFTDISCON                              (0x1UL << 1)                              /**< Soft Disconnect                             */
#define _USBAHB_DCTL_SFTDISCON_SHIFT                       1                                         /**< Shift value for USBAHB_SFTDISCON            */
#define _USBAHB_DCTL_SFTDISCON_MASK                        0x2UL                                     /**< Bit mask for USBAHB_SFTDISCON               */
#define _USBAHB_DCTL_SFTDISCON_DEFAULT                     0x00000001UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_SFTDISCON_DEFAULT                      (_USBAHB_DCTL_SFTDISCON_DEFAULT << 1)     /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_GNPINNAKSTS                            (0x1UL << 2)                              /**< Global Non-periodic IN NAK Status           */
#define _USBAHB_DCTL_GNPINNAKSTS_SHIFT                     2                                         /**< Shift value for USBAHB_GNPINNAKSTS          */
#define _USBAHB_DCTL_GNPINNAKSTS_MASK                      0x4UL                                     /**< Bit mask for USBAHB_GNPINNAKSTS             */
#define _USBAHB_DCTL_GNPINNAKSTS_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_GNPINNAKSTS_DEFAULT                    (_USBAHB_DCTL_GNPINNAKSTS_DEFAULT << 2)   /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_GOUTNAKSTS                             (0x1UL << 3)                              /**< Global OUT NAK Status                       */
#define _USBAHB_DCTL_GOUTNAKSTS_SHIFT                      3                                         /**< Shift value for USBAHB_GOUTNAKSTS           */
#define _USBAHB_DCTL_GOUTNAKSTS_MASK                       0x8UL                                     /**< Bit mask for USBAHB_GOUTNAKSTS              */
#define _USBAHB_DCTL_GOUTNAKSTS_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_GOUTNAKSTS_DEFAULT                     (_USBAHB_DCTL_GOUTNAKSTS_DEFAULT << 3)    /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define _USBAHB_DCTL_TSTCTL_SHIFT                          4                                         /**< Shift value for USBAHB_TSTCTL               */
#define _USBAHB_DCTL_TSTCTL_MASK                           0x70UL                                    /**< Bit mask for USBAHB_TSTCTL                  */
#define _USBAHB_DCTL_TSTCTL_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_TSTCTL_DEFAULT                         (_USBAHB_DCTL_TSTCTL_DEFAULT << 4)        /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_SGNPINNAK                              (0x1UL << 7)                              /**< Set Global Non-periodic in NAK              */
#define _USBAHB_DCTL_SGNPINNAK_SHIFT                       7                                         /**< Shift value for USBAHB_SGNPINNAK            */
#define _USBAHB_DCTL_SGNPINNAK_MASK                        0x80UL                                    /**< Bit mask for USBAHB_SGNPINNAK               */
#define _USBAHB_DCTL_SGNPINNAK_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_SGNPINNAK_DEFAULT                      (_USBAHB_DCTL_SGNPINNAK_DEFAULT << 7)     /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_CGNPINNAK                              (0x1UL << 8)                              /**< Clear Global Non-periodic IN NAK            */
#define _USBAHB_DCTL_CGNPINNAK_SHIFT                       8                                         /**< Shift value for USBAHB_CGNPINNAK            */
#define _USBAHB_DCTL_CGNPINNAK_MASK                        0x100UL                                   /**< Bit mask for USBAHB_CGNPINNAK               */
#define _USBAHB_DCTL_CGNPINNAK_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_CGNPINNAK_DEFAULT                      (_USBAHB_DCTL_CGNPINNAK_DEFAULT << 8)     /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_SGOUTNAK                               (0x1UL << 9)                              /**< Set Global Out NAK                          */
#define _USBAHB_DCTL_SGOUTNAK_SHIFT                        9                                         /**< Shift value for USBAHB_SGOUTNAK             */
#define _USBAHB_DCTL_SGOUTNAK_MASK                         0x200UL                                   /**< Bit mask for USBAHB_SGOUTNAK                */
#define _USBAHB_DCTL_SGOUTNAK_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_SGOUTNAK_DEFAULT                       (_USBAHB_DCTL_SGOUTNAK_DEFAULT << 9)      /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_CGOUTNAK                               (0x1UL << 10)                             /**< Clear Global Out NAK                        */
#define _USBAHB_DCTL_CGOUTNAK_SHIFT                        10                                        /**< Shift value for USBAHB_CGOUTNAK             */
#define _USBAHB_DCTL_CGOUTNAK_MASK                         0x400UL                                   /**< Bit mask for USBAHB_CGOUTNAK                */
#define _USBAHB_DCTL_CGOUTNAK_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_CGOUTNAK_DEFAULT                       (_USBAHB_DCTL_CGOUTNAK_DEFAULT << 10)     /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_PWRONPRGDONE                           (0x1UL << 11)                             /**< Power-On Programming Done                   */
#define _USBAHB_DCTL_PWRONPRGDONE_SHIFT                    11                                        /**< Shift value for USBAHB_PWRONPRGDONE         */
#define _USBAHB_DCTL_PWRONPRGDONE_MASK                     0x800UL                                   /**< Bit mask for USBAHB_PWRONPRGDONE            */
#define _USBAHB_DCTL_PWRONPRGDONE_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_PWRONPRGDONE_DEFAULT                   (_USBAHB_DCTL_PWRONPRGDONE_DEFAULT << 11) /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_IGNRFRMNUM                             (0x1UL << 15)                             /**< Ignore frame num for ISO end points         */
#define _USBAHB_DCTL_IGNRFRMNUM_SHIFT                      15                                        /**< Shift value for USBAHB_IGNRFRMNUM           */
#define _USBAHB_DCTL_IGNRFRMNUM_MASK                       0x8000UL                                  /**< Bit mask for USBAHB_IGNRFRMNUM              */
#define _USBAHB_DCTL_IGNRFRMNUM_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_IGNRFRMNUM_DEFAULT                     (_USBAHB_DCTL_IGNRFRMNUM_DEFAULT << 15)   /**< Shifted mode DEFAULT for USBAHB_DCTL        */
#define USBAHB_DCTL_NAKONBBLE                              (0x1UL << 16)                             /**< NAK on Babble Error                         */
#define _USBAHB_DCTL_NAKONBBLE_SHIFT                       16                                        /**< Shift value for USBAHB_NAKONBBLE            */
#define _USBAHB_DCTL_NAKONBBLE_MASK                        0x10000UL                                 /**< Bit mask for USBAHB_NAKONBBLE               */
#define _USBAHB_DCTL_NAKONBBLE_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for USBAHB_DCTL                */
#define USBAHB_DCTL_NAKONBBLE_DEFAULT                      (_USBAHB_DCTL_NAKONBBLE_DEFAULT << 16)    /**< Shifted mode DEFAULT for USBAHB_DCTL        */

