espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DSTS */
#define _USBAHB_DSTS_RESETVALUE                            0x00000000UL                          /**< Default value for USBAHB_DSTS               */
#define _USBAHB_DSTS_MASK                                  0x00FFFF0FUL                          /**< Mask for USBAHB_DSTS                        */
#define USBAHB_DSTS_SUSPSTS                                (0x1UL << 0)                          /**< Suspend Status                              */
#define _USBAHB_DSTS_SUSPSTS_SHIFT                         0                                     /**< Shift value for USBAHB_SUSPSTS              */
#define _USBAHB_DSTS_SUSPSTS_MASK                          0x1UL                                 /**< Bit mask for USBAHB_SUSPSTS                 */
#define _USBAHB_DSTS_SUSPSTS_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for USBAHB_DSTS                */
#define USBAHB_DSTS_SUSPSTS_DEFAULT                        (_USBAHB_DSTS_SUSPSTS_DEFAULT << 0)   /**< Shifted mode DEFAULT for USBAHB_DSTS        */
#define _USBAHB_DSTS_ENUMSPD_SHIFT                         1                                     /**< Shift value for USBAHB_ENUMSPD              */
#define _USBAHB_DSTS_ENUMSPD_MASK                          0x6UL                                 /**< Bit mask for USBAHB_ENUMSPD                 */
#define _USBAHB_DSTS_ENUMSPD_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for USBAHB_DSTS                */
#define USBAHB_DSTS_ENUMSPD_DEFAULT                        (_USBAHB_DSTS_ENUMSPD_DEFAULT << 1)   /**< Shifted mode DEFAULT for USBAHB_DSTS        */
#define USBAHB_DSTS_ERRTICERR                              (0x1UL << 3)                          /**< Erratic Error                               */
#define _USBAHB_DSTS_ERRTICERR_SHIFT                       3                                     /**< Shift value for USBAHB_ERRTICERR            */
#define _USBAHB_DSTS_ERRTICERR_MASK                        0x8UL                                 /**< Bit mask for USBAHB_ERRTICERR               */
#define _USBAHB_DSTS_ERRTICERR_DEFAULT                     0x00000000UL                          /**< Mode DEFAULT for USBAHB_DSTS                */
#define USBAHB_DSTS_ERRTICERR_DEFAULT                      (_USBAHB_DSTS_ERRTICERR_DEFAULT << 3) /**< Shifted mode DEFAULT for USBAHB_DSTS        */
#define _USBAHB_DSTS_SOFFN_SHIFT                           8                                     /**< Shift value for USBAHB_SOFFN                */
#define _USBAHB_DSTS_SOFFN_MASK                            0x3FFF00UL                            /**< Bit mask for USBAHB_SOFFN                   */
#define _USBAHB_DSTS_SOFFN_DEFAULT                         0x00000000UL                          /**< Mode DEFAULT for USBAHB_DSTS                */
#define USBAHB_DSTS_SOFFN_DEFAULT                          (_USBAHB_DSTS_SOFFN_DEFAULT << 8)     /**< Shifted mode DEFAULT for USBAHB_DSTS        */
#define _USBAHB_DSTS_DEVLNSTS_SHIFT                        22                                    /**< Shift value for USBAHB_DEVLNSTS             */
#define _USBAHB_DSTS_DEVLNSTS_MASK                         0xC00000UL                            /**< Bit mask for USBAHB_DEVLNSTS                */
#define _USBAHB_DSTS_DEVLNSTS_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for USBAHB_DSTS                */
#define USBAHB_DSTS_DEVLNSTS_DEFAULT                       (_USBAHB_DSTS_DEVLNSTS_DEFAULT << 22) /**< Shifted mode DEFAULT for USBAHB_DSTS        */

/* Bit fields for USBAHB DIEPMSK */
#define _USBAHB_DIEPMSK_RESETVALUE                         0x00000000UL                                  /**< Default value for USBAHB_DIEPMSK            */
#define _USBAHB_DIEPMSK_MASK                               0x0000217FUL                                  /**< Mask for USBAHB_DIEPMSK                     */
#define USBAHB_DIEPMSK_XFERCOMPLMSK                        (0x1UL << 0)                                  /**< Transfer Completed Interrupt Mask           */
#define _USBAHB_DIEPMSK_XFERCOMPLMSK_SHIFT                 0                                             /**< Shift value for USBAHB_XFERCOMPLMSK         */
#define _USBAHB_DIEPMSK_XFERCOMPLMSK_MASK                  0x1UL                                         /**< Bit mask for USBAHB_XFERCOMPLMSK            */
#define _USBAHB_DIEPMSK_XFERCOMPLMSK_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DIEPMSK             */
#define USBAHB_DIEPMSK_XFERCOMPLMSK_DEFAULT                (_USBAHB_DIEPMSK_XFERCOMPLMSK_DEFAULT << 0)   /**< Shifted mode DEFAULT for USBAHB_DIEPMSK     */
#define USBAHB_DIEPMSK_EPDISBLDMSK                         (0x1UL << 1)                                  /**< Endpoint Disabled Interrupt Mask            */
#define _USBAHB_DIEPMSK_EPDISBLDMSK_SHIFT                  1                                             /**< Shift value for USBAHB_EPDISBLDMSK          */
#define _USBAHB_DIEPMSK_EPDISBLDMSK_MASK                   0x2UL                                         /**< Bit mask for USBAHB_EPDISBLDMSK             */
#define _USBAHB_DIEPMSK_EPDISBLDMSK_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DIEPMSK             */
#define USBAHB_DIEPMSK_EPDISBLDMSK_DEFAULT                 (_USBAHB_DIEPMSK_EPDISBLDMSK_DEFAULT << 1)    /**< Shifted mode DEFAULT for USBAHB_DIEPMSK     */
#define USBAHB_DIEPMSK_AHBERRMSK                           (0x1UL << 2)                                  /**< AHB Error Mask                              */
#define _USBAHB_DIEPMSK_AHBERRMSK_SHIFT                    2                                             /**< Shift value for USBAHB_AHBERRMSK            */
#define _USBAHB_DIEPMSK_AHBERRMSK_MASK                     0x4UL                                         /**< Bit mask for USBAHB_AHBERRMSK               */
#define _USBAHB_DIEPMSK_AHBERRMSK_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DIEPMSK             */
#define USBAHB_DIEPMSK_AHBERRMSK_DEFAULT                   (_USBAHB_DIEPMSK_AHBERRMSK_DEFAULT << 2)      /**< Shifted mode DEFAULT for USBAHB_DIEPMSK     */
#define USBAHB_DIEPMSK_TIMEOUTMSK                          (0x1UL << 3)                                  /**< Timout Condition Mask                       */
#define _USBAHB_DIEPMSK_TIMEOUTMSK_SHIFT                   3                                             /**< Shift value for USBAHB_TIMEOUTMSK           */
#define _USBAHB_DIEPMSK_TIMEOUTMSK_MASK                    0x8UL                                         /**< Bit mask for USBAHB_TIMEOUTMSK              */
#define _USBAHB_DIEPMSK_TIMEOUTMSK_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DIEPMSK             */
#define USBAHB_DIEPMSK_TIMEOUTMSK_DEFAULT                  (_USBAHB_DIEPMSK_TIMEOUTMSK_DEFAULT << 3)     /**< Shifted mode DEFAULT for USBAHB_DIEPMSK     */
#define USBAHB_DIEPMSK_INTKNTXFEMPMSK                      (0x1UL << 4)                                  /**< IN token recvd when FIFO mt irq mask        */
#define _USBAHB_DIEPMSK_INTKNTXFEMPMSK_SHIFT               4                                             /**< Shift value for USBAHB_INTKNTXFEMPMSK       */
#define _USBAHB_DIEPMSK_INTKNTXFEMPMSK_MASK                0x10UL                                        /**< Bit mask for USBAHB_INTKNTXFEMPMSK          */
#define _USBAHB_DIEPMSK_INTKNTXFEMPMSK_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DIEPMSK             */
#define USBAHB_DIEPMSK_INTKNTXFEMPMSK_DEFAULT              (_USBAHB_DIEPMSK_INTKNTXFEMPMSK_DEFAULT << 4) /**< Shifted mode DEFAULT for USBAHB_DIEPMSK     */
#define USBAHB_DIEPMSK_INTKNEPMISMSK                       (0x1UL << 5)                                  /**< IN Token recvd with EP Mismatch Mask        */
#define _USBAHB_DIEPMSK_INTKNEPMISMSK_SHIFT                5                                             /**< Shift value for USBAHB_INTKNEPMISMSK        */
#define _USBAHB_DIEPMSK_INTKNEPMISMSK_MASK                 0x20UL                                        /**< Bit mask for USBAHB_INTKNEPMISMSK           */
#define _USBAHB_DIEPMSK_INTKNEPMISMSK_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DIEPMSK             */
#define USBAHB_DIEPMSK_INTKNEPMISMSK_DEFAULT               (_USBAHB_DIEPMSK_INTKNEPMISMSK_DEFAULT << 5)  /**< Shifted mode DEFAULT for USBAHB_DIEPMSK     */
#define USBAHB_DIEPMSK_INEPNAKEFFMSK                       (0x1UL << 6)                                  /**< IN Endpoint NAK Effective Mask              */
#define _USBAHB_DIEPMSK_INEPNAKEFFMSK_SHIFT                6                                             /**< Shift value for USBAHB_INEPNAKEFFMSK        */
#define _USBAHB_DIEPMSK_INEPNAKEFFMSK_MASK                 0x40UL                                        /**< Bit mask for USBAHB_INEPNAKEFFMSK           */
#define _USBAHB_DIEPMSK_INEPNAKEFFMSK_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DIEPMSK             */
#define USBAHB_DIEPMSK_INEPNAKEFFMSK_DEFAULT               (_USBAHB_DIEPMSK_INEPNAKEFFMSK_DEFAULT << 6)  /**< Shifted mode DEFAULT for USBAHB_DIEPMSK     */
#define USBAHB_DIEPMSK_TXFIFOUNDRNMSK                      (0x1UL << 8)                                  /**< FIFO Underrun Mask                          */
#define _USBAHB_DIEPMSK_TXFIFOUNDRNMSK_SHIFT               8                                             /**< Shift value for USBAHB_TXFIFOUNDRNMSK       */
#define _USBAHB_DIEPMSK_TXFIFOUNDRNMSK_MASK                0x100UL                                       /**< Bit mask for USBAHB_TXFIFOUNDRNMSK          */
#define _USBAHB_DIEPMSK_TXFIFOUNDRNMSK_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DIEPMSK             */
#define USBAHB_DIEPMSK_TXFIFOUNDRNMSK_DEFAULT              (_USBAHB_DIEPMSK_TXFIFOUNDRNMSK_DEFAULT << 8) /**< Shifted mode DEFAULT for USBAHB_DIEPMSK     */
#define USBAHB_DIEPMSK_NAKMSK                              (0x1UL << 13)                                 /**< NAK interrupt Mask                          */
#define _USBAHB_DIEPMSK_NAKMSK_SHIFT                       13                                            /**< Shift value for USBAHB_NAKMSK               */
#define _USBAHB_DIEPMSK_NAKMSK_MASK                        0x2000UL                                      /**< Bit mask for USBAHB_NAKMSK                  */
#define _USBAHB_DIEPMSK_NAKMSK_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DIEPMSK             */
#define USBAHB_DIEPMSK_NAKMSK_DEFAULT                      (_USBAHB_DIEPMSK_NAKMSK_DEFAULT << 13)        /**< Shifted mode DEFAULT for USBAHB_DIEPMSK     */

