espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DOEPMSK */
#define _USBAHB_DOEPMSK_RESETVALUE                         0x00000000UL                                  /**< Default value for USBAHB_DOEPMSK            */
#define _USBAHB_DOEPMSK_MASK                               0x0000717FUL                                  /**< Mask for USBAHB_DOEPMSK                     */
#define USBAHB_DOEPMSK_XFERCOMPPLMSK                       (0x1UL << 0)                                  /**< Device OUT EP Common IRQ Mask Register      */
#define _USBAHB_DOEPMSK_XFERCOMPPLMSK_SHIFT                0                                             /**< Shift value for USBAHB_XFERCOMPPLMSK        */
#define _USBAHB_DOEPMSK_XFERCOMPPLMSK_MASK                 0x1UL                                         /**< Bit mask for USBAHB_XFERCOMPPLMSK           */
#define _USBAHB_DOEPMSK_XFERCOMPPLMSK_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_XFERCOMPPLMSK_DEFAULT               (_USBAHB_DOEPMSK_XFERCOMPPLMSK_DEFAULT << 0)  /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_EPDISBLDMSK                         (0x1UL << 1)                                  /**< Endpoint Disabled Interrupt Mask            */
#define _USBAHB_DOEPMSK_EPDISBLDMSK_SHIFT                  1                                             /**< Shift value for USBAHB_EPDISBLDMSK          */
#define _USBAHB_DOEPMSK_EPDISBLDMSK_MASK                   0x2UL                                         /**< Bit mask for USBAHB_EPDISBLDMSK             */
#define _USBAHB_DOEPMSK_EPDISBLDMSK_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_EPDISBLDMSK_DEFAULT                 (_USBAHB_DOEPMSK_EPDISBLDMSK_DEFAULT << 1)    /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_AHBERRMSK                           (0x1UL << 2)                                  /**< Ahb Error Mask                              */
#define _USBAHB_DOEPMSK_AHBERRMSK_SHIFT                    2                                             /**< Shift value for USBAHB_AHBERRMSK            */
#define _USBAHB_DOEPMSK_AHBERRMSK_MASK                     0x4UL                                         /**< Bit mask for USBAHB_AHBERRMSK               */
#define _USBAHB_DOEPMSK_AHBERRMSK_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_AHBERRMSK_DEFAULT                   (_USBAHB_DOEPMSK_AHBERRMSK_DEFAULT << 2)      /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_SETUPMSK                            (0x1UL << 3)                                  /**< Setup Phase Done Mask                       */
#define _USBAHB_DOEPMSK_SETUPMSK_SHIFT                     3                                             /**< Shift value for USBAHB_SETUPMSK             */
#define _USBAHB_DOEPMSK_SETUPMSK_MASK                      0x8UL                                         /**< Bit mask for USBAHB_SETUPMSK                */
#define _USBAHB_DOEPMSK_SETUPMSK_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_SETUPMSK_DEFAULT                    (_USBAHB_DOEPMSK_SETUPMSK_DEFAULT << 3)       /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_OUTTKNEPDISMSK                      (0x1UL << 4)                                  /**< OUT Token recvd when EP Disabled Mask       */
#define _USBAHB_DOEPMSK_OUTTKNEPDISMSK_SHIFT               4                                             /**< Shift value for USBAHB_OUTTKNEPDISMSK       */
#define _USBAHB_DOEPMSK_OUTTKNEPDISMSK_MASK                0x10UL                                        /**< Bit mask for USBAHB_OUTTKNEPDISMSK          */
#define _USBAHB_DOEPMSK_OUTTKNEPDISMSK_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_OUTTKNEPDISMSK_DEFAULT              (_USBAHB_DOEPMSK_OUTTKNEPDISMSK_DEFAULT << 4) /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_STSPHSERCVDMSK                      (0x1UL << 5)                                  /**< Status Phase Received Mask                  */
#define _USBAHB_DOEPMSK_STSPHSERCVDMSK_SHIFT               5                                             /**< Shift value for USBAHB_STSPHSERCVDMSK       */
#define _USBAHB_DOEPMSK_STSPHSERCVDMSK_MASK                0x20UL                                        /**< Bit mask for USBAHB_STSPHSERCVDMSK          */
#define _USBAHB_DOEPMSK_STSPHSERCVDMSK_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_STSPHSERCVDMSK_DEFAULT              (_USBAHB_DOEPMSK_STSPHSERCVDMSK_DEFAULT << 5) /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_BACK2BACKSETUP                      (0x1UL << 6)                                  /**< Back-to-Back SETUP Packets recvd Mask       */
#define _USBAHB_DOEPMSK_BACK2BACKSETUP_SHIFT               6                                             /**< Shift value for USBAHB_BACK2BACKSETUP       */
#define _USBAHB_DOEPMSK_BACK2BACKSETUP_MASK                0x40UL                                        /**< Bit mask for USBAHB_BACK2BACKSETUP          */
#define _USBAHB_DOEPMSK_BACK2BACKSETUP_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_BACK2BACKSETUP_DEFAULT              (_USBAHB_DOEPMSK_BACK2BACKSETUP_DEFAULT << 6) /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_OUTPKTERRMSK                        (0x1UL << 8)                                  /**< OUT Packet Error Mask                       */
#define _USBAHB_DOEPMSK_OUTPKTERRMSK_SHIFT                 8                                             /**< Shift value for USBAHB_OUTPKTERRMSK         */
#define _USBAHB_DOEPMSK_OUTPKTERRMSK_MASK                  0x100UL                                       /**< Bit mask for USBAHB_OUTPKTERRMSK            */
#define _USBAHB_DOEPMSK_OUTPKTERRMSK_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_OUTPKTERRMSK_DEFAULT                (_USBAHB_DOEPMSK_OUTPKTERRMSK_DEFAULT << 8)   /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_BBLEERRMSK                          (0x1UL << 12)                                 /**< Babble Error Interrupt Mask                 */
#define _USBAHB_DOEPMSK_BBLEERRMSK_SHIFT                   12                                            /**< Shift value for USBAHB_BBLEERRMSK           */
#define _USBAHB_DOEPMSK_BBLEERRMSK_MASK                    0x1000UL                                      /**< Bit mask for USBAHB_BBLEERRMSK              */
#define _USBAHB_DOEPMSK_BBLEERRMSK_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_BBLEERRMSK_DEFAULT                  (_USBAHB_DOEPMSK_BBLEERRMSK_DEFAULT << 12)    /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_NAKMSK                              (0x1UL << 13)                                 /**< NAK Interrupt Mask                          */
#define _USBAHB_DOEPMSK_NAKMSK_SHIFT                       13                                            /**< Shift value for USBAHB_NAKMSK               */
#define _USBAHB_DOEPMSK_NAKMSK_MASK                        0x2000UL                                      /**< Bit mask for USBAHB_NAKMSK                  */
#define _USBAHB_DOEPMSK_NAKMSK_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_NAKMSK_DEFAULT                      (_USBAHB_DOEPMSK_NAKMSK_DEFAULT << 13)        /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */
#define USBAHB_DOEPMSK_NYETMSK                             (0x1UL << 14)                                 /**< NYET Interrupt Mask                         */
#define _USBAHB_DOEPMSK_NYETMSK_SHIFT                      14                                            /**< Shift value for USBAHB_NYETMSK              */
#define _USBAHB_DOEPMSK_NYETMSK_MASK                       0x4000UL                                      /**< Bit mask for USBAHB_NYETMSK                 */
#define _USBAHB_DOEPMSK_NYETMSK_DEFAULT                    0x00000000UL                                  /**< Mode DEFAULT for USBAHB_DOEPMSK             */
#define USBAHB_DOEPMSK_NYETMSK_DEFAULT                     (_USBAHB_DOEPMSK_NYETMSK_DEFAULT << 14)       /**< Shifted mode DEFAULT for USBAHB_DOEPMSK     */

