espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DAINT */
#define _USBAHB_DAINT_RESETVALUE                           0x00000000UL                            /**< Default value for USBAHB_DAINT              */
#define _USBAHB_DAINT_MASK                                 0x03FF03FFUL                            /**< Mask for USBAHB_DAINT                       */
#define USBAHB_DAINT_INEPINT0                              (0x1UL << 0)                            /**< EP0 IRQ                                     */
#define _USBAHB_DAINT_INEPINT0_SHIFT                       0                                       /**< Shift value for USBAHB_INEPINT0             */
#define _USBAHB_DAINT_INEPINT0_MASK                        0x1UL                                   /**< Bit mask for USBAHB_INEPINT0                */
#define _USBAHB_DAINT_INEPINT0_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT0_DEFAULT                      (_USBAHB_DAINT_INEPINT0_DEFAULT << 0)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_INEPINT1                              (0x1UL << 1)                            /**< EP1 IRQ                                     */
#define _USBAHB_DAINT_INEPINT1_SHIFT                       1                                       /**< Shift value for USBAHB_INEPINT1             */
#define _USBAHB_DAINT_INEPINT1_MASK                        0x2UL                                   /**< Bit mask for USBAHB_INEPINT1                */
#define _USBAHB_DAINT_INEPINT1_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT1_DEFAULT                      (_USBAHB_DAINT_INEPINT1_DEFAULT << 1)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_INEPINT2                              (0x1UL << 2)                            /**< EP2 IRQ                                     */
#define _USBAHB_DAINT_INEPINT2_SHIFT                       2                                       /**< Shift value for USBAHB_INEPINT2             */
#define _USBAHB_DAINT_INEPINT2_MASK                        0x4UL                                   /**< Bit mask for USBAHB_INEPINT2                */
#define _USBAHB_DAINT_INEPINT2_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT2_DEFAULT                      (_USBAHB_DAINT_INEPINT2_DEFAULT << 2)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_INEPINT3                              (0x1UL << 3)                            /**< EP3 IRQ                                     */
#define _USBAHB_DAINT_INEPINT3_SHIFT                       3                                       /**< Shift value for USBAHB_INEPINT3             */
#define _USBAHB_DAINT_INEPINT3_MASK                        0x8UL                                   /**< Bit mask for USBAHB_INEPINT3                */
#define _USBAHB_DAINT_INEPINT3_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT3_DEFAULT                      (_USBAHB_DAINT_INEPINT3_DEFAULT << 3)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_INEPINT4                              (0x1UL << 4)                            /**< EP4 IRQ                                     */
#define _USBAHB_DAINT_INEPINT4_SHIFT                       4                                       /**< Shift value for USBAHB_INEPINT4             */
#define _USBAHB_DAINT_INEPINT4_MASK                        0x10UL                                  /**< Bit mask for USBAHB_INEPINT4                */
#define _USBAHB_DAINT_INEPINT4_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT4_DEFAULT                      (_USBAHB_DAINT_INEPINT4_DEFAULT << 4)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_INEPINT5                              (0x1UL << 5)                            /**< EP5 IRQ                                     */
#define _USBAHB_DAINT_INEPINT5_SHIFT                       5                                       /**< Shift value for USBAHB_INEPINT5             */
#define _USBAHB_DAINT_INEPINT5_MASK                        0x20UL                                  /**< Bit mask for USBAHB_INEPINT5                */
#define _USBAHB_DAINT_INEPINT5_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT5_DEFAULT                      (_USBAHB_DAINT_INEPINT5_DEFAULT << 5)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_INEPINT6                              (0x1UL << 6)                            /**< EP6 IRQ                                     */
#define _USBAHB_DAINT_INEPINT6_SHIFT                       6                                       /**< Shift value for USBAHB_INEPINT6             */
#define _USBAHB_DAINT_INEPINT6_MASK                        0x40UL                                  /**< Bit mask for USBAHB_INEPINT6                */
#define _USBAHB_DAINT_INEPINT6_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT6_DEFAULT                      (_USBAHB_DAINT_INEPINT6_DEFAULT << 6)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_INEPINT7                              (0x1UL << 7)                            /**< EP7 IRQ                                     */
#define _USBAHB_DAINT_INEPINT7_SHIFT                       7                                       /**< Shift value for USBAHB_INEPINT7             */
#define _USBAHB_DAINT_INEPINT7_MASK                        0x80UL                                  /**< Bit mask for USBAHB_INEPINT7                */
#define _USBAHB_DAINT_INEPINT7_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT7_DEFAULT                      (_USBAHB_DAINT_INEPINT7_DEFAULT << 7)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_INEPINT8                              (0x1UL << 8)                            /**< EP8 IRQ                                     */
#define _USBAHB_DAINT_INEPINT8_SHIFT                       8                                       /**< Shift value for USBAHB_INEPINT8             */
#define _USBAHB_DAINT_INEPINT8_MASK                        0x100UL                                 /**< Bit mask for USBAHB_INEPINT8                */
#define _USBAHB_DAINT_INEPINT8_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT8_DEFAULT                      (_USBAHB_DAINT_INEPINT8_DEFAULT << 8)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_INEPINT9                              (0x1UL << 9)                            /**< EP9 IRQ                                     */
#define _USBAHB_DAINT_INEPINT9_SHIFT                       9                                       /**< Shift value for USBAHB_INEPINT9             */
#define _USBAHB_DAINT_INEPINT9_MASK                        0x200UL                                 /**< Bit mask for USBAHB_INEPINT9                */
#define _USBAHB_DAINT_INEPINT9_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_INEPINT9_DEFAULT                      (_USBAHB_DAINT_INEPINT9_DEFAULT << 9)   /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT0                             (0x1UL << 16)                           /**< EP0 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT0_SHIFT                      16                                      /**< Shift value for USBAHB_OUTEPINT0            */
#define _USBAHB_DAINT_OUTEPINT0_MASK                       0x10000UL                               /**< Bit mask for USBAHB_OUTEPINT0               */
#define _USBAHB_DAINT_OUTEPINT0_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT0_DEFAULT                     (_USBAHB_DAINT_OUTEPINT0_DEFAULT << 16) /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT1                             (0x1UL << 17)                           /**< EP1 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT1_SHIFT                      17                                      /**< Shift value for USBAHB_OUTEPINT1            */
#define _USBAHB_DAINT_OUTEPINT1_MASK                       0x20000UL                               /**< Bit mask for USBAHB_OUTEPINT1               */
#define _USBAHB_DAINT_OUTEPINT1_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT1_DEFAULT                     (_USBAHB_DAINT_OUTEPINT1_DEFAULT << 17) /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT2                             (0x1UL << 18)                           /**< EP2 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT2_SHIFT                      18                                      /**< Shift value for USBAHB_OUTEPINT2            */
#define _USBAHB_DAINT_OUTEPINT2_MASK                       0x40000UL                               /**< Bit mask for USBAHB_OUTEPINT2               */
#define _USBAHB_DAINT_OUTEPINT2_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT2_DEFAULT                     (_USBAHB_DAINT_OUTEPINT2_DEFAULT << 18) /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT3                             (0x1UL << 19)                           /**< EP3 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT3_SHIFT                      19                                      /**< Shift value for USBAHB_OUTEPINT3            */
#define _USBAHB_DAINT_OUTEPINT3_MASK                       0x80000UL                               /**< Bit mask for USBAHB_OUTEPINT3               */
#define _USBAHB_DAINT_OUTEPINT3_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT3_DEFAULT                     (_USBAHB_DAINT_OUTEPINT3_DEFAULT << 19) /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT4                             (0x1UL << 20)                           /**< EP4 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT4_SHIFT                      20                                      /**< Shift value for USBAHB_OUTEPINT4            */
#define _USBAHB_DAINT_OUTEPINT4_MASK                       0x100000UL                              /**< Bit mask for USBAHB_OUTEPINT4               */
#define _USBAHB_DAINT_OUTEPINT4_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT4_DEFAULT                     (_USBAHB_DAINT_OUTEPINT4_DEFAULT << 20) /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT5                             (0x1UL << 21)                           /**< EP5 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT5_SHIFT                      21                                      /**< Shift value for USBAHB_OUTEPINT5            */
#define _USBAHB_DAINT_OUTEPINT5_MASK                       0x200000UL                              /**< Bit mask for USBAHB_OUTEPINT5               */
#define _USBAHB_DAINT_OUTEPINT5_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT5_DEFAULT                     (_USBAHB_DAINT_OUTEPINT5_DEFAULT << 21) /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT6                             (0x1UL << 22)                           /**< EP6 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT6_SHIFT                      22                                      /**< Shift value for USBAHB_OUTEPINT6            */
#define _USBAHB_DAINT_OUTEPINT6_MASK                       0x400000UL                              /**< Bit mask for USBAHB_OUTEPINT6               */
#define _USBAHB_DAINT_OUTEPINT6_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT6_DEFAULT                     (_USBAHB_DAINT_OUTEPINT6_DEFAULT << 22) /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT7                             (0x1UL << 23)                           /**< EP7 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT7_SHIFT                      23                                      /**< Shift value for USBAHB_OUTEPINT7            */
#define _USBAHB_DAINT_OUTEPINT7_MASK                       0x800000UL                              /**< Bit mask for USBAHB_OUTEPINT7               */
#define _USBAHB_DAINT_OUTEPINT7_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT7_DEFAULT                     (_USBAHB_DAINT_OUTEPINT7_DEFAULT << 23) /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT8                             (0x1UL << 24)                           /**< EP8 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT8_SHIFT                      24                                      /**< Shift value for USBAHB_OUTEPINT8            */
#define _USBAHB_DAINT_OUTEPINT8_MASK                       0x1000000UL                             /**< Bit mask for USBAHB_OUTEPINT8               */
#define _USBAHB_DAINT_OUTEPINT8_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT8_DEFAULT                     (_USBAHB_DAINT_OUTEPINT8_DEFAULT << 24) /**< Shifted mode DEFAULT for USBAHB_DAINT       */
#define USBAHB_DAINT_OUTEPINT9                             (0x1UL << 25)                           /**< EP9 OUT IRQ                                 */
#define _USBAHB_DAINT_OUTEPINT9_SHIFT                      25                                      /**< Shift value for USBAHB_OUTEPINT9            */
#define _USBAHB_DAINT_OUTEPINT9_MASK                       0x2000000UL                             /**< Bit mask for USBAHB_OUTEPINT9               */
#define _USBAHB_DAINT_OUTEPINT9_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for USBAHB_DAINT               */
#define USBAHB_DAINT_OUTEPINT9_DEFAULT                     (_USBAHB_DAINT_OUTEPINT9_DEFAULT << 25) /**< Shifted mode DEFAULT for USBAHB_DAINT       */

