espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DAINTMSK */
#define _USBAHB_DAINTMSK_RESETVALUE                        0x00000000UL                               /**< Default value for USBAHB_DAINTMSK           */
#define _USBAHB_DAINTMSK_MASK                              0x03FF03FFUL                               /**< Mask for USBAHB_DAINTMSK                    */
#define USBAHB_DAINTMSK_INEPMSK0                           (0x1UL << 0)                               /**< IN EP MASK0                                 */
#define _USBAHB_DAINTMSK_INEPMSK0_SHIFT                    0                                          /**< Shift value for USBAHB_INEPMSK0             */
#define _USBAHB_DAINTMSK_INEPMSK0_MASK                     0x1UL                                      /**< Bit mask for USBAHB_INEPMSK0                */
#define _USBAHB_DAINTMSK_INEPMSK0_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK0_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK0_DEFAULT << 0)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_INEPMSK1                           (0x1UL << 1)                               /**< IN EP MASK1                                 */
#define _USBAHB_DAINTMSK_INEPMSK1_SHIFT                    1                                          /**< Shift value for USBAHB_INEPMSK1             */
#define _USBAHB_DAINTMSK_INEPMSK1_MASK                     0x2UL                                      /**< Bit mask for USBAHB_INEPMSK1                */
#define _USBAHB_DAINTMSK_INEPMSK1_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK1_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK1_DEFAULT << 1)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_INEPMSK2                           (0x1UL << 2)                               /**< IN EP MASK2                                 */
#define _USBAHB_DAINTMSK_INEPMSK2_SHIFT                    2                                          /**< Shift value for USBAHB_INEPMSK2             */
#define _USBAHB_DAINTMSK_INEPMSK2_MASK                     0x4UL                                      /**< Bit mask for USBAHB_INEPMSK2                */
#define _USBAHB_DAINTMSK_INEPMSK2_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK2_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK2_DEFAULT << 2)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_INEPMSK3                           (0x1UL << 3)                               /**< IN EP MASK3                                 */
#define _USBAHB_DAINTMSK_INEPMSK3_SHIFT                    3                                          /**< Shift value for USBAHB_INEPMSK3             */
#define _USBAHB_DAINTMSK_INEPMSK3_MASK                     0x8UL                                      /**< Bit mask for USBAHB_INEPMSK3                */
#define _USBAHB_DAINTMSK_INEPMSK3_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK3_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK3_DEFAULT << 3)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_INEPMSK4                           (0x1UL << 4)                               /**< IN EP MASK4                                 */
#define _USBAHB_DAINTMSK_INEPMSK4_SHIFT                    4                                          /**< Shift value for USBAHB_INEPMSK4             */
#define _USBAHB_DAINTMSK_INEPMSK4_MASK                     0x10UL                                     /**< Bit mask for USBAHB_INEPMSK4                */
#define _USBAHB_DAINTMSK_INEPMSK4_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK4_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK4_DEFAULT << 4)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_INEPMSK5                           (0x1UL << 5)                               /**< IN EP MASK5                                 */
#define _USBAHB_DAINTMSK_INEPMSK5_SHIFT                    5                                          /**< Shift value for USBAHB_INEPMSK5             */
#define _USBAHB_DAINTMSK_INEPMSK5_MASK                     0x20UL                                     /**< Bit mask for USBAHB_INEPMSK5                */
#define _USBAHB_DAINTMSK_INEPMSK5_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK5_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK5_DEFAULT << 5)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_INEPMSK6                           (0x1UL << 6)                               /**< IN EP MASK6                                 */
#define _USBAHB_DAINTMSK_INEPMSK6_SHIFT                    6                                          /**< Shift value for USBAHB_INEPMSK6             */
#define _USBAHB_DAINTMSK_INEPMSK6_MASK                     0x40UL                                     /**< Bit mask for USBAHB_INEPMSK6                */
#define _USBAHB_DAINTMSK_INEPMSK6_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK6_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK6_DEFAULT << 6)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_INEPMSK7                           (0x1UL << 7)                               /**< IN EP MASK7                                 */
#define _USBAHB_DAINTMSK_INEPMSK7_SHIFT                    7                                          /**< Shift value for USBAHB_INEPMSK7             */
#define _USBAHB_DAINTMSK_INEPMSK7_MASK                     0x80UL                                     /**< Bit mask for USBAHB_INEPMSK7                */
#define _USBAHB_DAINTMSK_INEPMSK7_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK7_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK7_DEFAULT << 7)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_INEPMSK8                           (0x1UL << 8)                               /**< IN EP MASK8                                 */
#define _USBAHB_DAINTMSK_INEPMSK8_SHIFT                    8                                          /**< Shift value for USBAHB_INEPMSK8             */
#define _USBAHB_DAINTMSK_INEPMSK8_MASK                     0x100UL                                    /**< Bit mask for USBAHB_INEPMSK8                */
#define _USBAHB_DAINTMSK_INEPMSK8_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK8_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK8_DEFAULT << 8)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_INEPMSK9                           (0x1UL << 9)                               /**< IN EP MASK9                                 */
#define _USBAHB_DAINTMSK_INEPMSK9_SHIFT                    9                                          /**< Shift value for USBAHB_INEPMSK9             */
#define _USBAHB_DAINTMSK_INEPMSK9_MASK                     0x200UL                                    /**< Bit mask for USBAHB_INEPMSK9                */
#define _USBAHB_DAINTMSK_INEPMSK9_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_INEPMSK9_DEFAULT                   (_USBAHB_DAINTMSK_INEPMSK9_DEFAULT << 9)   /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK0                          (0x1UL << 16)                              /**< OUT EP MASK0                                */
#define _USBAHB_DAINTMSK_OUTEPMSK0_SHIFT                   16                                         /**< Shift value for USBAHB_OUTEPMSK0            */
#define _USBAHB_DAINTMSK_OUTEPMSK0_MASK                    0x10000UL                                  /**< Bit mask for USBAHB_OUTEPMSK0               */
#define _USBAHB_DAINTMSK_OUTEPMSK0_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK0_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK0_DEFAULT << 16) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK1                          (0x1UL << 17)                              /**< OUT EP MASK1                                */
#define _USBAHB_DAINTMSK_OUTEPMSK1_SHIFT                   17                                         /**< Shift value for USBAHB_OUTEPMSK1            */
#define _USBAHB_DAINTMSK_OUTEPMSK1_MASK                    0x20000UL                                  /**< Bit mask for USBAHB_OUTEPMSK1               */
#define _USBAHB_DAINTMSK_OUTEPMSK1_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK1_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK1_DEFAULT << 17) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK2                          (0x1UL << 18)                              /**< OUT EP MASK2                                */
#define _USBAHB_DAINTMSK_OUTEPMSK2_SHIFT                   18                                         /**< Shift value for USBAHB_OUTEPMSK2            */
#define _USBAHB_DAINTMSK_OUTEPMSK2_MASK                    0x40000UL                                  /**< Bit mask for USBAHB_OUTEPMSK2               */
#define _USBAHB_DAINTMSK_OUTEPMSK2_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK2_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK2_DEFAULT << 18) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK3                          (0x1UL << 19)                              /**< OUT EP MASK3                                */
#define _USBAHB_DAINTMSK_OUTEPMSK3_SHIFT                   19                                         /**< Shift value for USBAHB_OUTEPMSK3            */
#define _USBAHB_DAINTMSK_OUTEPMSK3_MASK                    0x80000UL                                  /**< Bit mask for USBAHB_OUTEPMSK3               */
#define _USBAHB_DAINTMSK_OUTEPMSK3_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK3_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK3_DEFAULT << 19) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK4                          (0x1UL << 20)                              /**< OUT EP MASK4                                */
#define _USBAHB_DAINTMSK_OUTEPMSK4_SHIFT                   20                                         /**< Shift value for USBAHB_OUTEPMSK4            */
#define _USBAHB_DAINTMSK_OUTEPMSK4_MASK                    0x100000UL                                 /**< Bit mask for USBAHB_OUTEPMSK4               */
#define _USBAHB_DAINTMSK_OUTEPMSK4_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK4_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK4_DEFAULT << 20) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK5                          (0x1UL << 21)                              /**< OUT EP MASK5                                */
#define _USBAHB_DAINTMSK_OUTEPMSK5_SHIFT                   21                                         /**< Shift value for USBAHB_OUTEPMSK5            */
#define _USBAHB_DAINTMSK_OUTEPMSK5_MASK                    0x200000UL                                 /**< Bit mask for USBAHB_OUTEPMSK5               */
#define _USBAHB_DAINTMSK_OUTEPMSK5_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK5_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK5_DEFAULT << 21) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK6                          (0x1UL << 22)                              /**< OUT EP MASK6                                */
#define _USBAHB_DAINTMSK_OUTEPMSK6_SHIFT                   22                                         /**< Shift value for USBAHB_OUTEPMSK6            */
#define _USBAHB_DAINTMSK_OUTEPMSK6_MASK                    0x400000UL                                 /**< Bit mask for USBAHB_OUTEPMSK6               */
#define _USBAHB_DAINTMSK_OUTEPMSK6_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK6_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK6_DEFAULT << 22) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK7                          (0x1UL << 23)                              /**< OUT EP MASK7                                */
#define _USBAHB_DAINTMSK_OUTEPMSK7_SHIFT                   23                                         /**< Shift value for USBAHB_OUTEPMSK7            */
#define _USBAHB_DAINTMSK_OUTEPMSK7_MASK                    0x800000UL                                 /**< Bit mask for USBAHB_OUTEPMSK7               */
#define _USBAHB_DAINTMSK_OUTEPMSK7_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK7_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK7_DEFAULT << 23) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK8                          (0x1UL << 24)                              /**< OUT EP MASK8                                */
#define _USBAHB_DAINTMSK_OUTEPMSK8_SHIFT                   24                                         /**< Shift value for USBAHB_OUTEPMSK8            */
#define _USBAHB_DAINTMSK_OUTEPMSK8_MASK                    0x1000000UL                                /**< Bit mask for USBAHB_OUTEPMSK8               */
#define _USBAHB_DAINTMSK_OUTEPMSK8_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK8_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK8_DEFAULT << 24) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */
#define USBAHB_DAINTMSK_OUTEPMSK9                          (0x1UL << 25)                              /**< OUT EP MASK9                                */
#define _USBAHB_DAINTMSK_OUTEPMSK9_SHIFT                   25                                         /**< Shift value for USBAHB_OUTEPMSK9            */
#define _USBAHB_DAINTMSK_OUTEPMSK9_MASK                    0x2000000UL                                /**< Bit mask for USBAHB_OUTEPMSK9               */
#define _USBAHB_DAINTMSK_OUTEPMSK9_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for USBAHB_DAINTMSK            */
#define USBAHB_DAINTMSK_OUTEPMSK9_DEFAULT                  (_USBAHB_DAINTMSK_OUTEPMSK9_DEFAULT << 25) /**< Shifted mode DEFAULT for USBAHB_DAINTMSK    */

/* Bit fields for USBAHB DTHRCTL */
#define _USBAHB_DTHRCTL_RESETVALUE                         0x08100020UL                                /**< Default value for USBAHB_DTHRCTL            */
#define _USBAHB_DTHRCTL_MASK                               0x0BFF1FFFUL                                /**< Mask for USBAHB_DTHRCTL                     */
#define USBAHB_DTHRCTL_NONISOTHREN                         (0x1UL << 0)                                /**< Non-ISO IN EP Threshold Enable              */
#define _USBAHB_DTHRCTL_NONISOTHREN_SHIFT                  0                                           /**< Shift value for USBAHB_NONISOTHREN          */
#define _USBAHB_DTHRCTL_NONISOTHREN_MASK                   0x1UL                                       /**< Bit mask for USBAHB_NONISOTHREN             */
#define _USBAHB_DTHRCTL_NONISOTHREN_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for USBAHB_DTHRCTL             */
#define USBAHB_DTHRCTL_NONISOTHREN_DEFAULT                 (_USBAHB_DTHRCTL_NONISOTHREN_DEFAULT << 0)  /**< Shifted mode DEFAULT for USBAHB_DTHRCTL     */
#define USBAHB_DTHRCTL_ISOTHREN                            (0x1UL << 1)                                /**< ISO IN EP Threshold Enable                  */
#define _USBAHB_DTHRCTL_ISOTHREN_SHIFT                     1                                           /**< Shift value for USBAHB_ISOTHREN             */
#define _USBAHB_DTHRCTL_ISOTHREN_MASK                      0x2UL                                       /**< Bit mask for USBAHB_ISOTHREN                */
#define _USBAHB_DTHRCTL_ISOTHREN_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for USBAHB_DTHRCTL             */
#define USBAHB_DTHRCTL_ISOTHREN_DEFAULT                    (_USBAHB_DTHRCTL_ISOTHREN_DEFAULT << 1)     /**< Shifted mode DEFAULT for USBAHB_DTHRCTL     */
#define _USBAHB_DTHRCTL_TXTHRLEN_SHIFT                     2                                           /**< Shift value for USBAHB_TXTHRLEN             */
#define _USBAHB_DTHRCTL_TXTHRLEN_MASK                      0x7FCUL                                     /**< Bit mask for USBAHB_TXTHRLEN                */
#define _USBAHB_DTHRCTL_TXTHRLEN_DEFAULT                   0x00000008UL                                /**< Mode DEFAULT for USBAHB_DTHRCTL             */
#define USBAHB_DTHRCTL_TXTHRLEN_DEFAULT                    (_USBAHB_DTHRCTL_TXTHRLEN_DEFAULT << 2)     /**< Shifted mode DEFAULT for USBAHB_DTHRCTL     */
#define _USBAHB_DTHRCTL_AHBTHRRATIO_SHIFT                  11                                          /**< Shift value for USBAHB_AHBTHRRATIO          */
#define _USBAHB_DTHRCTL_AHBTHRRATIO_MASK                   0x1800UL                                    /**< Bit mask for USBAHB_AHBTHRRATIO             */
#define _USBAHB_DTHRCTL_AHBTHRRATIO_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for USBAHB_DTHRCTL             */
#define USBAHB_DTHRCTL_AHBTHRRATIO_DEFAULT                 (_USBAHB_DTHRCTL_AHBTHRRATIO_DEFAULT << 11) /**< Shifted mode DEFAULT for USBAHB_DTHRCTL     */
#define USBAHB_DTHRCTL_RXTHREN                             (0x1UL << 16)                               /**< Receive Threshold Enable                    */
#define _USBAHB_DTHRCTL_RXTHREN_SHIFT                      16                                          /**< Shift value for USBAHB_RXTHREN              */
#define _USBAHB_DTHRCTL_RXTHREN_MASK                       0x10000UL                                   /**< Bit mask for USBAHB_RXTHREN                 */
#define _USBAHB_DTHRCTL_RXTHREN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for USBAHB_DTHRCTL             */
#define USBAHB_DTHRCTL_RXTHREN_DEFAULT                     (_USBAHB_DTHRCTL_RXTHREN_DEFAULT << 16)     /**< Shifted mode DEFAULT for USBAHB_DTHRCTL     */
#define _USBAHB_DTHRCTL_RXTHRLEN_SHIFT                     17                                          /**< Shift value for USBAHB_RXTHRLEN             */
#define _USBAHB_DTHRCTL_RXTHRLEN_MASK                      0x3FE0000UL                                 /**< Bit mask for USBAHB_RXTHRLEN                */
#define _USBAHB_DTHRCTL_RXTHRLEN_DEFAULT                   0x00000008UL                                /**< Mode DEFAULT for USBAHB_DTHRCTL             */
#define USBAHB_DTHRCTL_RXTHRLEN_DEFAULT                    (_USBAHB_DTHRCTL_RXTHRLEN_DEFAULT << 17)    /**< Shifted mode DEFAULT for USBAHB_DTHRCTL     */
#define USBAHB_DTHRCTL_ARBPRKEN                            (0x1UL << 27)                               /**< Arbiter Parking Enable                      */
#define _USBAHB_DTHRCTL_ARBPRKEN_SHIFT                     27                                          /**< Shift value for USBAHB_ARBPRKEN             */
#define _USBAHB_DTHRCTL_ARBPRKEN_MASK                      0x8000000UL                                 /**< Bit mask for USBAHB_ARBPRKEN                */
#define _USBAHB_DTHRCTL_ARBPRKEN_DEFAULT                   0x00000001UL                                /**< Mode DEFAULT for USBAHB_DTHRCTL             */
#define USBAHB_DTHRCTL_ARBPRKEN_DEFAULT                    (_USBAHB_DTHRCTL_ARBPRKEN_DEFAULT << 27)    /**< Shifted mode DEFAULT for USBAHB_DTHRCTL     */

