espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DIEPEMPMSK */
#define _USBAHB_DIEPEMPMSK_RESETVALUE                      0x00000000UL                                /**< Default value for USBAHB_DIEPEMPMSK         */
#define _USBAHB_DIEPEMPMSK_MASK                            0x0000FFFFUL                                /**< Mask for USBAHB_DIEPEMPMSK                  */
#define _USBAHB_DIEPEMPMSK_DIEPMPMSK_SHIFT                 0                                           /**< Shift value for USBAHB_DIEPMPMSK            */
#define _USBAHB_DIEPEMPMSK_DIEPMPMSK_MASK                  0xFFFFUL                                    /**< Bit mask for USBAHB_DIEPMPMSK               */
#define _USBAHB_DIEPEMPMSK_DIEPMPMSK_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEPEMPMSK          */
#define USBAHB_DIEPEMPMSK_DIEPMPMSK_DEFAULT                (_USBAHB_DIEPEMPMSK_DIEPMPMSK_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEPEMPMSK  */

/* Bit fields for USBAHB DIEP0CTL */
#define _USBAHB_DIEP0CTL_RESETVALUE                        0x00008000UL                              /**< Default value for USBAHB_DIEP0CTL           */
#define _USBAHB_DIEP0CTL_MASK                              0xCFEE8003UL                              /**< Mask for USBAHB_DIEP0CTL                    */
#define _USBAHB_DIEP0CTL_MPS_SHIFT                         0                                         /**< Shift value for USBAHB_MPS                  */
#define _USBAHB_DIEP0CTL_MPS_MASK                          0x3UL                                     /**< Bit mask for USBAHB_MPS                     */
#define _USBAHB_DIEP0CTL_MPS_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_MPS_DEFAULT                        (_USBAHB_DIEP0CTL_MPS_DEFAULT << 0)       /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */
#define USBAHB_DIEP0CTL_USBACTEP                           (0x1UL << 15)                             /**< USB Active Endpoint                         */
#define _USBAHB_DIEP0CTL_USBACTEP_SHIFT                    15                                        /**< Shift value for USBAHB_USBACTEP             */
#define _USBAHB_DIEP0CTL_USBACTEP_MASK                     0x8000UL                                  /**< Bit mask for USBAHB_USBACTEP                */
#define _USBAHB_DIEP0CTL_USBACTEP_DEFAULT                  0x00000001UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_USBACTEP_DEFAULT                   (_USBAHB_DIEP0CTL_USBACTEP_DEFAULT << 15) /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */
#define USBAHB_DIEP0CTL_NAKSTS                             (0x1UL << 17)                             /**< NAK Status                                  */
#define _USBAHB_DIEP0CTL_NAKSTS_SHIFT                      17                                        /**< Shift value for USBAHB_NAKSTS               */
#define _USBAHB_DIEP0CTL_NAKSTS_MASK                       0x20000UL                                 /**< Bit mask for USBAHB_NAKSTS                  */
#define _USBAHB_DIEP0CTL_NAKSTS_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_NAKSTS_DEFAULT                     (_USBAHB_DIEP0CTL_NAKSTS_DEFAULT << 17)   /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */
#define _USBAHB_DIEP0CTL_EPTYPE_SHIFT                      18                                        /**< Shift value for USBAHB_EPTYPE               */
#define _USBAHB_DIEP0CTL_EPTYPE_MASK                       0xC0000UL                                 /**< Bit mask for USBAHB_EPTYPE                  */
#define _USBAHB_DIEP0CTL_EPTYPE_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_EPTYPE_DEFAULT                     (_USBAHB_DIEP0CTL_EPTYPE_DEFAULT << 18)   /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */
#define USBAHB_DIEP0CTL_STALL                              (0x1UL << 21)                             /**< Handshake                                   */
#define _USBAHB_DIEP0CTL_STALL_SHIFT                       21                                        /**< Shift value for USBAHB_STALL                */
#define _USBAHB_DIEP0CTL_STALL_MASK                        0x200000UL                                /**< Bit mask for USBAHB_STALL                   */
#define _USBAHB_DIEP0CTL_STALL_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_STALL_DEFAULT                      (_USBAHB_DIEP0CTL_STALL_DEFAULT << 21)    /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */
#define _USBAHB_DIEP0CTL_TXFNUM_SHIFT                      22                                        /**< Shift value for USBAHB_TXFNUM               */
#define _USBAHB_DIEP0CTL_TXFNUM_MASK                       0x3C00000UL                               /**< Bit mask for USBAHB_TXFNUM                  */
#define _USBAHB_DIEP0CTL_TXFNUM_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_TXFNUM_DEFAULT                     (_USBAHB_DIEP0CTL_TXFNUM_DEFAULT << 22)   /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */
#define USBAHB_DIEP0CTL_CNAK                               (0x1UL << 26)                             /**< Clear NAK                                   */
#define _USBAHB_DIEP0CTL_CNAK_SHIFT                        26                                        /**< Shift value for USBAHB_CNAK                 */
#define _USBAHB_DIEP0CTL_CNAK_MASK                         0x4000000UL                               /**< Bit mask for USBAHB_CNAK                    */
#define _USBAHB_DIEP0CTL_CNAK_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_CNAK_DEFAULT                       (_USBAHB_DIEP0CTL_CNAK_DEFAULT << 26)     /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */
#define USBAHB_DIEP0CTL_SNAK                               (0x1UL << 27)                             /**< Set NAK                                     */
#define _USBAHB_DIEP0CTL_SNAK_SHIFT                        27                                        /**< Shift value for USBAHB_SNAK                 */
#define _USBAHB_DIEP0CTL_SNAK_MASK                         0x8000000UL                               /**< Bit mask for USBAHB_SNAK                    */
#define _USBAHB_DIEP0CTL_SNAK_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_SNAK_DEFAULT                       (_USBAHB_DIEP0CTL_SNAK_DEFAULT << 27)     /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */
#define USBAHB_DIEP0CTL_EPDIS                              (0x1UL << 30)                             /**< Endpoint Disable                            */
#define _USBAHB_DIEP0CTL_EPDIS_SHIFT                       30                                        /**< Shift value for USBAHB_EPDIS                */
#define _USBAHB_DIEP0CTL_EPDIS_MASK                        0x40000000UL                              /**< Bit mask for USBAHB_EPDIS                   */
#define _USBAHB_DIEP0CTL_EPDIS_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_EPDIS_DEFAULT                      (_USBAHB_DIEP0CTL_EPDIS_DEFAULT << 30)    /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */
#define USBAHB_DIEP0CTL_EPENA                              (0x1UL << 31)                             /**< End point enable                            */
#define _USBAHB_DIEP0CTL_EPENA_SHIFT                       31                                        /**< Shift value for USBAHB_EPENA                */
#define _USBAHB_DIEP0CTL_EPENA_MASK                        0x80000000UL                              /**< Bit mask for USBAHB_EPENA                   */
#define _USBAHB_DIEP0CTL_EPENA_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0CTL            */
#define USBAHB_DIEP0CTL_EPENA_DEFAULT                      (_USBAHB_DIEP0CTL_EPENA_DEFAULT << 31)    /**< Shifted mode DEFAULT for USBAHB_DIEP0CTL    */

/* Bit fields for USBAHB DIEP0INT */
#define _USBAHB_DIEP0INT_RESETVALUE                        0x00000080UL                                /**< Default value for USBAHB_DIEP0INT           */
#define _USBAHB_DIEP0INT_MASK                              0x00007BFFUL                                /**< Mask for USBAHB_DIEP0INT                    */
#define USBAHB_DIEP0INT_XFERCOMPL                          (0x1UL << 0)                                /**< Transfer Completed Interrupt                */
#define _USBAHB_DIEP0INT_XFERCOMPL_SHIFT                   0                                           /**< Shift value for USBAHB_XFERCOMPL            */
#define _USBAHB_DIEP0INT_XFERCOMPL_MASK                    0x1UL                                       /**< Bit mask for USBAHB_XFERCOMPL               */
#define _USBAHB_DIEP0INT_XFERCOMPL_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_XFERCOMPL_DEFAULT                  (_USBAHB_DIEP0INT_XFERCOMPL_DEFAULT << 0)   /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_EPDISBLD                           (0x1UL << 1)                                /**< Endpoint Disabled Interrupt                 */
#define _USBAHB_DIEP0INT_EPDISBLD_SHIFT                    1                                           /**< Shift value for USBAHB_EPDISBLD             */
#define _USBAHB_DIEP0INT_EPDISBLD_MASK                     0x2UL                                       /**< Bit mask for USBAHB_EPDISBLD                */
#define _USBAHB_DIEP0INT_EPDISBLD_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_EPDISBLD_DEFAULT                   (_USBAHB_DIEP0INT_EPDISBLD_DEFAULT << 1)    /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_AHBERR                             (0x1UL << 2)                                /**< AHB Error                                   */
#define _USBAHB_DIEP0INT_AHBERR_SHIFT                      2                                           /**< Shift value for USBAHB_AHBERR               */
#define _USBAHB_DIEP0INT_AHBERR_MASK                       0x4UL                                       /**< Bit mask for USBAHB_AHBERR                  */
#define _USBAHB_DIEP0INT_AHBERR_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_AHBERR_DEFAULT                     (_USBAHB_DIEP0INT_AHBERR_DEFAULT << 2)      /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_TIMEOUT                            (0x1UL << 3)                                /**< Condition                                   */
#define _USBAHB_DIEP0INT_TIMEOUT_SHIFT                     3                                           /**< Shift value for USBAHB_TIMEOUT              */
#define _USBAHB_DIEP0INT_TIMEOUT_MASK                      0x8UL                                       /**< Bit mask for USBAHB_TIMEOUT                 */
#define _USBAHB_DIEP0INT_TIMEOUT_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_TIMEOUT_DEFAULT                    (_USBAHB_DIEP0INT_TIMEOUT_DEFAULT << 3)     /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_INTKNTXFEMP                        (0x1UL << 4)                                /**< In Token recvd when TXFIFO Empty            */
#define _USBAHB_DIEP0INT_INTKNTXFEMP_SHIFT                 4                                           /**< Shift value for USBAHB_INTKNTXFEMP          */
#define _USBAHB_DIEP0INT_INTKNTXFEMP_MASK                  0x10UL                                      /**< Bit mask for USBAHB_INTKNTXFEMP             */
#define _USBAHB_DIEP0INT_INTKNTXFEMP_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_INTKNTXFEMP_DEFAULT                (_USBAHB_DIEP0INT_INTKNTXFEMP_DEFAULT << 4) /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_INTKNEPMIS                         (0x1UL << 5)                                /**< IN Token recvd with EP Mismatch             */
#define _USBAHB_DIEP0INT_INTKNEPMIS_SHIFT                  5                                           /**< Shift value for USBAHB_INTKNEPMIS           */
#define _USBAHB_DIEP0INT_INTKNEPMIS_MASK                   0x20UL                                      /**< Bit mask for USBAHB_INTKNEPMIS              */
#define _USBAHB_DIEP0INT_INTKNEPMIS_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_INTKNEPMIS_DEFAULT                 (_USBAHB_DIEP0INT_INTKNEPMIS_DEFAULT << 5)  /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_INEPNAKEFF                         (0x1UL << 6)                                /**< In Endpoint NAK Effective                   */
#define _USBAHB_DIEP0INT_INEPNAKEFF_SHIFT                  6                                           /**< Shift value for USBAHB_INEPNAKEFF           */
#define _USBAHB_DIEP0INT_INEPNAKEFF_MASK                   0x40UL                                      /**< Bit mask for USBAHB_INEPNAKEFF              */
#define _USBAHB_DIEP0INT_INEPNAKEFF_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_INEPNAKEFF_DEFAULT                 (_USBAHB_DIEP0INT_INEPNAKEFF_DEFAULT << 6)  /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_TXFEMP                             (0x1UL << 7)                                /**< TX FIFO Empty                               */
#define _USBAHB_DIEP0INT_TXFEMP_SHIFT                      7                                           /**< Shift value for USBAHB_TXFEMP               */
#define _USBAHB_DIEP0INT_TXFEMP_MASK                       0x80UL                                      /**< Bit mask for USBAHB_TXFEMP                  */
#define _USBAHB_DIEP0INT_TXFEMP_DEFAULT                    0x00000001UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_TXFEMP_DEFAULT                     (_USBAHB_DIEP0INT_TXFEMP_DEFAULT << 7)      /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_TXFIFOUNDRN                        (0x1UL << 8)                                /**< FIFO Underrun                               */
#define _USBAHB_DIEP0INT_TXFIFOUNDRN_SHIFT                 8                                           /**< Shift value for USBAHB_TXFIFOUNDRN          */
#define _USBAHB_DIEP0INT_TXFIFOUNDRN_MASK                  0x100UL                                     /**< Bit mask for USBAHB_TXFIFOUNDRN             */
#define _USBAHB_DIEP0INT_TXFIFOUNDRN_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_TXFIFOUNDRN_DEFAULT                (_USBAHB_DIEP0INT_TXFIFOUNDRN_DEFAULT << 8) /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_BNAINTR                            (0x1UL << 9)                                /**< BNA(Buffer Not Available) IRQ               */
#define _USBAHB_DIEP0INT_BNAINTR_SHIFT                     9                                           /**< Shift value for USBAHB_BNAINTR              */
#define _USBAHB_DIEP0INT_BNAINTR_MASK                      0x200UL                                     /**< Bit mask for USBAHB_BNAINTR                 */
#define _USBAHB_DIEP0INT_BNAINTR_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_BNAINTR_DEFAULT                    (_USBAHB_DIEP0INT_BNAINTR_DEFAULT << 9)     /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_PKTDRPSTS                          (0x1UL << 11)                               /**< Packet Drop Status                          */
#define _USBAHB_DIEP0INT_PKTDRPSTS_SHIFT                   11                                          /**< Shift value for USBAHB_PKTDRPSTS            */
#define _USBAHB_DIEP0INT_PKTDRPSTS_MASK                    0x800UL                                     /**< Bit mask for USBAHB_PKTDRPSTS               */
#define _USBAHB_DIEP0INT_PKTDRPSTS_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_PKTDRPSTS_DEFAULT                  (_USBAHB_DIEP0INT_PKTDRPSTS_DEFAULT << 11)  /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_BBLEERR                            (0x1UL << 12)                               /**< Babble error                                */
#define _USBAHB_DIEP0INT_BBLEERR_SHIFT                     12                                          /**< Shift value for USBAHB_BBLEERR              */
#define _USBAHB_DIEP0INT_BBLEERR_MASK                      0x1000UL                                    /**< Bit mask for USBAHB_BBLEERR                 */
#define _USBAHB_DIEP0INT_BBLEERR_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_BBLEERR_DEFAULT                    (_USBAHB_DIEP0INT_BBLEERR_DEFAULT << 12)    /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_NAKINTRPT                          (0x1UL << 13)                               /**< NAK Interrupt                               */
#define _USBAHB_DIEP0INT_NAKINTRPT_SHIFT                   13                                          /**< Shift value for USBAHB_NAKINTRPT            */
#define _USBAHB_DIEP0INT_NAKINTRPT_MASK                    0x2000UL                                    /**< Bit mask for USBAHB_NAKINTRPT               */
#define _USBAHB_DIEP0INT_NAKINTRPT_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_NAKINTRPT_DEFAULT                  (_USBAHB_DIEP0INT_NAKINTRPT_DEFAULT << 13)  /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */
#define USBAHB_DIEP0INT_NYETINTRPT                         (0x1UL << 14)                               /**< NYET Interrupt                              */
#define _USBAHB_DIEP0INT_NYETINTRPT_SHIFT                  14                                          /**< Shift value for USBAHB_NYETINTRPT           */
#define _USBAHB_DIEP0INT_NYETINTRPT_MASK                   0x4000UL                                    /**< Bit mask for USBAHB_NYETINTRPT              */
#define _USBAHB_DIEP0INT_NYETINTRPT_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0INT            */
#define USBAHB_DIEP0INT_NYETINTRPT_DEFAULT                 (_USBAHB_DIEP0INT_NYETINTRPT_DEFAULT << 14) /**< Shifted mode DEFAULT for USBAHB_DIEP0INT    */

