espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DIEP0TSIZ */
#define _USBAHB_DIEP0TSIZ_RESETVALUE                       0x00000000UL                              /**< Default value for USBAHB_DIEP0TSIZ          */
#define _USBAHB_DIEP0TSIZ_MASK                             0x0018007FUL                              /**< Mask for USBAHB_DIEP0TSIZ                   */
#define _USBAHB_DIEP0TSIZ_XFERSIZE_SHIFT                   0                                         /**< Shift value for USBAHB_XFERSIZE             */
#define _USBAHB_DIEP0TSIZ_XFERSIZE_MASK                    0x7FUL                                    /**< Bit mask for USBAHB_XFERSIZE                */
#define _USBAHB_DIEP0TSIZ_XFERSIZE_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0TSIZ           */
#define USBAHB_DIEP0TSIZ_XFERSIZE_DEFAULT                  (_USBAHB_DIEP0TSIZ_XFERSIZE_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEP0TSIZ   */
#define _USBAHB_DIEP0TSIZ_PKTCNT_SHIFT                     19                                        /**< Shift value for USBAHB_PKTCNT               */
#define _USBAHB_DIEP0TSIZ_PKTCNT_MASK                      0x180000UL                                /**< Bit mask for USBAHB_PKTCNT                  */
#define _USBAHB_DIEP0TSIZ_PKTCNT_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for USBAHB_DIEP0TSIZ           */
#define USBAHB_DIEP0TSIZ_PKTCNT_DEFAULT                    (_USBAHB_DIEP0TSIZ_PKTCNT_DEFAULT << 19)  /**< Shifted mode DEFAULT for USBAHB_DIEP0TSIZ   */

/* Bit fields for USBAHB DIEP0DMAADDR */
#define _USBAHB_DIEP0DMAADDR_RESETVALUE                    0x00000000UL                                /**< Default value for USBAHB_DIEP0DMAADDR       */
#define _USBAHB_DIEP0DMAADDR_MASK                          0xFFFFFFFFUL                                /**< Mask for USBAHB_DIEP0DMAADDR                */
#define _USBAHB_DIEP0DMAADDR_DMAADDR_SHIFT                 0                                           /**< Shift value for USBAHB_DMAADDR              */
#define _USBAHB_DIEP0DMAADDR_DMAADDR_MASK                  0xFFFFFFFFUL                                /**< Bit mask for USBAHB_DMAADDR                 */
#define _USBAHB_DIEP0DMAADDR_DMAADDR_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for USBAHB_DIEP0DMAADDR        */
#define USBAHB_DIEP0DMAADDR_DMAADDR_DEFAULT                (_USBAHB_DIEP0DMAADDR_DMAADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEP0DMAADDR*/

/* Bit fields for USBAHB DIEP0TXFSTS */
#define _USBAHB_DIEP0TXFSTS_RESETVALUE                     0x00000300UL                                /**< Default value for USBAHB_DIEP0TXFSTS        */
#define _USBAHB_DIEP0TXFSTS_MASK                           0x0000FFFFUL                                /**< Mask for USBAHB_DIEP0TXFSTS                 */
#define _USBAHB_DIEP0TXFSTS_SPCAVAIL_SHIFT                 0                                           /**< Shift value for USBAHB_SPCAVAIL             */
#define _USBAHB_DIEP0TXFSTS_SPCAVAIL_MASK                  0xFFFFUL                                    /**< Bit mask for USBAHB_SPCAVAIL                */
#define _USBAHB_DIEP0TXFSTS_SPCAVAIL_DEFAULT               0x00000300UL                                /**< Mode DEFAULT for USBAHB_DIEP0TXFSTS         */
#define USBAHB_DIEP0TXFSTS_SPCAVAIL_DEFAULT                (_USBAHB_DIEP0TXFSTS_SPCAVAIL_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DIEP0TXFSTS */

/* Bit fields for USBAHB DEVINEP_CTL */
#define _USBAHB_DEVINEP_CTL_RESETVALUE                     0x00000000UL                                   /**< Default value for USBAHB_DEVINEP_CTL        */
#define _USBAHB_DEVINEP_CTL_MASK                           0xFFEF87FFUL                                   /**< Mask for USBAHB_DEVINEP_CTL                 */
#define _USBAHB_DEVINEP_CTL_MPS_SHIFT                      0                                              /**< Shift value for USBAHB_MPS                  */
#define _USBAHB_DEVINEP_CTL_MPS_MASK                       0x7FFUL                                        /**< Bit mask for USBAHB_MPS                     */
#define _USBAHB_DEVINEP_CTL_MPS_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_MPS_DEFAULT                     (_USBAHB_DEVINEP_CTL_MPS_DEFAULT << 0)         /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_USBACTEP                        (0x1UL << 15)                                  /**< USB ACtive Endpoint                         */
#define _USBAHB_DEVINEP_CTL_USBACTEP_SHIFT                 15                                             /**< Shift value for USBAHB_USBACTEP             */
#define _USBAHB_DEVINEP_CTL_USBACTEP_MASK                  0x8000UL                                       /**< Bit mask for USBAHB_USBACTEP                */
#define _USBAHB_DEVINEP_CTL_USBACTEP_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_USBACTEP_DEFAULT                (_USBAHB_DEVINEP_CTL_USBACTEP_DEFAULT << 15)   /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_DPID                            (0x1UL << 16)                                  /**< Endpoint Data PID, EO_FrNum                 */
#define _USBAHB_DEVINEP_CTL_DPID_SHIFT                     16                                             /**< Shift value for USBAHB_DPID                 */
#define _USBAHB_DEVINEP_CTL_DPID_MASK                      0x10000UL                                      /**< Bit mask for USBAHB_DPID                    */
#define _USBAHB_DEVINEP_CTL_DPID_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_DPID_DEFAULT                    (_USBAHB_DEVINEP_CTL_DPID_DEFAULT << 16)       /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_NAKSTS                          (0x1UL << 17)                                  /**< NAK STatus                                  */
#define _USBAHB_DEVINEP_CTL_NAKSTS_SHIFT                   17                                             /**< Shift value for USBAHB_NAKSTS               */
#define _USBAHB_DEVINEP_CTL_NAKSTS_MASK                    0x20000UL                                      /**< Bit mask for USBAHB_NAKSTS                  */
#define _USBAHB_DEVINEP_CTL_NAKSTS_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_NAKSTS_DEFAULT                  (_USBAHB_DEVINEP_CTL_NAKSTS_DEFAULT << 17)     /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define _USBAHB_DEVINEP_CTL_EPTYPE_SHIFT                   18                                             /**< Shift value for USBAHB_EPTYPE               */
#define _USBAHB_DEVINEP_CTL_EPTYPE_MASK                    0xC0000UL                                      /**< Bit mask for USBAHB_EPTYPE                  */
#define _USBAHB_DEVINEP_CTL_EPTYPE_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_EPTYPE_DEFAULT                  (_USBAHB_DEVINEP_CTL_EPTYPE_DEFAULT << 18)     /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_STALL                           (0x1UL << 21)                                  /**< Handshake                                   */
#define _USBAHB_DEVINEP_CTL_STALL_SHIFT                    21                                             /**< Shift value for USBAHB_STALL                */
#define _USBAHB_DEVINEP_CTL_STALL_MASK                     0x200000UL                                     /**< Bit mask for USBAHB_STALL                   */
#define _USBAHB_DEVINEP_CTL_STALL_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_STALL_DEFAULT                   (_USBAHB_DEVINEP_CTL_STALL_DEFAULT << 21)      /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define _USBAHB_DEVINEP_CTL_TXFNUM_SHIFT                   22                                             /**< Shift value for USBAHB_TXFNUM               */
#define _USBAHB_DEVINEP_CTL_TXFNUM_MASK                    0x3C00000UL                                    /**< Bit mask for USBAHB_TXFNUM                  */
#define _USBAHB_DEVINEP_CTL_TXFNUM_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_TXFNUM_DEFAULT                  (_USBAHB_DEVINEP_CTL_TXFNUM_DEFAULT << 22)     /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_CNAK                            (0x1UL << 26)                                  /**< Clear NAK                                   */
#define _USBAHB_DEVINEP_CTL_CNAK_SHIFT                     26                                             /**< Shift value for USBAHB_CNAK                 */
#define _USBAHB_DEVINEP_CTL_CNAK_MASK                      0x4000000UL                                    /**< Bit mask for USBAHB_CNAK                    */
#define _USBAHB_DEVINEP_CTL_CNAK_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_CNAK_DEFAULT                    (_USBAHB_DEVINEP_CTL_CNAK_DEFAULT << 26)       /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_SNAK                            (0x1UL << 27)                                  /**< Set NAK                                     */
#define _USBAHB_DEVINEP_CTL_SNAK_SHIFT                     27                                             /**< Shift value for USBAHB_SNAK                 */
#define _USBAHB_DEVINEP_CTL_SNAK_MASK                      0x8000000UL                                    /**< Bit mask for USBAHB_SNAK                    */
#define _USBAHB_DEVINEP_CTL_SNAK_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_SNAK_DEFAULT                    (_USBAHB_DEVINEP_CTL_SNAK_DEFAULT << 27)       /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_SETD0PIDEF                      (0x1UL << 28)                                  /**< Set DATA0 PID / Even Frame                  */
#define _USBAHB_DEVINEP_CTL_SETD0PIDEF_SHIFT               28                                             /**< Shift value for USBAHB_SETD0PIDEF           */
#define _USBAHB_DEVINEP_CTL_SETD0PIDEF_MASK                0x10000000UL                                   /**< Bit mask for USBAHB_SETD0PIDEF              */
#define _USBAHB_DEVINEP_CTL_SETD0PIDEF_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_SETD0PIDEF_DEFAULT              (_USBAHB_DEVINEP_CTL_SETD0PIDEF_DEFAULT << 28) /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_SETD1PIDOF                      (0x1UL << 29)                                  /**< Set DATA1 PID / odd Frame                   */
#define _USBAHB_DEVINEP_CTL_SETD1PIDOF_SHIFT               29                                             /**< Shift value for USBAHB_SETD1PIDOF           */
#define _USBAHB_DEVINEP_CTL_SETD1PIDOF_MASK                0x20000000UL                                   /**< Bit mask for USBAHB_SETD1PIDOF              */
#define _USBAHB_DEVINEP_CTL_SETD1PIDOF_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_SETD1PIDOF_DEFAULT              (_USBAHB_DEVINEP_CTL_SETD1PIDOF_DEFAULT << 29) /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_EPDIS                           (0x1UL << 30)                                  /**< Endpoint Disable                            */
#define _USBAHB_DEVINEP_CTL_EPDIS_SHIFT                    30                                             /**< Shift value for USBAHB_EPDIS                */
#define _USBAHB_DEVINEP_CTL_EPDIS_MASK                     0x40000000UL                                   /**< Bit mask for USBAHB_EPDIS                   */
#define _USBAHB_DEVINEP_CTL_EPDIS_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_EPDIS_DEFAULT                   (_USBAHB_DEVINEP_CTL_EPDIS_DEFAULT << 30)      /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */
#define USBAHB_DEVINEP_CTL_EPENA                           (0x1UL << 31)                                  /**< Endpoint enable                             */
#define _USBAHB_DEVINEP_CTL_EPENA_SHIFT                    31                                             /**< Shift value for USBAHB_EPENA                */
#define _USBAHB_DEVINEP_CTL_EPENA_MASK                     0x80000000UL                                   /**< Bit mask for USBAHB_EPENA                   */
#define _USBAHB_DEVINEP_CTL_EPENA_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_CTL         */
#define USBAHB_DEVINEP_CTL_EPENA_DEFAULT                   (_USBAHB_DEVINEP_CTL_EPENA_DEFAULT << 31)      /**< Shifted mode DEFAULT for USBAHB_DEVINEP_CTL */

