espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DEVINEP_INT */
#define _USBAHB_DEVINEP_INT_RESETVALUE                     0x00000080UL                                   /**< Default value for USBAHB_DEVINEP_INT        */
#define _USBAHB_DEVINEP_INT_MASK                           0x00007BFFUL                                   /**< Mask for USBAHB_DEVINEP_INT                 */
#define USBAHB_DEVINEP_INT_XFERCOMPL                       (0x1UL << 0)                                   /**< Transfer Completed IRQ                      */
#define _USBAHB_DEVINEP_INT_XFERCOMPL_SHIFT                0                                              /**< Shift value for USBAHB_XFERCOMPL            */
#define _USBAHB_DEVINEP_INT_XFERCOMPL_MASK                 0x1UL                                          /**< Bit mask for USBAHB_XFERCOMPL               */
#define _USBAHB_DEVINEP_INT_XFERCOMPL_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_XFERCOMPL_DEFAULT               (_USBAHB_DEVINEP_INT_XFERCOMPL_DEFAULT << 0)   /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_EPDISBLD                        (0x1UL << 1)                                   /**< Endpoint Disabled IRQ                       */
#define _USBAHB_DEVINEP_INT_EPDISBLD_SHIFT                 1                                              /**< Shift value for USBAHB_EPDISBLD             */
#define _USBAHB_DEVINEP_INT_EPDISBLD_MASK                  0x2UL                                          /**< Bit mask for USBAHB_EPDISBLD                */
#define _USBAHB_DEVINEP_INT_EPDISBLD_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_EPDISBLD_DEFAULT                (_USBAHB_DEVINEP_INT_EPDISBLD_DEFAULT << 1)    /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_AHBERR                          (0x1UL << 2)                                   /**< AHB Error                                   */
#define _USBAHB_DEVINEP_INT_AHBERR_SHIFT                   2                                              /**< Shift value for USBAHB_AHBERR               */
#define _USBAHB_DEVINEP_INT_AHBERR_MASK                    0x4UL                                          /**< Bit mask for USBAHB_AHBERR                  */
#define _USBAHB_DEVINEP_INT_AHBERR_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_AHBERR_DEFAULT                  (_USBAHB_DEVINEP_INT_AHBERR_DEFAULT << 2)      /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_TIMEOUT                         (0x1UL << 3)                                   /**< COndition                                   */
#define _USBAHB_DEVINEP_INT_TIMEOUT_SHIFT                  3                                              /**< Shift value for USBAHB_TIMEOUT              */
#define _USBAHB_DEVINEP_INT_TIMEOUT_MASK                   0x8UL                                          /**< Bit mask for USBAHB_TIMEOUT                 */
#define _USBAHB_DEVINEP_INT_TIMEOUT_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_TIMEOUT_DEFAULT                 (_USBAHB_DEVINEP_INT_TIMEOUT_DEFAULT << 3)     /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_INTKNTXFEMP                     (0x1UL << 4)                                   /**< IN Token recvd When TxFIFO is Empty         */
#define _USBAHB_DEVINEP_INT_INTKNTXFEMP_SHIFT              4                                              /**< Shift value for USBAHB_INTKNTXFEMP          */
#define _USBAHB_DEVINEP_INT_INTKNTXFEMP_MASK               0x10UL                                         /**< Bit mask for USBAHB_INTKNTXFEMP             */
#define _USBAHB_DEVINEP_INT_INTKNTXFEMP_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_INTKNTXFEMP_DEFAULT             (_USBAHB_DEVINEP_INT_INTKNTXFEMP_DEFAULT << 4) /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_INTKNEPMIS                      (0x1UL << 5)                                   /**< IN Token recvd with EP Mismatch             */
#define _USBAHB_DEVINEP_INT_INTKNEPMIS_SHIFT               5                                              /**< Shift value for USBAHB_INTKNEPMIS           */
#define _USBAHB_DEVINEP_INT_INTKNEPMIS_MASK                0x20UL                                         /**< Bit mask for USBAHB_INTKNEPMIS              */
#define _USBAHB_DEVINEP_INT_INTKNEPMIS_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_INTKNEPMIS_DEFAULT              (_USBAHB_DEVINEP_INT_INTKNEPMIS_DEFAULT << 5)  /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_INEPNAKEFF                      (0x1UL << 6)                                   /**< IN Endpoint NAK Effective                   */
#define _USBAHB_DEVINEP_INT_INEPNAKEFF_SHIFT               6                                              /**< Shift value for USBAHB_INEPNAKEFF           */
#define _USBAHB_DEVINEP_INT_INEPNAKEFF_MASK                0x40UL                                         /**< Bit mask for USBAHB_INEPNAKEFF              */
#define _USBAHB_DEVINEP_INT_INEPNAKEFF_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_INEPNAKEFF_DEFAULT              (_USBAHB_DEVINEP_INT_INEPNAKEFF_DEFAULT << 6)  /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_TXFEMP                          (0x1UL << 7)                                   /**< TX FIFO Empty                               */
#define _USBAHB_DEVINEP_INT_TXFEMP_SHIFT                   7                                              /**< Shift value for USBAHB_TXFEMP               */
#define _USBAHB_DEVINEP_INT_TXFEMP_MASK                    0x80UL                                         /**< Bit mask for USBAHB_TXFEMP                  */
#define _USBAHB_DEVINEP_INT_TXFEMP_DEFAULT                 0x00000001UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_TXFEMP_DEFAULT                  (_USBAHB_DEVINEP_INT_TXFEMP_DEFAULT << 7)      /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_TXFIFOUNDRN                     (0x1UL << 8)                                   /**< FIFO Underrun                               */
#define _USBAHB_DEVINEP_INT_TXFIFOUNDRN_SHIFT              8                                              /**< Shift value for USBAHB_TXFIFOUNDRN          */
#define _USBAHB_DEVINEP_INT_TXFIFOUNDRN_MASK               0x100UL                                        /**< Bit mask for USBAHB_TXFIFOUNDRN             */
#define _USBAHB_DEVINEP_INT_TXFIFOUNDRN_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_TXFIFOUNDRN_DEFAULT             (_USBAHB_DEVINEP_INT_TXFIFOUNDRN_DEFAULT << 8) /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_BNAINTR                         (0x1UL << 9)                                   /**< BNA (Buffer Not Available) IRQ              */
#define _USBAHB_DEVINEP_INT_BNAINTR_SHIFT                  9                                              /**< Shift value for USBAHB_BNAINTR              */
#define _USBAHB_DEVINEP_INT_BNAINTR_MASK                   0x200UL                                        /**< Bit mask for USBAHB_BNAINTR                 */
#define _USBAHB_DEVINEP_INT_BNAINTR_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_BNAINTR_DEFAULT                 (_USBAHB_DEVINEP_INT_BNAINTR_DEFAULT << 9)     /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_PKTDRPSTS                       (0x1UL << 11)                                  /**< Packet Drop Status                          */
#define _USBAHB_DEVINEP_INT_PKTDRPSTS_SHIFT                11                                             /**< Shift value for USBAHB_PKTDRPSTS            */
#define _USBAHB_DEVINEP_INT_PKTDRPSTS_MASK                 0x800UL                                        /**< Bit mask for USBAHB_PKTDRPSTS               */
#define _USBAHB_DEVINEP_INT_PKTDRPSTS_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_PKTDRPSTS_DEFAULT               (_USBAHB_DEVINEP_INT_PKTDRPSTS_DEFAULT << 11)  /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_BBLEERR                         (0x1UL << 12)                                  /**< Babble Interrupt                            */
#define _USBAHB_DEVINEP_INT_BBLEERR_SHIFT                  12                                             /**< Shift value for USBAHB_BBLEERR              */
#define _USBAHB_DEVINEP_INT_BBLEERR_MASK                   0x1000UL                                       /**< Bit mask for USBAHB_BBLEERR                 */
#define _USBAHB_DEVINEP_INT_BBLEERR_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_BBLEERR_DEFAULT                 (_USBAHB_DEVINEP_INT_BBLEERR_DEFAULT << 12)    /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_NAKINTRPT                       (0x1UL << 13)                                  /**< NAK Interrupt                               */
#define _USBAHB_DEVINEP_INT_NAKINTRPT_SHIFT                13                                             /**< Shift value for USBAHB_NAKINTRPT            */
#define _USBAHB_DEVINEP_INT_NAKINTRPT_MASK                 0x2000UL                                       /**< Bit mask for USBAHB_NAKINTRPT               */
#define _USBAHB_DEVINEP_INT_NAKINTRPT_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_NAKINTRPT_DEFAULT               (_USBAHB_DEVINEP_INT_NAKINTRPT_DEFAULT << 13)  /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */
#define USBAHB_DEVINEP_INT_NYETINTRPT                      (0x1UL << 14)                                  /**< NYET Interrupt                              */
#define _USBAHB_DEVINEP_INT_NYETINTRPT_SHIFT               14                                             /**< Shift value for USBAHB_NYETINTRPT           */
#define _USBAHB_DEVINEP_INT_NYETINTRPT_MASK                0x4000UL                                       /**< Bit mask for USBAHB_NYETINTRPT              */
#define _USBAHB_DEVINEP_INT_NYETINTRPT_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_INT         */
#define USBAHB_DEVINEP_INT_NYETINTRPT_DEFAULT              (_USBAHB_DEVINEP_INT_NYETINTRPT_DEFAULT << 14) /**< Shifted mode DEFAULT for USBAHB_DEVINEP_INT */

/* Bit fields for USBAHB DEVINEP_TSIZ */
#define _USBAHB_DEVINEP_TSIZ_RESETVALUE                    0x00000000UL                                 /**< Default value for USBAHB_DEVINEP_TSIZ       */
#define _USBAHB_DEVINEP_TSIZ_MASK                          0x7FFFFFFFUL                                 /**< Mask for USBAHB_DEVINEP_TSIZ                */
#define _USBAHB_DEVINEP_TSIZ_XFERSIZE_SHIFT                0                                            /**< Shift value for USBAHB_XFERSIZE             */
#define _USBAHB_DEVINEP_TSIZ_XFERSIZE_MASK                 0x7FFFFUL                                    /**< Bit mask for USBAHB_XFERSIZE                */
#define _USBAHB_DEVINEP_TSIZ_XFERSIZE_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for USBAHB_DEVINEP_TSIZ        */
#define USBAHB_DEVINEP_TSIZ_XFERSIZE_DEFAULT               (_USBAHB_DEVINEP_TSIZ_XFERSIZE_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DEVINEP_TSIZ*/
#define _USBAHB_DEVINEP_TSIZ_PKTCNT_SHIFT                  19                                           /**< Shift value for USBAHB_PKTCNT               */
#define _USBAHB_DEVINEP_TSIZ_PKTCNT_MASK                   0x1FF80000UL                                 /**< Bit mask for USBAHB_PKTCNT                  */
#define _USBAHB_DEVINEP_TSIZ_PKTCNT_DEFAULT                0x00000000UL                                 /**< Mode DEFAULT for USBAHB_DEVINEP_TSIZ        */
#define USBAHB_DEVINEP_TSIZ_PKTCNT_DEFAULT                 (_USBAHB_DEVINEP_TSIZ_PKTCNT_DEFAULT << 19)  /**< Shifted mode DEFAULT for USBAHB_DEVINEP_TSIZ*/
#define _USBAHB_DEVINEP_TSIZ_MC_SHIFT                      29                                           /**< Shift value for USBAHB_MC                   */
#define _USBAHB_DEVINEP_TSIZ_MC_MASK                       0x60000000UL                                 /**< Bit mask for USBAHB_MC                      */
#define _USBAHB_DEVINEP_TSIZ_MC_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for USBAHB_DEVINEP_TSIZ        */
#define USBAHB_DEVINEP_TSIZ_MC_DEFAULT                     (_USBAHB_DEVINEP_TSIZ_MC_DEFAULT << 29)      /**< Shifted mode DEFAULT for USBAHB_DEVINEP_TSIZ*/

/* Bit fields for USBAHB DEVINEP_DMAADDR */
#define _USBAHB_DEVINEP_DMAADDR_RESETVALUE                 0x00000000UL                                   /**< Default value for USBAHB_DEVINEP_DMAADDR    */
#define _USBAHB_DEVINEP_DMAADDR_MASK                       0xFFFFFFFFUL                                   /**< Mask for USBAHB_DEVINEP_DMAADDR             */
#define _USBAHB_DEVINEP_DMAADDR_DMAADDR_SHIFT              0                                              /**< Shift value for USBAHB_DMAADDR              */
#define _USBAHB_DEVINEP_DMAADDR_DMAADDR_MASK               0xFFFFFFFFUL                                   /**< Bit mask for USBAHB_DMAADDR                 */
#define _USBAHB_DEVINEP_DMAADDR_DMAADDR_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DEVINEP_DMAADDR     */
#define USBAHB_DEVINEP_DMAADDR_DMAADDR_DEFAULT             (_USBAHB_DEVINEP_DMAADDR_DMAADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DEVINEP_DMAADDR*/

/* Bit fields for USBAHB DEVINEP_DTXFSTS */
#define _USBAHB_DEVINEP_DTXFSTS_RESETVALUE                 0x00000300UL                                           /**< Default value for USBAHB_DEVINEP_DTXFSTS    */
#define _USBAHB_DEVINEP_DTXFSTS_MASK                       0x0000FFFFUL                                           /**< Mask for USBAHB_DEVINEP_DTXFSTS             */
#define _USBAHB_DEVINEP_DTXFSTS_INEPTXFSPCAVAIL_SHIFT      0                                                      /**< Shift value for USBAHB_INEPTXFSPCAVAIL      */
#define _USBAHB_DEVINEP_DTXFSTS_INEPTXFSPCAVAIL_MASK       0xFFFFUL                                               /**< Bit mask for USBAHB_INEPTXFSPCAVAIL         */
#define _USBAHB_DEVINEP_DTXFSTS_INEPTXFSPCAVAIL_DEFAULT    0x00000300UL                                           /**< Mode DEFAULT for USBAHB_DEVINEP_DTXFSTS     */
#define USBAHB_DEVINEP_DTXFSTS_INEPTXFSPCAVAIL_DEFAULT     (_USBAHB_DEVINEP_DTXFSTS_INEPTXFSPCAVAIL_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DEVINEP_DTXFSTS*/

