espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DOEP0CTL */
#define _USBAHB_DOEP0CTL_RESETVALUE                        0x00000000UL                              /**< Default value for USBAHB_DOEP0CTL           */
#define _USBAHB_DOEP0CTL_MASK                              0xCC3E8003UL                              /**< Mask for USBAHB_DOEP0CTL                    */
#define _USBAHB_DOEP0CTL_MPS_SHIFT                         0                                         /**< Shift value for USBAHB_MPS                  */
#define _USBAHB_DOEP0CTL_MPS_MASK                          0x3UL                                     /**< Bit mask for USBAHB_MPS                     */
#define _USBAHB_DOEP0CTL_MPS_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_MPS_DEFAULT                        (_USBAHB_DOEP0CTL_MPS_DEFAULT << 0)       /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */
#define USBAHB_DOEP0CTL_USBACTEP                           (0x1UL << 15)                             /**< US Active Endpoint                          */
#define _USBAHB_DOEP0CTL_USBACTEP_SHIFT                    15                                        /**< Shift value for USBAHB_USBACTEP             */
#define _USBAHB_DOEP0CTL_USBACTEP_MASK                     0x8000UL                                  /**< Bit mask for USBAHB_USBACTEP                */
#define _USBAHB_DOEP0CTL_USBACTEP_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_USBACTEP_DEFAULT                   (_USBAHB_DOEP0CTL_USBACTEP_DEFAULT << 15) /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */
#define USBAHB_DOEP0CTL_NAKSTS                             (0x1UL << 17)                             /**< NAK Status                                  */
#define _USBAHB_DOEP0CTL_NAKSTS_SHIFT                      17                                        /**< Shift value for USBAHB_NAKSTS               */
#define _USBAHB_DOEP0CTL_NAKSTS_MASK                       0x20000UL                                 /**< Bit mask for USBAHB_NAKSTS                  */
#define _USBAHB_DOEP0CTL_NAKSTS_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_NAKSTS_DEFAULT                     (_USBAHB_DOEP0CTL_NAKSTS_DEFAULT << 17)   /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */
#define _USBAHB_DOEP0CTL_EPTYPE_SHIFT                      18                                        /**< Shift value for USBAHB_EPTYPE               */
#define _USBAHB_DOEP0CTL_EPTYPE_MASK                       0xC0000UL                                 /**< Bit mask for USBAHB_EPTYPE                  */
#define _USBAHB_DOEP0CTL_EPTYPE_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_EPTYPE_DEFAULT                     (_USBAHB_DOEP0CTL_EPTYPE_DEFAULT << 18)   /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */
#define USBAHB_DOEP0CTL_SNP                                (0x1UL << 20)                             /**< Snoop mode                                  */
#define _USBAHB_DOEP0CTL_SNP_SHIFT                         20                                        /**< Shift value for USBAHB_SNP                  */
#define _USBAHB_DOEP0CTL_SNP_MASK                          0x100000UL                                /**< Bit mask for USBAHB_SNP                     */
#define _USBAHB_DOEP0CTL_SNP_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_SNP_DEFAULT                        (_USBAHB_DOEP0CTL_SNP_DEFAULT << 20)      /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */
#define USBAHB_DOEP0CTL_STALL                              (0x1UL << 21)                             /**< Handshake                                   */
#define _USBAHB_DOEP0CTL_STALL_SHIFT                       21                                        /**< Shift value for USBAHB_STALL                */
#define _USBAHB_DOEP0CTL_STALL_MASK                        0x200000UL                                /**< Bit mask for USBAHB_STALL                   */
#define _USBAHB_DOEP0CTL_STALL_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_STALL_DEFAULT                      (_USBAHB_DOEP0CTL_STALL_DEFAULT << 21)    /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */
#define USBAHB_DOEP0CTL_CNAK                               (0x1UL << 26)                             /**< Clear NAK                                   */
#define _USBAHB_DOEP0CTL_CNAK_SHIFT                        26                                        /**< Shift value for USBAHB_CNAK                 */
#define _USBAHB_DOEP0CTL_CNAK_MASK                         0x4000000UL                               /**< Bit mask for USBAHB_CNAK                    */
#define _USBAHB_DOEP0CTL_CNAK_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_CNAK_DEFAULT                       (_USBAHB_DOEP0CTL_CNAK_DEFAULT << 26)     /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */
#define USBAHB_DOEP0CTL_SNAK                               (0x1UL << 27)                             /**< Set NAK                                     */
#define _USBAHB_DOEP0CTL_SNAK_SHIFT                        27                                        /**< Shift value for USBAHB_SNAK                 */
#define _USBAHB_DOEP0CTL_SNAK_MASK                         0x8000000UL                               /**< Bit mask for USBAHB_SNAK                    */
#define _USBAHB_DOEP0CTL_SNAK_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_SNAK_DEFAULT                       (_USBAHB_DOEP0CTL_SNAK_DEFAULT << 27)     /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */
#define USBAHB_DOEP0CTL_EPDIS                              (0x1UL << 30)                             /**< Endpoint Disable                            */
#define _USBAHB_DOEP0CTL_EPDIS_SHIFT                       30                                        /**< Shift value for USBAHB_EPDIS                */
#define _USBAHB_DOEP0CTL_EPDIS_MASK                        0x40000000UL                              /**< Bit mask for USBAHB_EPDIS                   */
#define _USBAHB_DOEP0CTL_EPDIS_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_EPDIS_DEFAULT                      (_USBAHB_DOEP0CTL_EPDIS_DEFAULT << 30)    /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */
#define USBAHB_DOEP0CTL_EPENA                              (0x1UL << 31)                             /**< Endpoint Enable                             */
#define _USBAHB_DOEP0CTL_EPENA_SHIFT                       31                                        /**< Shift value for USBAHB_EPENA                */
#define _USBAHB_DOEP0CTL_EPENA_MASK                        0x80000000UL                              /**< Bit mask for USBAHB_EPENA                   */
#define _USBAHB_DOEP0CTL_EPENA_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0CTL            */
#define USBAHB_DOEP0CTL_EPENA_DEFAULT                      (_USBAHB_DOEP0CTL_EPENA_DEFAULT << 31)    /**< Shifted mode DEFAULT for USBAHB_DOEP0CTL    */

/* Bit fields for USBAHB DOEP0INT */
#define _USBAHB_DOEP0INT_RESETVALUE                        0x00000000UL                                   /**< Default value for USBAHB_DOEP0INT           */
#define _USBAHB_DOEP0INT_MASK                              0x0000FB7FUL                                   /**< Mask for USBAHB_DOEP0INT                    */
#define USBAHB_DOEP0INT_XFERCOMPL                          (0x1UL << 0)                                   /**< Transfer Completed Interrupt                */
#define _USBAHB_DOEP0INT_XFERCOMPL_SHIFT                   0                                              /**< Shift value for USBAHB_XFERCOMPL            */
#define _USBAHB_DOEP0INT_XFERCOMPL_MASK                    0x1UL                                          /**< Bit mask for USBAHB_XFERCOMPL               */
#define _USBAHB_DOEP0INT_XFERCOMPL_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_XFERCOMPL_DEFAULT                  (_USBAHB_DOEP0INT_XFERCOMPL_DEFAULT << 0)      /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_EPDISBLD                           (0x1UL << 1)                                   /**< Endpoint Disabled Interrupt                 */
#define _USBAHB_DOEP0INT_EPDISBLD_SHIFT                    1                                              /**< Shift value for USBAHB_EPDISBLD             */
#define _USBAHB_DOEP0INT_EPDISBLD_MASK                     0x2UL                                          /**< Bit mask for USBAHB_EPDISBLD                */
#define _USBAHB_DOEP0INT_EPDISBLD_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_EPDISBLD_DEFAULT                   (_USBAHB_DOEP0INT_EPDISBLD_DEFAULT << 1)       /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_AHBERR                             (0x1UL << 2)                                   /**< AHB Error                                   */
#define _USBAHB_DOEP0INT_AHBERR_SHIFT                      2                                              /**< Shift value for USBAHB_AHBERR               */
#define _USBAHB_DOEP0INT_AHBERR_MASK                       0x4UL                                          /**< Bit mask for USBAHB_AHBERR                  */
#define _USBAHB_DOEP0INT_AHBERR_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_AHBERR_DEFAULT                     (_USBAHB_DOEP0INT_AHBERR_DEFAULT << 2)         /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_SETUP                              (0x1UL << 3)                                   /**< Phase Done                                  */
#define _USBAHB_DOEP0INT_SETUP_SHIFT                       3                                              /**< Shift value for USBAHB_SETUP                */
#define _USBAHB_DOEP0INT_SETUP_MASK                        0x8UL                                          /**< Bit mask for USBAHB_SETUP                   */
#define _USBAHB_DOEP0INT_SETUP_DEFAULT                     0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_SETUP_DEFAULT                      (_USBAHB_DOEP0INT_SETUP_DEFAULT << 3)          /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_OUTTKNEPDIS                        (0x1UL << 4)                                   /**< OUT Token recvd When EP Disabled            */
#define _USBAHB_DOEP0INT_OUTTKNEPDIS_SHIFT                 4                                              /**< Shift value for USBAHB_OUTTKNEPDIS          */
#define _USBAHB_DOEP0INT_OUTTKNEPDIS_MASK                  0x10UL                                         /**< Bit mask for USBAHB_OUTTKNEPDIS             */
#define _USBAHB_DOEP0INT_OUTTKNEPDIS_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_OUTTKNEPDIS_DEFAULT                (_USBAHB_DOEP0INT_OUTTKNEPDIS_DEFAULT << 4)    /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_STSPHSERCVD                        (0x1UL << 5)                                   /**< Status Phase recvd for ctrl Write           */
#define _USBAHB_DOEP0INT_STSPHSERCVD_SHIFT                 5                                              /**< Shift value for USBAHB_STSPHSERCVD          */
#define _USBAHB_DOEP0INT_STSPHSERCVD_MASK                  0x20UL                                         /**< Bit mask for USBAHB_STSPHSERCVD             */
#define _USBAHB_DOEP0INT_STSPHSERCVD_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_STSPHSERCVD_DEFAULT                (_USBAHB_DOEP0INT_STSPHSERCVD_DEFAULT << 5)    /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_BACK2BACKSETUP                     (0x1UL << 6)                                   /**< Back-to-Back SETUP Packets recvd            */
#define _USBAHB_DOEP0INT_BACK2BACKSETUP_SHIFT              6                                              /**< Shift value for USBAHB_BACK2BACKSETUP       */
#define _USBAHB_DOEP0INT_BACK2BACKSETUP_MASK               0x40UL                                         /**< Bit mask for USBAHB_BACK2BACKSETUP          */
#define _USBAHB_DOEP0INT_BACK2BACKSETUP_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_BACK2BACKSETUP_DEFAULT             (_USBAHB_DOEP0INT_BACK2BACKSETUP_DEFAULT << 6) /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_OUTPKTERR                          (0x1UL << 8)                                   /**< OUT Packet Error                            */
#define _USBAHB_DOEP0INT_OUTPKTERR_SHIFT                   8                                              /**< Shift value for USBAHB_OUTPKTERR            */
#define _USBAHB_DOEP0INT_OUTPKTERR_MASK                    0x100UL                                        /**< Bit mask for USBAHB_OUTPKTERR               */
#define _USBAHB_DOEP0INT_OUTPKTERR_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_OUTPKTERR_DEFAULT                  (_USBAHB_DOEP0INT_OUTPKTERR_DEFAULT << 8)      /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_BNAINTR                            (0x1UL << 9)                                   /**< BNA (Buffer Not Available) IRQ              */
#define _USBAHB_DOEP0INT_BNAINTR_SHIFT                     9                                              /**< Shift value for USBAHB_BNAINTR              */
#define _USBAHB_DOEP0INT_BNAINTR_MASK                      0x200UL                                        /**< Bit mask for USBAHB_BNAINTR                 */
#define _USBAHB_DOEP0INT_BNAINTR_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_BNAINTR_DEFAULT                    (_USBAHB_DOEP0INT_BNAINTR_DEFAULT << 9)        /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_PKTDRPSTS                          (0x1UL << 11)                                  /**< Packet Drop Status                          */
#define _USBAHB_DOEP0INT_PKTDRPSTS_SHIFT                   11                                             /**< Shift value for USBAHB_PKTDRPSTS            */
#define _USBAHB_DOEP0INT_PKTDRPSTS_MASK                    0x800UL                                        /**< Bit mask for USBAHB_PKTDRPSTS               */
#define _USBAHB_DOEP0INT_PKTDRPSTS_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_PKTDRPSTS_DEFAULT                  (_USBAHB_DOEP0INT_PKTDRPSTS_DEFAULT << 11)     /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_BBLEERR                            (0x1UL << 12)                                  /**< Babble Interrupt                            */
#define _USBAHB_DOEP0INT_BBLEERR_SHIFT                     12                                             /**< Shift value for USBAHB_BBLEERR              */
#define _USBAHB_DOEP0INT_BBLEERR_MASK                      0x1000UL                                       /**< Bit mask for USBAHB_BBLEERR                 */
#define _USBAHB_DOEP0INT_BBLEERR_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_BBLEERR_DEFAULT                    (_USBAHB_DOEP0INT_BBLEERR_DEFAULT << 12)       /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_NAKINTRPT                          (0x1UL << 13)                                  /**< NAK Interrupt                               */
#define _USBAHB_DOEP0INT_NAKINTRPT_SHIFT                   13                                             /**< Shift value for USBAHB_NAKINTRPT            */
#define _USBAHB_DOEP0INT_NAKINTRPT_MASK                    0x2000UL                                       /**< Bit mask for USBAHB_NAKINTRPT               */
#define _USBAHB_DOEP0INT_NAKINTRPT_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_NAKINTRPT_DEFAULT                  (_USBAHB_DOEP0INT_NAKINTRPT_DEFAULT << 13)     /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_NYETINTRPT                         (0x1UL << 14)                                  /**< NYET Interrupt                              */
#define _USBAHB_DOEP0INT_NYETINTRPT_SHIFT                  14                                             /**< Shift value for USBAHB_NYETINTRPT           */
#define _USBAHB_DOEP0INT_NYETINTRPT_MASK                   0x4000UL                                       /**< Bit mask for USBAHB_NYETINTRPT              */
#define _USBAHB_DOEP0INT_NYETINTRPT_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_NYETINTRPT_DEFAULT                 (_USBAHB_DOEP0INT_NYETINTRPT_DEFAULT << 14)    /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */
#define USBAHB_DOEP0INT_STUPPKTRCVD                        (0x1UL << 15)                                  /**< Setup Packet Received                       */
#define _USBAHB_DOEP0INT_STUPPKTRCVD_SHIFT                 15                                             /**< Shift value for USBAHB_STUPPKTRCVD          */
#define _USBAHB_DOEP0INT_STUPPKTRCVD_MASK                  0x8000UL                                       /**< Bit mask for USBAHB_STUPPKTRCVD             */
#define _USBAHB_DOEP0INT_STUPPKTRCVD_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for USBAHB_DOEP0INT            */
#define USBAHB_DOEP0INT_STUPPKTRCVD_DEFAULT                (_USBAHB_DOEP0INT_STUPPKTRCVD_DEFAULT << 15)   /**< Shifted mode DEFAULT for USBAHB_DOEP0INT    */

/* Bit fields for USBAHB DOEP0TSIZ */
#define _USBAHB_DOEP0TSIZ_RESETVALUE                       0x00000000UL                              /**< Default value for USBAHB_DOEP0TSIZ          */
#define _USBAHB_DOEP0TSIZ_MASK                             0x6008007FUL                              /**< Mask for USBAHB_DOEP0TSIZ                   */
#define _USBAHB_DOEP0TSIZ_XFERSIZE_SHIFT                   0                                         /**< Shift value for USBAHB_XFERSIZE             */
#define _USBAHB_DOEP0TSIZ_XFERSIZE_MASK                    0x7FUL                                    /**< Bit mask for USBAHB_XFERSIZE                */
#define _USBAHB_DOEP0TSIZ_XFERSIZE_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0TSIZ           */
#define USBAHB_DOEP0TSIZ_XFERSIZE_DEFAULT                  (_USBAHB_DOEP0TSIZ_XFERSIZE_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DOEP0TSIZ   */
#define USBAHB_DOEP0TSIZ_PKTCNT                            (0x1UL << 19)                             /**< Packet Count                                */
#define _USBAHB_DOEP0TSIZ_PKTCNT_SHIFT                     19                                        /**< Shift value for USBAHB_PKTCNT               */
#define _USBAHB_DOEP0TSIZ_PKTCNT_MASK                      0x80000UL                                 /**< Bit mask for USBAHB_PKTCNT                  */
#define _USBAHB_DOEP0TSIZ_PKTCNT_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0TSIZ           */
#define USBAHB_DOEP0TSIZ_PKTCNT_DEFAULT                    (_USBAHB_DOEP0TSIZ_PKTCNT_DEFAULT << 19)  /**< Shifted mode DEFAULT for USBAHB_DOEP0TSIZ   */
#define _USBAHB_DOEP0TSIZ_SUPCNT_SHIFT                     29                                        /**< Shift value for USBAHB_SUPCNT               */
#define _USBAHB_DOEP0TSIZ_SUPCNT_MASK                      0x60000000UL                              /**< Bit mask for USBAHB_SUPCNT                  */
#define _USBAHB_DOEP0TSIZ_SUPCNT_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for USBAHB_DOEP0TSIZ           */
#define USBAHB_DOEP0TSIZ_SUPCNT_DEFAULT                    (_USBAHB_DOEP0TSIZ_SUPCNT_DEFAULT << 29)  /**< Shifted mode DEFAULT for USBAHB_DOEP0TSIZ   */

/* Bit fields for USBAHB DOEP0DMAADDR */
#define _USBAHB_DOEP0DMAADDR_RESETVALUE                    0x00000000UL                                /**< Default value for USBAHB_DOEP0DMAADDR       */
#define _USBAHB_DOEP0DMAADDR_MASK                          0xFFFFFFFFUL                                /**< Mask for USBAHB_DOEP0DMAADDR                */
#define _USBAHB_DOEP0DMAADDR_DMAADDR_SHIFT                 0                                           /**< Shift value for USBAHB_DMAADDR              */
#define _USBAHB_DOEP0DMAADDR_DMAADDR_MASK                  0xFFFFFFFFUL                                /**< Bit mask for USBAHB_DMAADDR                 */
#define _USBAHB_DOEP0DMAADDR_DMAADDR_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for USBAHB_DOEP0DMAADDR        */
#define USBAHB_DOEP0DMAADDR_DMAADDR_DEFAULT                (_USBAHB_DOEP0DMAADDR_DMAADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DOEP0DMAADDR*/

