espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DEVOUTEP_CTL */
#define _USBAHB_DEVOUTEP_CTL_RESETVALUE                    0x00000000UL                                    /**< Default value for USBAHB_DEVOUTEP_CTL       */
#define _USBAHB_DEVOUTEP_CTL_MASK                          0xFC3F87FFUL                                    /**< Mask for USBAHB_DEVOUTEP_CTL                */
#define _USBAHB_DEVOUTEP_CTL_MPS_SHIFT                     0                                               /**< Shift value for USBAHB_MPS                  */
#define _USBAHB_DEVOUTEP_CTL_MPS_MASK                      0x7FFUL                                         /**< Bit mask for USBAHB_MPS                     */
#define _USBAHB_DEVOUTEP_CTL_MPS_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_MPS_DEFAULT                    (_USBAHB_DEVOUTEP_CTL_MPS_DEFAULT << 0)         /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_USBACTEP                       (0x1UL << 15)                                   /**< USB Active Endpoint                         */
#define _USBAHB_DEVOUTEP_CTL_USBACTEP_SHIFT                15                                              /**< Shift value for USBAHB_USBACTEP             */
#define _USBAHB_DEVOUTEP_CTL_USBACTEP_MASK                 0x8000UL                                        /**< Bit mask for USBAHB_USBACTEP                */
#define _USBAHB_DEVOUTEP_CTL_USBACTEP_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_USBACTEP_DEFAULT               (_USBAHB_DEVOUTEP_CTL_USBACTEP_DEFAULT << 15)   /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_DPID                           (0x1UL << 16)                                   /**< Endpoint Data PID                           */
#define _USBAHB_DEVOUTEP_CTL_DPID_SHIFT                    16                                              /**< Shift value for USBAHB_DPID                 */
#define _USBAHB_DEVOUTEP_CTL_DPID_MASK                     0x10000UL                                       /**< Bit mask for USBAHB_DPID                    */
#define _USBAHB_DEVOUTEP_CTL_DPID_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_DPID_DEFAULT                   (_USBAHB_DEVOUTEP_CTL_DPID_DEFAULT << 16)       /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_NAKSTS                         (0x1UL << 17)                                   /**< NAK Status                                  */
#define _USBAHB_DEVOUTEP_CTL_NAKSTS_SHIFT                  17                                              /**< Shift value for USBAHB_NAKSTS               */
#define _USBAHB_DEVOUTEP_CTL_NAKSTS_MASK                   0x20000UL                                       /**< Bit mask for USBAHB_NAKSTS                  */
#define _USBAHB_DEVOUTEP_CTL_NAKSTS_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_NAKSTS_DEFAULT                 (_USBAHB_DEVOUTEP_CTL_NAKSTS_DEFAULT << 17)     /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define _USBAHB_DEVOUTEP_CTL_EPTYPE_SHIFT                  18                                              /**< Shift value for USBAHB_EPTYPE               */
#define _USBAHB_DEVOUTEP_CTL_EPTYPE_MASK                   0xC0000UL                                       /**< Bit mask for USBAHB_EPTYPE                  */
#define _USBAHB_DEVOUTEP_CTL_EPTYPE_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_EPTYPE_DEFAULT                 (_USBAHB_DEVOUTEP_CTL_EPTYPE_DEFAULT << 18)     /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_SNP                            (0x1UL << 20)                                   /**< Snoop Mode                                  */
#define _USBAHB_DEVOUTEP_CTL_SNP_SHIFT                     20                                              /**< Shift value for USBAHB_SNP                  */
#define _USBAHB_DEVOUTEP_CTL_SNP_MASK                      0x100000UL                                      /**< Bit mask for USBAHB_SNP                     */
#define _USBAHB_DEVOUTEP_CTL_SNP_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_SNP_DEFAULT                    (_USBAHB_DEVOUTEP_CTL_SNP_DEFAULT << 20)        /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_STALL                          (0x1UL << 21)                                   /**< Handshake                                   */
#define _USBAHB_DEVOUTEP_CTL_STALL_SHIFT                   21                                              /**< Shift value for USBAHB_STALL                */
#define _USBAHB_DEVOUTEP_CTL_STALL_MASK                    0x200000UL                                      /**< Bit mask for USBAHB_STALL                   */
#define _USBAHB_DEVOUTEP_CTL_STALL_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_STALL_DEFAULT                  (_USBAHB_DEVOUTEP_CTL_STALL_DEFAULT << 21)      /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_CNAK                           (0x1UL << 26)                                   /**< Clear NAK                                   */
#define _USBAHB_DEVOUTEP_CTL_CNAK_SHIFT                    26                                              /**< Shift value for USBAHB_CNAK                 */
#define _USBAHB_DEVOUTEP_CTL_CNAK_MASK                     0x4000000UL                                     /**< Bit mask for USBAHB_CNAK                    */
#define _USBAHB_DEVOUTEP_CTL_CNAK_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_CNAK_DEFAULT                   (_USBAHB_DEVOUTEP_CTL_CNAK_DEFAULT << 26)       /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_SNAK                           (0x1UL << 27)                                   /**< Set NAK                                     */
#define _USBAHB_DEVOUTEP_CTL_SNAK_SHIFT                    27                                              /**< Shift value for USBAHB_SNAK                 */
#define _USBAHB_DEVOUTEP_CTL_SNAK_MASK                     0x8000000UL                                     /**< Bit mask for USBAHB_SNAK                    */
#define _USBAHB_DEVOUTEP_CTL_SNAK_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_SNAK_DEFAULT                   (_USBAHB_DEVOUTEP_CTL_SNAK_DEFAULT << 27)       /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_SETD0PIDEF                     (0x1UL << 28)                                   /**< Set DATA0 PID, even fr                      */
#define _USBAHB_DEVOUTEP_CTL_SETD0PIDEF_SHIFT              28                                              /**< Shift value for USBAHB_SETD0PIDEF           */
#define _USBAHB_DEVOUTEP_CTL_SETD0PIDEF_MASK               0x10000000UL                                    /**< Bit mask for USBAHB_SETD0PIDEF              */
#define _USBAHB_DEVOUTEP_CTL_SETD0PIDEF_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_SETD0PIDEF_DEFAULT             (_USBAHB_DEVOUTEP_CTL_SETD0PIDEF_DEFAULT << 28) /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_SETD1PIDOF                     (0x1UL << 29)                                   /**< Set DATA1 PID, odd fr                       */
#define _USBAHB_DEVOUTEP_CTL_SETD1PIDOF_SHIFT              29                                              /**< Shift value for USBAHB_SETD1PIDOF           */
#define _USBAHB_DEVOUTEP_CTL_SETD1PIDOF_MASK               0x20000000UL                                    /**< Bit mask for USBAHB_SETD1PIDOF              */
#define _USBAHB_DEVOUTEP_CTL_SETD1PIDOF_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_SETD1PIDOF_DEFAULT             (_USBAHB_DEVOUTEP_CTL_SETD1PIDOF_DEFAULT << 29) /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_EPDIS                          (0x1UL << 30)                                   /**< Endpoint Disable                            */
#define _USBAHB_DEVOUTEP_CTL_EPDIS_SHIFT                   30                                              /**< Shift value for USBAHB_EPDIS                */
#define _USBAHB_DEVOUTEP_CTL_EPDIS_MASK                    0x40000000UL                                    /**< Bit mask for USBAHB_EPDIS                   */
#define _USBAHB_DEVOUTEP_CTL_EPDIS_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_EPDIS_DEFAULT                  (_USBAHB_DEVOUTEP_CTL_EPDIS_DEFAULT << 30)      /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/
#define USBAHB_DEVOUTEP_CTL_EPENA                          (0x1UL << 31)                                   /**< Endpoint Enable                             */
#define _USBAHB_DEVOUTEP_CTL_EPENA_SHIFT                   31                                              /**< Shift value for USBAHB_EPENA                */
#define _USBAHB_DEVOUTEP_CTL_EPENA_MASK                    0x80000000UL                                    /**< Bit mask for USBAHB_EPENA                   */
#define _USBAHB_DEVOUTEP_CTL_EPENA_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_CTL        */
#define USBAHB_DEVOUTEP_CTL_EPENA_DEFAULT                  (_USBAHB_DEVOUTEP_CTL_EPENA_DEFAULT << 31)      /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_CTL*/

