espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DEVOUTEP_INT */
#define _USBAHB_DEVOUTEP_INT_RESETVALUE                    0x00000000UL                                       /**< Default value for USBAHB_DEVOUTEP_INT       */
#define _USBAHB_DEVOUTEP_INT_MASK                          0x0000FB7FUL                                       /**< Mask for USBAHB_DEVOUTEP_INT                */
#define USBAHB_DEVOUTEP_INT_XFERCOMPL                      (0x1UL << 0)                                       /**< Transfer Completed Interrupt                */
#define _USBAHB_DEVOUTEP_INT_XFERCOMPL_SHIFT               0                                                  /**< Shift value for USBAHB_XFERCOMPL            */
#define _USBAHB_DEVOUTEP_INT_XFERCOMPL_MASK                0x1UL                                              /**< Bit mask for USBAHB_XFERCOMPL               */
#define _USBAHB_DEVOUTEP_INT_XFERCOMPL_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_XFERCOMPL_DEFAULT              (_USBAHB_DEVOUTEP_INT_XFERCOMPL_DEFAULT << 0)      /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_EPDISBLD                       (0x1UL << 1)                                       /**< Endpoint Disabled Interrupt                 */
#define _USBAHB_DEVOUTEP_INT_EPDISBLD_SHIFT                1                                                  /**< Shift value for USBAHB_EPDISBLD             */
#define _USBAHB_DEVOUTEP_INT_EPDISBLD_MASK                 0x2UL                                              /**< Bit mask for USBAHB_EPDISBLD                */
#define _USBAHB_DEVOUTEP_INT_EPDISBLD_DEFAULT              0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_EPDISBLD_DEFAULT               (_USBAHB_DEVOUTEP_INT_EPDISBLD_DEFAULT << 1)       /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_AHBERR                         (0x1UL << 2)                                       /**< AHB Error                                   */
#define _USBAHB_DEVOUTEP_INT_AHBERR_SHIFT                  2                                                  /**< Shift value for USBAHB_AHBERR               */
#define _USBAHB_DEVOUTEP_INT_AHBERR_MASK                   0x4UL                                              /**< Bit mask for USBAHB_AHBERR                  */
#define _USBAHB_DEVOUTEP_INT_AHBERR_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_AHBERR_DEFAULT                 (_USBAHB_DEVOUTEP_INT_AHBERR_DEFAULT << 2)         /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_SETUP                          (0x1UL << 3)                                       /**< Phase Done                                  */
#define _USBAHB_DEVOUTEP_INT_SETUP_SHIFT                   3                                                  /**< Shift value for USBAHB_SETUP                */
#define _USBAHB_DEVOUTEP_INT_SETUP_MASK                    0x8UL                                              /**< Bit mask for USBAHB_SETUP                   */
#define _USBAHB_DEVOUTEP_INT_SETUP_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_SETUP_DEFAULT                  (_USBAHB_DEVOUTEP_INT_SETUP_DEFAULT << 3)          /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_OUTTKNEPDIS                    (0x1UL << 4)                                       /**< OUT Token recvd when EP Disabled            */
#define _USBAHB_DEVOUTEP_INT_OUTTKNEPDIS_SHIFT             4                                                  /**< Shift value for USBAHB_OUTTKNEPDIS          */
#define _USBAHB_DEVOUTEP_INT_OUTTKNEPDIS_MASK              0x10UL                                             /**< Bit mask for USBAHB_OUTTKNEPDIS             */
#define _USBAHB_DEVOUTEP_INT_OUTTKNEPDIS_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_OUTTKNEPDIS_DEFAULT            (_USBAHB_DEVOUTEP_INT_OUTTKNEPDIS_DEFAULT << 4)    /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_STSPHSERCVD                    (0x1UL << 5)                                       /**< Status Phase recvd For ctrl Write           */
#define _USBAHB_DEVOUTEP_INT_STSPHSERCVD_SHIFT             5                                                  /**< Shift value for USBAHB_STSPHSERCVD          */
#define _USBAHB_DEVOUTEP_INT_STSPHSERCVD_MASK              0x20UL                                             /**< Bit mask for USBAHB_STSPHSERCVD             */
#define _USBAHB_DEVOUTEP_INT_STSPHSERCVD_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_STSPHSERCVD_DEFAULT            (_USBAHB_DEVOUTEP_INT_STSPHSERCVD_DEFAULT << 5)    /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_BACK2BACKSETUP                 (0x1UL << 6)                                       /**< Back-to-Back SETUP Packets recvd            */
#define _USBAHB_DEVOUTEP_INT_BACK2BACKSETUP_SHIFT          6                                                  /**< Shift value for USBAHB_BACK2BACKSETUP       */
#define _USBAHB_DEVOUTEP_INT_BACK2BACKSETUP_MASK           0x40UL                                             /**< Bit mask for USBAHB_BACK2BACKSETUP          */
#define _USBAHB_DEVOUTEP_INT_BACK2BACKSETUP_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_BACK2BACKSETUP_DEFAULT         (_USBAHB_DEVOUTEP_INT_BACK2BACKSETUP_DEFAULT << 6) /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_OUTPKTERR                      (0x1UL << 8)                                       /**< OUT Packet Error                            */
#define _USBAHB_DEVOUTEP_INT_OUTPKTERR_SHIFT               8                                                  /**< Shift value for USBAHB_OUTPKTERR            */
#define _USBAHB_DEVOUTEP_INT_OUTPKTERR_MASK                0x100UL                                            /**< Bit mask for USBAHB_OUTPKTERR               */
#define _USBAHB_DEVOUTEP_INT_OUTPKTERR_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_OUTPKTERR_DEFAULT              (_USBAHB_DEVOUTEP_INT_OUTPKTERR_DEFAULT << 8)      /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_BNAINTR                        (0x1UL << 9)                                       /**< BNA (Buffer Not Available) IRQ              */
#define _USBAHB_DEVOUTEP_INT_BNAINTR_SHIFT                 9                                                  /**< Shift value for USBAHB_BNAINTR              */
#define _USBAHB_DEVOUTEP_INT_BNAINTR_MASK                  0x200UL                                            /**< Bit mask for USBAHB_BNAINTR                 */
#define _USBAHB_DEVOUTEP_INT_BNAINTR_DEFAULT               0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_BNAINTR_DEFAULT                (_USBAHB_DEVOUTEP_INT_BNAINTR_DEFAULT << 9)        /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_PKTDRPSTS                      (0x1UL << 11)                                      /**< Packet Drop Status                          */
#define _USBAHB_DEVOUTEP_INT_PKTDRPSTS_SHIFT               11                                                 /**< Shift value for USBAHB_PKTDRPSTS            */
#define _USBAHB_DEVOUTEP_INT_PKTDRPSTS_MASK                0x800UL                                            /**< Bit mask for USBAHB_PKTDRPSTS               */
#define _USBAHB_DEVOUTEP_INT_PKTDRPSTS_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_PKTDRPSTS_DEFAULT              (_USBAHB_DEVOUTEP_INT_PKTDRPSTS_DEFAULT << 11)     /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_BBLEERR                        (0x1UL << 12)                                      /**< Babble Error Interupt                       */
#define _USBAHB_DEVOUTEP_INT_BBLEERR_SHIFT                 12                                                 /**< Shift value for USBAHB_BBLEERR              */
#define _USBAHB_DEVOUTEP_INT_BBLEERR_MASK                  0x1000UL                                           /**< Bit mask for USBAHB_BBLEERR                 */
#define _USBAHB_DEVOUTEP_INT_BBLEERR_DEFAULT               0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_BBLEERR_DEFAULT                (_USBAHB_DEVOUTEP_INT_BBLEERR_DEFAULT << 12)       /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_NAKINTRPT                      (0x1UL << 13)                                      /**< NAK Interrupt                               */
#define _USBAHB_DEVOUTEP_INT_NAKINTRPT_SHIFT               13                                                 /**< Shift value for USBAHB_NAKINTRPT            */
#define _USBAHB_DEVOUTEP_INT_NAKINTRPT_MASK                0x2000UL                                           /**< Bit mask for USBAHB_NAKINTRPT               */
#define _USBAHB_DEVOUTEP_INT_NAKINTRPT_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_NAKINTRPT_DEFAULT              (_USBAHB_DEVOUTEP_INT_NAKINTRPT_DEFAULT << 13)     /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_NYETINTRPT                     (0x1UL << 14)                                      /**< NYET Interrupt                              */
#define _USBAHB_DEVOUTEP_INT_NYETINTRPT_SHIFT              14                                                 /**< Shift value for USBAHB_NYETINTRPT           */
#define _USBAHB_DEVOUTEP_INT_NYETINTRPT_MASK               0x4000UL                                           /**< Bit mask for USBAHB_NYETINTRPT              */
#define _USBAHB_DEVOUTEP_INT_NYETINTRPT_DEFAULT            0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_NYETINTRPT_DEFAULT             (_USBAHB_DEVOUTEP_INT_NYETINTRPT_DEFAULT << 14)    /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/
#define USBAHB_DEVOUTEP_INT_STUPPKTRCVD                    (0x1UL << 15)                                      /**< Setup PKT received Interrupt                */
#define _USBAHB_DEVOUTEP_INT_STUPPKTRCVD_SHIFT             15                                                 /**< Shift value for USBAHB_STUPPKTRCVD          */
#define _USBAHB_DEVOUTEP_INT_STUPPKTRCVD_MASK              0x8000UL                                           /**< Bit mask for USBAHB_STUPPKTRCVD             */
#define _USBAHB_DEVOUTEP_INT_STUPPKTRCVD_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_INT        */
#define USBAHB_DEVOUTEP_INT_STUPPKTRCVD_DEFAULT            (_USBAHB_DEVOUTEP_INT_STUPPKTRCVD_DEFAULT << 15)   /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_INT*/

