espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_usbahb.h
/* Bit fields for USBAHB DEVOUTEP_TSIZ */
#define _USBAHB_DEVOUTEP_TSIZ_RESETVALUE                   0x00000000UL                                       /**< Default value for USBAHB_DEVOUTEP_TSIZ      */
#define _USBAHB_DEVOUTEP_TSIZ_MASK                         0x7FFFFFFFUL                                       /**< Mask for USBAHB_DEVOUTEP_TSIZ               */
#define _USBAHB_DEVOUTEP_TSIZ_XFERSIZE_SHIFT               0                                                  /**< Shift value for USBAHB_XFERSIZE             */
#define _USBAHB_DEVOUTEP_TSIZ_XFERSIZE_MASK                0x7FFFFUL                                          /**< Bit mask for USBAHB_XFERSIZE                */
#define _USBAHB_DEVOUTEP_TSIZ_XFERSIZE_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_TSIZ       */
#define USBAHB_DEVOUTEP_TSIZ_XFERSIZE_DEFAULT              (_USBAHB_DEVOUTEP_TSIZ_XFERSIZE_DEFAULT << 0)      /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_TSIZ*/
#define _USBAHB_DEVOUTEP_TSIZ_PKTCNT_SHIFT                 19                                                 /**< Shift value for USBAHB_PKTCNT               */
#define _USBAHB_DEVOUTEP_TSIZ_PKTCNT_MASK                  0x1FF80000UL                                       /**< Bit mask for USBAHB_PKTCNT                  */
#define _USBAHB_DEVOUTEP_TSIZ_PKTCNT_DEFAULT               0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_TSIZ       */
#define USBAHB_DEVOUTEP_TSIZ_PKTCNT_DEFAULT                (_USBAHB_DEVOUTEP_TSIZ_PKTCNT_DEFAULT << 19)       /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_TSIZ*/
#define _USBAHB_DEVOUTEP_TSIZ_RXDPIDSUPCNT_SHIFT           29                                                 /**< Shift value for USBAHB_RXDPIDSUPCNT         */
#define _USBAHB_DEVOUTEP_TSIZ_RXDPIDSUPCNT_MASK            0x60000000UL                                       /**< Bit mask for USBAHB_RXDPIDSUPCNT            */
#define _USBAHB_DEVOUTEP_TSIZ_RXDPIDSUPCNT_DEFAULT         0x00000000UL                                       /**< Mode DEFAULT for USBAHB_DEVOUTEP_TSIZ       */
#define USBAHB_DEVOUTEP_TSIZ_RXDPIDSUPCNT_DEFAULT          (_USBAHB_DEVOUTEP_TSIZ_RXDPIDSUPCNT_DEFAULT << 29) /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_TSIZ*/

/* Bit fields for USBAHB DEVOUTEP_DMAADDR */
#define _USBAHB_DEVOUTEP_DMAADDR_RESETVALUE                0x00000000UL                                    /**< Default value for USBAHB_DEVOUTEP_DMAADDR   */
#define _USBAHB_DEVOUTEP_DMAADDR_MASK                      0xFFFFFFFFUL                                    /**< Mask for USBAHB_DEVOUTEP_DMAADDR            */
#define _USBAHB_DEVOUTEP_DMAADDR_DMAADDR_SHIFT             0                                               /**< Shift value for USBAHB_DMAADDR              */
#define _USBAHB_DEVOUTEP_DMAADDR_DMAADDR_MASK              0xFFFFFFFFUL                                    /**< Bit mask for USBAHB_DMAADDR                 */
#define _USBAHB_DEVOUTEP_DMAADDR_DMAADDR_DEFAULT           0x00000000UL                                    /**< Mode DEFAULT for USBAHB_DEVOUTEP_DMAADDR    */
#define USBAHB_DEVOUTEP_DMAADDR_DMAADDR_DEFAULT            (_USBAHB_DEVOUTEP_DMAADDR_DMAADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_DEVOUTEP_DMAADDR*/

/* Bit fields for USBAHB PCGCCTL */
#define _USBAHB_PCGCCTL_RESETVALUE                         0x00000000UL                                 /**< Default value for USBAHB_PCGCCTL            */
#define _USBAHB_PCGCCTL_MASK                               0x000000CFUL                                 /**< Mask for USBAHB_PCGCCTL                     */
#define USBAHB_PCGCCTL_STOPPCLK                            (0x1UL << 0)                                 /**< Stop Pclk                                   */
#define _USBAHB_PCGCCTL_STOPPCLK_SHIFT                     0                                            /**< Shift value for USBAHB_STOPPCLK             */
#define _USBAHB_PCGCCTL_STOPPCLK_MASK                      0x1UL                                        /**< Bit mask for USBAHB_STOPPCLK                */
#define _USBAHB_PCGCCTL_STOPPCLK_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for USBAHB_PCGCCTL             */
#define USBAHB_PCGCCTL_STOPPCLK_DEFAULT                    (_USBAHB_PCGCCTL_STOPPCLK_DEFAULT << 0)      /**< Shifted mode DEFAULT for USBAHB_PCGCCTL     */
#define USBAHB_PCGCCTL_GATEHCLK                            (0x1UL << 1)                                 /**< Gate HCLK                                   */
#define _USBAHB_PCGCCTL_GATEHCLK_SHIFT                     1                                            /**< Shift value for USBAHB_GATEHCLK             */
#define _USBAHB_PCGCCTL_GATEHCLK_MASK                      0x2UL                                        /**< Bit mask for USBAHB_GATEHCLK                */
#define _USBAHB_PCGCCTL_GATEHCLK_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for USBAHB_PCGCCTL             */
#define USBAHB_PCGCCTL_GATEHCLK_DEFAULT                    (_USBAHB_PCGCCTL_GATEHCLK_DEFAULT << 1)      /**< Shifted mode DEFAULT for USBAHB_PCGCCTL     */
#define USBAHB_PCGCCTL_PWRCLMP                             (0x1UL << 2)                                 /**< Power Clamp                                 */
#define _USBAHB_PCGCCTL_PWRCLMP_SHIFT                      2                                            /**< Shift value for USBAHB_PWRCLMP              */
#define _USBAHB_PCGCCTL_PWRCLMP_MASK                       0x4UL                                        /**< Bit mask for USBAHB_PWRCLMP                 */
#define _USBAHB_PCGCCTL_PWRCLMP_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for USBAHB_PCGCCTL             */
#define USBAHB_PCGCCTL_PWRCLMP_DEFAULT                     (_USBAHB_PCGCCTL_PWRCLMP_DEFAULT << 2)       /**< Shifted mode DEFAULT for USBAHB_PCGCCTL     */
#define USBAHB_PCGCCTL_RSTPDWNMODULE                       (0x1UL << 3)                                 /**< RST Power-Down Modules                      */
#define _USBAHB_PCGCCTL_RSTPDWNMODULE_SHIFT                3                                            /**< Shift value for USBAHB_RSTPDWNMODULE        */
#define _USBAHB_PCGCCTL_RSTPDWNMODULE_MASK                 0x8UL                                        /**< Bit mask for USBAHB_RSTPDWNMODULE           */
#define _USBAHB_PCGCCTL_RSTPDWNMODULE_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for USBAHB_PCGCCTL             */
#define USBAHB_PCGCCTL_RSTPDWNMODULE_DEFAULT               (_USBAHB_PCGCCTL_RSTPDWNMODULE_DEFAULT << 3) /**< Shifted mode DEFAULT for USBAHB_PCGCCTL     */
#define USBAHB_PCGCCTL_PHYSLEEP                            (0x1UL << 6)                                 /**< New BitField                                */
#define _USBAHB_PCGCCTL_PHYSLEEP_SHIFT                     6                                            /**< Shift value for USBAHB_PHYSLEEP             */
#define _USBAHB_PCGCCTL_PHYSLEEP_MASK                      0x40UL                                       /**< Bit mask for USBAHB_PHYSLEEP                */
#define _USBAHB_PCGCCTL_PHYSLEEP_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for USBAHB_PCGCCTL             */
#define USBAHB_PCGCCTL_PHYSLEEP_DEFAULT                    (_USBAHB_PCGCCTL_PHYSLEEP_DEFAULT << 6)      /**< Shifted mode DEFAULT for USBAHB_PCGCCTL     */
#define USBAHB_PCGCCTL_L1SUSPENDED                         (0x1UL << 7)                                 /**< New BitField                                */
#define _USBAHB_PCGCCTL_L1SUSPENDED_SHIFT                  7                                            /**< Shift value for USBAHB_L1SUSPENDED          */
#define _USBAHB_PCGCCTL_L1SUSPENDED_MASK                   0x80UL                                       /**< Bit mask for USBAHB_L1SUSPENDED             */
#define _USBAHB_PCGCCTL_L1SUSPENDED_DEFAULT                0x00000000UL                                 /**< Mode DEFAULT for USBAHB_PCGCCTL             */
#define USBAHB_PCGCCTL_L1SUSPENDED_DEFAULT                 (_USBAHB_PCGCCTL_L1SUSPENDED_DEFAULT << 7)   /**< Shifted mode DEFAULT for USBAHB_PCGCCTL     */

/* Bit fields for USBAHB FIFO0D */
#define _USBAHB_FIFO0D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO0D             */
#define _USBAHB_FIFO0D_MASK                                0xFFFFFFFFUL                         /**< Mask for USBAHB_FIFO0D                      */
#define _USBAHB_FIFO0D_FIFO0D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO0D               */
#define _USBAHB_FIFO0D_FIFO0D_MASK                         0xFFFFFFFFUL                         /**< Bit mask for USBAHB_FIFO0D                  */
#define _USBAHB_FIFO0D_FIFO0D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO0D              */
#define USBAHB_FIFO0D_FIFO0D_DEFAULT                       (_USBAHB_FIFO0D_FIFO0D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO0D      */

/* Bit fields for USBAHB FIFO1D */
#define _USBAHB_FIFO1D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO1D             */
#define _USBAHB_FIFO1D_MASK                                0xFFFFFFFFUL                         /**< Mask for USBAHB_FIFO1D                      */
#define _USBAHB_FIFO1D_FIFO1D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO1D               */
#define _USBAHB_FIFO1D_FIFO1D_MASK                         0xFFFFFFFFUL                         /**< Bit mask for USBAHB_FIFO1D                  */
#define _USBAHB_FIFO1D_FIFO1D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO1D              */
#define USBAHB_FIFO1D_FIFO1D_DEFAULT                       (_USBAHB_FIFO1D_FIFO1D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO1D      */

/* Bit fields for USBAHB FIFO2D */
#define _USBAHB_FIFO2D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO2D             */
#define _USBAHB_FIFO2D_MASK                                0xFFFFFFFFUL                         /**< Mask for USBAHB_FIFO2D                      */
#define _USBAHB_FIFO2D_FIFO2D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO2D               */
#define _USBAHB_FIFO2D_FIFO2D_MASK                         0xFFFFFFFFUL                         /**< Bit mask for USBAHB_FIFO2D                  */
#define _USBAHB_FIFO2D_FIFO2D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO2D              */
#define USBAHB_FIFO2D_FIFO2D_DEFAULT                       (_USBAHB_FIFO2D_FIFO2D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO2D      */

/* Bit fields for USBAHB FIFO3D */
#define _USBAHB_FIFO3D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO3D             */
#define _USBAHB_FIFO3D_MASK                                0x00000001UL                         /**< Mask for USBAHB_FIFO3D                      */
#define USBAHB_FIFO3D_FIFO3D                               (0x1UL << 0)                         /**< EP 3 Data                                   */
#define _USBAHB_FIFO3D_FIFO3D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO3D               */
#define _USBAHB_FIFO3D_FIFO3D_MASK                         0x1UL                                /**< Bit mask for USBAHB_FIFO3D                  */
#define _USBAHB_FIFO3D_FIFO3D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO3D              */
#define USBAHB_FIFO3D_FIFO3D_DEFAULT                       (_USBAHB_FIFO3D_FIFO3D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO3D      */

/* Bit fields for USBAHB FIFO4D */
#define _USBAHB_FIFO4D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO4D             */
#define _USBAHB_FIFO4D_MASK                                0xFFFFFFFFUL                         /**< Mask for USBAHB_FIFO4D                      */
#define _USBAHB_FIFO4D_FIFO4D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO4D               */
#define _USBAHB_FIFO4D_FIFO4D_MASK                         0xFFFFFFFFUL                         /**< Bit mask for USBAHB_FIFO4D                  */
#define _USBAHB_FIFO4D_FIFO4D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO4D              */
#define USBAHB_FIFO4D_FIFO4D_DEFAULT                       (_USBAHB_FIFO4D_FIFO4D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO4D      */

/* Bit fields for USBAHB FIFO5D */
#define _USBAHB_FIFO5D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO5D             */
#define _USBAHB_FIFO5D_MASK                                0x00000001UL                         /**< Mask for USBAHB_FIFO5D                      */
#define USBAHB_FIFO5D_FIFO5D                               (0x1UL << 0)                         /**< EP 5 Data                                   */
#define _USBAHB_FIFO5D_FIFO5D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO5D               */
#define _USBAHB_FIFO5D_FIFO5D_MASK                         0x1UL                                /**< Bit mask for USBAHB_FIFO5D                  */
#define _USBAHB_FIFO5D_FIFO5D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO5D              */
#define USBAHB_FIFO5D_FIFO5D_DEFAULT                       (_USBAHB_FIFO5D_FIFO5D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO5D      */

/* Bit fields for USBAHB FIFO6D */
#define _USBAHB_FIFO6D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO6D             */
#define _USBAHB_FIFO6D_MASK                                0x00000001UL                         /**< Mask for USBAHB_FIFO6D                      */
#define USBAHB_FIFO6D_FIFO6D                               (0x1UL << 0)                         /**< EP 6 Data                                   */
#define _USBAHB_FIFO6D_FIFO6D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO6D               */
#define _USBAHB_FIFO6D_FIFO6D_MASK                         0x1UL                                /**< Bit mask for USBAHB_FIFO6D                  */
#define _USBAHB_FIFO6D_FIFO6D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO6D              */
#define USBAHB_FIFO6D_FIFO6D_DEFAULT                       (_USBAHB_FIFO6D_FIFO6D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO6D      */

/* Bit fields for USBAHB FIFO7D */
#define _USBAHB_FIFO7D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO7D             */
#define _USBAHB_FIFO7D_MASK                                0xFFFFFFFFUL                         /**< Mask for USBAHB_FIFO7D                      */
#define _USBAHB_FIFO7D_FIFO7D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO7D               */
#define _USBAHB_FIFO7D_FIFO7D_MASK                         0xFFFFFFFFUL                         /**< Bit mask for USBAHB_FIFO7D                  */
#define _USBAHB_FIFO7D_FIFO7D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO7D              */
#define USBAHB_FIFO7D_FIFO7D_DEFAULT                       (_USBAHB_FIFO7D_FIFO7D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO7D      */

/* Bit fields for USBAHB FIFO8D */
#define _USBAHB_FIFO8D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO8D             */
#define _USBAHB_FIFO8D_MASK                                0xFFFFFFFFUL                         /**< Mask for USBAHB_FIFO8D                      */
#define _USBAHB_FIFO8D_FIFO8D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO8D               */
#define _USBAHB_FIFO8D_FIFO8D_MASK                         0xFFFFFFFFUL                         /**< Bit mask for USBAHB_FIFO8D                  */
#define _USBAHB_FIFO8D_FIFO8D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO8D              */
#define USBAHB_FIFO8D_FIFO8D_DEFAULT                       (_USBAHB_FIFO8D_FIFO8D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO8D      */

/* Bit fields for USBAHB FIFO9D */
#define _USBAHB_FIFO9D_RESETVALUE                          0x00000000UL                         /**< Default value for USBAHB_FIFO9D             */
#define _USBAHB_FIFO9D_MASK                                0xFFFFFFFFUL                         /**< Mask for USBAHB_FIFO9D                      */
#define _USBAHB_FIFO9D_FIFO9D_SHIFT                        0                                    /**< Shift value for USBAHB_FIFO9D               */
#define _USBAHB_FIFO9D_FIFO9D_MASK                         0xFFFFFFFFUL                         /**< Bit mask for USBAHB_FIFO9D                  */
#define _USBAHB_FIFO9D_FIFO9D_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for USBAHB_FIFO9D              */
#define USBAHB_FIFO9D_FIFO9D_DEFAULT                       (_USBAHB_FIFO9D_FIFO9D_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFO9D      */

/* Bit fields for USBAHB FIFORAM */
#define _USBAHB_FIFORAM_RESETVALUE                         0x00000000UL                           /**< Default value for USBAHB_FIFORAM            */
#define _USBAHB_FIFORAM_MASK                               0xFFFFFFFFUL                           /**< Mask for USBAHB_FIFORAM                     */
#define _USBAHB_FIFORAM_FIFORAM_SHIFT                      0                                      /**< Shift value for USBAHB_FIFORAM              */
#define _USBAHB_FIFORAM_FIFORAM_MASK                       0xFFFFFFFFUL                           /**< Bit mask for USBAHB_FIFORAM                 */
#define _USBAHB_FIFORAM_FIFORAM_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for USBAHB_FIFORAM             */
#define USBAHB_FIFORAM_FIFORAM_DEFAULT                     (_USBAHB_FIFORAM_FIFORAM_DEFAULT << 0) /**< Shifted mode DEFAULT for USBAHB_FIFORAM     */

/** @} End of group EFR32FG25_USBAHB_AHBS_BitFields */
/** @} End of group EFR32FG25_USBAHB_AHBS */
/** @} End of group Parts */

#endif /* EFR32FG25_USBAHB_H */
